#pragma once

// PUBG_VNG -64bit (4.2.0) SDK by BangJO [Z] DM @isar_hackJO To Buy Tool SDK

namespace SDK
{
//---------------------By BangJO---------------------------
//Script Structs
//---------------------By BangJO---------------------------

// UserDefinedStruct BP_STRUCT_UIElemLayoutDetail.BP_STRUCT_UIElemLayoutDetail
// 0x0030
struct FBP_STRUCT_UIElemLayoutDetail
{
	int                                                Type_23_55DBE0E544DAFBECC9EFB6BB17ABA028;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   Scale_17_041C81B04F88C44906CC9C9124ED2CF5;                // 0x0004(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              Opacity_7_DA1E8BC343F74DC18A9B0FBB6DA17CCB;               // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAnchors                                    AnchorType_16_8C6A88824F5B4009F1532EBCA05CA534;           // 0x0010(0x0010) (Edit, BlueprintVisible)
	struct FVector2D                                   RelativePos_19_41E2D4F647EC741044D6AC9C8DD94ED4;          // 0x0020(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector2D                                   OriginSize_22_61D9CB8A48FFB415806311A1771BDF74;           // 0x0028(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
};

}

