#pragma once

// PUBG_VNG -64bit (4.2.0) SDK by BangJO [Z] DM @isar_hackJO To Buy Tool SDK

namespace SDK
{
//---------------------By BangJO---------------------------
//Classes
//---------------------By BangJO---------------------------

// Class BlockyLuaCore.BlockBase
// 0x01D8 (0x0200 - 0x0028)
class UBlockBase : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class UBlockBase*                                  ParentBlock;                                              // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBlockBase*                                  CommentBlock;                                             // 0x0038(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBlockyGraph*                                HostGraph;                                                // 0x0040(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x28];                                      // 0x0048(0x0028) MISSED OFFSET
	class UBlockyGraphData*                            HostWidget;                                               // 0x0070(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0078(0x0010) MISSED OFFSET
	class UFunctionDesc*                               FunctionDesc;                                             // 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     DisplayName;                                              // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData03[0x148];                                     // 0x00A0(0x0148) MISSED OFFSET
	struct FString                                     QuoteVariableName;                                        // 0x01E8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bIsDisable;                                               // 0x01F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x01F9(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockBase");
		return pStaticClass;
	}


	void SetIsDisable(bool Disable);
	bool IsEvent();
	struct FVector2D GetCenterPos();
};


// Class BlockyLuaCore.Executeable
// 0x0230 (0x0430 - 0x0200)
class UExecuteable : public UBlockBase
{
public:
	unsigned char                                      UnknownData00[0x1C8];                                     // 0x0200(0x01C8) MISSED OFFSET
	TMap<struct FString, struct FBlockParam>           BlockParams;                                              // 0x03C8(0x0050) (BlueprintVisible, ZeroConstructor)
	TArray<class UNamedVar*>                           FuncVars;                                                 // 0x0418(0x0010) (BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0428(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.Executeable");
		return pStaticClass;
	}


	bool SupportFuncVar();
	void ReEditFuncVar(class UNamedVar* var);
	void DeleteFuncVar(class UNamedVar* var);
	void CreateFuncVar();
};


// Class BlockyLuaCore.AddArrayElement
// 0x0330 (0x0760 - 0x0430)
class UAddArrayElement : public UExecuteable
{
public:
	unsigned char                                      UnknownData00[0x330];                                     // 0x0430(0x0330) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.AddArrayElement");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.Arithmetic
// 0x0528 (0x0728 - 0x0200)
class UArithmetic : public UBlockBase
{
public:
	unsigned char                                      UnknownData00[0x528];                                     // 0x0200(0x0528) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.Arithmetic");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.ArrayLength
// 0x01A0 (0x03A0 - 0x0200)
class UArrayLength : public UBlockBase
{
public:
	unsigned char                                      UnknownData00[0x198];                                     // 0x0200(0x0198) MISSED OFFSET
	class UBrushData*                                  BrushBGSelected;                                          // 0x0398(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.ArrayLength");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.ExpressionBase
// 0x0000 (0x0028 - 0x0028)
class UExpressionBase : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.ExpressionBase");
		return pStaticClass;
	}


	static void ReleaseExpression(const struct FBlockyLuaHandle& ptr);
	static struct FBlockyLuaHandle CreateExpressionBase();
};


// Class BlockyLuaCore.ArrayLengthExpression
// 0x0000 (0x0028 - 0x0028)
class UArrayLengthExpression : public UExpressionBase
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.ArrayLengthExpression");
		return pStaticClass;
	}


	static void SetTarget(const struct FBlockyLuaHandle& ptr, const struct FBlockyLuaHandle& Target);
	static struct FBlockyLuaHandle GetTarget(const struct FBlockyLuaHandle& ptr);
	static struct FBlockyLuaHandle CreateArrayLengthExpression();
};


// Class BlockyLuaCore.VarBase
// 0x0000 (0x0200 - 0x0200)
class UVarBase : public UBlockBase
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.VarBase");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.NamedVar
// 0x02F8 (0x04F8 - 0x0200)
class UNamedVar : public UVarBase
{
public:
	struct FText                                       Name;                                                     // 0x0200(0x0018) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0218(0x0008) MISSED OFFSET
	struct FString                                     NameInCode;                                               // 0x0220(0x0010) (ZeroConstructor)
	bool                                               IsValueValid;                                             // 0x0230(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsSourceValid;                                            // 0x0231(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsInitColorLoad;                                          // 0x0232(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x0233(0x0005) MISSED OFFSET
	TArray<class UNamedVar*>                           CopiedChildVarCache;                                      // 0x0238(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData02[0x1D8];                                     // 0x0248(0x01D8) MISSED OFFSET
	bool                                               bIsArray;                                                 // 0x0420(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0421(0x0007) MISSED OFFSET
	struct FString                                     InitValueString;                                          // 0x0428(0x0010) (ZeroConstructor)
	class UColorDesc*                                  ColorDesc;                                                // 0x0438(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UColorDesc*>                          ArrayColorDesc;                                           // 0x0440(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                NowColorArrayIdx;                                         // 0x0450(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               NowColorIsArray;                                          // 0x0454(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0455(0x0003) MISSED OFFSET
	class UNamedVar*                                   Source;                                                   // 0x0458(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x40];                                      // 0x0460(0x0040) MISSED OFFSET
	class UBrushData*                                  CopyBrush;                                                // 0x04A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x50];                                      // 0x04A8(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.NamedVar");
		return pStaticClass;
	}


	void UpdateColor(const struct FLinearColor& Color);
	void SetNameVarColor(const struct FLinearColor& Color);
	void SetIsArray(bool IsArray);
	void SetInitValueString(const struct FString& Value);
	void SetDefiner(class UVarDefiner* Definer);
	void SetAccessType(TEnumAsByte<enum EBlockyAccessType> Access);
	bool IsGlobalVar();
	bool IsCustomColor();
	bool IsArray();
	void InitColorDesc();
	class UColorDesc* GetNameVarColorDesc(int idx, bool IsArray);
	struct FLinearColor GetNameVarColor(int idx, bool IsArray);
	struct FString GetInitValueString();
	class UVarDefiner* GetDefiner();
	struct FString GetColorStr(int idx, bool IsArray);
	TEnumAsByte<enum EBlockyAccessType> GetAccessType();
	void CallCustomSelectObject(int idx, bool IsArray);
	void AddColorToArray();
};


// Class BlockyLuaCore.ArrayNamedVar
// 0x0000 (0x04F8 - 0x04F8)
class UArrayNamedVar : public UNamedVar
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.ArrayNamedVar");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BinaryOperatorExpression
// 0x0000 (0x0028 - 0x0028)
class UBinaryOperatorExpression : public UExpressionBase
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BinaryOperatorExpression");
		return pStaticClass;
	}


	static void SetWithParentheses(const struct FBlockyLuaHandle& ptr, bool Value);
	static void SetRight(const struct FBlockyLuaHandle& ptr, const struct FBlockyLuaHandle& Value);
	static void SetOperation(const struct FBlockyLuaHandle& ptr, TEnumAsByte<enum EBlockyBinaryOperation> BlockyOp);
	static void SetLeft(const struct FBlockyLuaHandle& ptr, const struct FBlockyLuaHandle& Value);
	static bool GetWithParentheses(const struct FBlockyLuaHandle& ptr);
	static struct FBlockyLuaHandle GetRight(const struct FBlockyLuaHandle& ptr);
	static TEnumAsByte<enum EBlockyBinaryOperation> GetOperation(const struct FBlockyLuaHandle& ptr);
	static struct FBlockyLuaHandle GetLeft(const struct FBlockyLuaHandle& ptr);
	static struct FBlockyLuaHandle CreateBinaryOperatorExpression();
};


// Class BlockyLuaCore.CategoryDefiner
// 0x0090 (0x00B8 - 0x0028)
class UCategoryDefiner : public UObject
{
public:
	struct FString                                     Type;                                                     // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Menu;                                                     // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<struct FString, struct FString>               ShowNameMap;                                              // 0x0048(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShowIcon;                                                 // 0x0098(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShowIconSelected;                                         // 0x00A8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.CategoryDefiner");
		return pStaticClass;
	}


	struct FString GetCurrentLocateShowName();
};


// Class BlockyLuaCore.BlackboardDefiner
// 0x0020 (0x00D8 - 0x00B8)
class UBlackboardDefiner : public UCategoryDefiner
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x00B8(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlackboardDefiner");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyCommandData
// 0x0008 (0x0030 - 0x0028)
class UBlockyCommandData : public UObject
{
public:
	class UBlockBase*                                  bLock;                                                    // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyCommandData");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyAddOrRemoveFromSlotCommandData
// 0x00C0 (0x00F0 - 0x0030)
class UBlockyAddOrRemoveFromSlotCommandData : public UBlockyCommandData
{
public:
	struct FBlockPoint                                 Position;                                                 // 0x0030(0x0008)
	class UBlockBase*                                  SlotHostBlock;                                            // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0040(0x0018) MISSED OFFSET
	class UBlockBase*                                  ConvertBlock;                                             // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0060(0x0018) MISSED OFFSET
	class UBlockBase*                                  ReplacedBlock;                                            // 0x0078(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBlockBase*                                  ReplacedBlockSlotHostBlock;                               // 0x0080(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x68];                                      // 0x0088(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyAddOrRemoveFromSlotCommandData");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyAddOrRemoveFromTopCommandData
// 0x0050 (0x0080 - 0x0030)
class UBlockyAddOrRemoveFromTopCommandData : public UBlockyCommandData
{
public:
	class UBlockBase*                                  TouchBlock;                                               // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FBlockPoint                                 Position;                                                 // 0x0038(0x0008)
	class UBlockBase*                                  TouchBlockHostSlotHost;                                   // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0048(0x0018) MISSED OFFSET
	class UBlockBase*                                  SlotHostBlock;                                            // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0068(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyAddOrRemoveFromTopCommandData");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyBindCommentCommandData
// 0x0010 (0x0040 - 0x0030)
class UBlockyBindCommentCommandData : public UBlockyCommandData
{
public:
	struct FBlockPoint                                 Position;                                                 // 0x0030(0x0008)
	class UCommentBlock*                               CommentBlock;                                             // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyBindCommentCommandData");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyBlockListItemObject
// 0x00B8 (0x00E0 - 0x0028)
class UBlockyBlockListItemObject : public UObject
{
public:
	struct FText                                       Name;                                                     // 0x0028(0x0018) (Edit, BlueprintVisible)
	struct FString                                     KeyName;                                                  // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SubGraphName;                                             // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DisplayName;                                              // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     NameInCode;                                               // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FBlockPoint                                 Size;                                                     // 0x0080(0x0008) (Edit, BlueprintVisible)
	struct FBlockPoint                                 TextSize;                                                 // 0x0088(0x0008) (Edit, BlueprintVisible)
	struct FString                                     BlockClassName;                                           // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData00[0x10];                                      // 0x00A0(0x0010) MISSED OFFSET
	bool                                               Visible;                                                  // 0x00B0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               VisibleByTag;                                             // 0x00B1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x00B2(0x0006) MISSED OFFSET
	class UFunctionDesc*                               FunctionDesc;                                             // 0x00B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCollect;                                                 // 0x00C0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1F];                                      // 0x00C1(0x001F) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyBlockListItemObject");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyBlockListItemObject_Custom
// 0x0008 (0x00E8 - 0x00E0)
class UBlockyBlockListItemObject_Custom : public UBlockyBlockListItemObject
{
public:
	class UCustomConfig*                               CustomConfig;                                             // 0x00E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyBlockListItemObject_Custom");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyBlockListItemObject_Preset
// 0x01C8 (0x02A8 - 0x00E0)
class UBlockyBlockListItemObject_Preset : public UBlockyBlockListItemObject
{
public:
	class UPresetDesc*                                 SourcePreset;                                             // 0x00E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1C0];                                     // 0x00E8(0x01C0) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyBlockListItemObject_Preset");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyBlockListItemObject_Variable
// 0x0008 (0x00E8 - 0x00E0)
class UBlockyBlockListItemObject_Variable : public UBlockyBlockListItemObject
{
public:
	class UNamedVar*                                   SourceVar;                                                // 0x00E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyBlockListItemObject_Variable");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyCategoryItemObject
// 0x00C0 (0x00E8 - 0x0028)
class UBlockyCategoryItemObject : public UObject
{
public:
	struct FText                                       Name;                                                     // 0x0028(0x0018) (Edit, BlueprintVisible)
	struct FString                                     Type;                                                     // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MenuType;                                                 // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UBlockyBlockListItemObject*>          Items;                                                    // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UBlockyBlockListItemObject*>          AddItems;                                                 // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UBlockyBlockListItemObject*>          DelItems;                                                 // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UPresetDesc*>                         Presets;                                                  // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               Visible;                                                  // 0x00A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               VisibleByTag;                                             // 0x00A1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ShowNum;                                                  // 0x00A2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x00A3(0x0005) MISSED OFFSET
	class UBrushData*                                  Brush;                                                    // 0x00A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  BrushSelected;                                            // 0x00B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x00B8(0x0010) MISSED OFFSET
	class UBlackboardDefiner*                          Blackboard;                                               // 0x00C8(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsPlayerBlackboard;                                      // 0x00D0(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsShowRedDot;                                            // 0x00D1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x16];                                      // 0x00D2(0x0016) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyCategoryItemObject");
		return pStaticClass;
	}


	void SetShowRedDotVar(bool var);
	void InitShowRedDotVar(const struct FString& BlockName);
	struct FSlateBrush GetSelectedIconBrush();
	int GetNewBlockNums();
	struct FSlateBrush GetIconBrush();
};


// Class BlockyLuaCore.BlockyCommand
// 0x00D8 (0x0100 - 0x0028)
class UBlockyCommand : public UObject
{
public:
	unsigned char                                      UnknownData00[0xA8];                                      // 0x0028(0x00A8) MISSED OFFSET
	class UBlockyCommandData*                          UndoData;                                                 // 0x00D0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBlockyCommandData*                          RedoData;                                                 // 0x00D8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBlockyGraph*                                Graph;                                                    // 0x00E0(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<class UBlockyCommand*>                      AdditionCommands;                                         // 0x00E8(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x00F8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyCommand");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyDeleteCommandData
// 0x00A0 (0x00D0 - 0x0030)
class UBlockyDeleteCommandData : public UBlockyCommandData
{
public:
	struct FBlockPoint                                 Position;                                                 // 0x0030(0x0008)
	class UBlockBase*                                  NextBlock;                                                // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0040(0x0018) MISSED OFFSET
	class UBlockBase*                                  HostSlotBlock;                                            // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x70];                                      // 0x0060(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyDeleteCommandData");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyEditorInterface
// 0x0000 (0x0028 - 0x0028)
class UBlockyEditorInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyEditorInterface");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyGraph
// 0x0120 (0x0148 - 0x0028)
class UBlockyGraph : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET
	struct FString                                     Name;                                                     // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Type;                                                     // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DisplayName;                                              // 0x0058(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TemplateName;                                             // 0x0068(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Description;                                              // 0x0078(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CategoryMode;                                             // 0x0088(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CapturePath;                                              // 0x0098(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     JsonPath;                                                 // 0x00A8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bCanBeDuplicated;                                         // 0x00B8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsDisable;                                               // 0x00B9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x00BA(0x0006) MISSED OFFSET
	class UBlockyGraphData*                            HostGraphData;                                            // 0x00C0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UBlockBase*>                          RootBlocks;                                               // 0x00C8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UNamedVar*>                           LocalVars;                                                // 0x00D8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                CurrentVisibleBlockNum;                                   // 0x00E8(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xC];                                       // 0x00EC(0x000C) MISSED OFFSET
	class UCanvasRenderTarget2D*                       RenderTarget;                                             // 0x00F8(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ViewPosition;                                             // 0x0100(0x0008) (BlueprintVisible, IsPlainOldData)
	struct FBlockPoint                                 ViewSize;                                                 // 0x0108(0x0008) (BlueprintVisible)
	float                                              ViewScale;                                                // 0x0110(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x34];                                      // 0x0114(0x0034) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyGraph");
		return pStaticClass;
	}


	void UpdateCustomBlockName();
	void TryAdjustingBlockIntoView(class UBlockyGraphData* GraphData);
	void SetIsDisable(bool Disable);
	void SaveGraphToFile(const struct FString& Filename, bool IsNewFile);
	bool SaveGraphAsTemplate(TArray<unsigned char>* OutData);
	void LoadGraphFromTemplate(TArray<unsigned char> Data, bool IsLoadPresetsInGraph);
	bool IsCustomTemplateGraph();
	bool IsCustomGraph();
	bool IsBasicTemplateGraph();
	TArray<class UBlockBase*> GetTriggerItemsByRootBlocks();
	int GetTotalBlockNum();
	class UTexture2D* CaptureScreenWithShot(class UUserWidget* Widget, const struct FVector2D& rect);
	void CaptureScreenShot(class UUserWidget* Widget);
	bool CanSaveAsTemplate(struct FString* OutFailedReason);
	bool CanBeRemove(class UBlockyGraphData* GraphData);
	bool CanBeDuplicated();
};


// Class BlockyLuaCore.BlockyGraphWidgetInterface
// 0x0000 (0x0028 - 0x0028)
class UBlockyGraphWidgetInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyGraphWidgetInterface");
		return pStaticClass;
	}

};


// Class BlockyLuaCore.BlockyGraphData
// 0x06A8 (0x06D0 - 0x0028)
class UBlockyGraphData : public UObject
{
public:
	TScriptInterface<class UBlockyGraphWidgetInterface> GraphWidgetInterface;                                     // 0x0028(0x0010) (ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ViewPosition;                                             // 0x0038(0x0008) (BlueprintVisible, IsPlainOldData)
	struct FBlockPoint                                 ViewSize;                                                 // 0x0040(0x0008) (BlueprintVisible)
	float                                              ViewScale;                                                // 0x0048(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
	struct FVector2D                                   DisplayBlockSize;                                         // 0x0050(0x0008) (IsPlainOldData)
	unsigned char                                      UnknownData01[0x88];                                      // 0x0058(0x0088) MISSED OFFSET
	bool                                               bShowDeleteBlockUI;                                       // 0x00E0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x00E1(0x0007) MISSED OFFSET
	class UNamedVar*                                   EditingVar;                                               // 0x00E8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UNamedVar*>                           GlobalVars;                                               // 0x00F0(0x0010) (BlueprintVisible, ZeroConstructor)
	TMap<struct FString, class UPresetDesc*>           PresetDescMap_Graph;                                      // 0x0100(0x0050) (BlueprintVisible, ZeroConstructor)
	class UCustomConfig*                               EditingCustomConfig;                                      // 0x0150(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TMap<struct FGuid, class UCustomConfig*>           TemplateCustomConfigs;                                    // 0x0158(0x0050) (ZeroConstructor)
	TMap<struct FGuid, class UCustomConfig*>           GameEventConfigs;                                         // 0x01A8(0x0050) (BlueprintVisible, ZeroConstructor)
	class UExecuteable*                                CurrExeBlock;                                             // 0x01F8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UExecuteable*                                EditingExeBlock;                                          // 0x0200(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UBlockyGraph*>                        SubBlockyGraphs;                                          // 0x0208(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class UBlockyGraph*>                        BlockyGraphsCallStack;                                    // 0x0218(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TMap<struct FString, struct FString>               CacheData;                                                // 0x0228(0x0050) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FText                                       Name;                                                     // 0x0278(0x0018)
	class UBlockBase*                                  CurrentPutSlotHostBlock;                                  // 0x0290(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x18];                                      // 0x0298(0x0018) MISSED OFFSET
	class UBlockBase*                                  CurrentPutSlotReplacedBlock;                              // 0x02B0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBlockBase*                                  CurrentTopPutBlock;                                       // 0x02B8(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x02C0(0x0008) MISSED OFFSET
	class UBlockBase*                                  CurrentSettingBlock;                                      // 0x02C8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USelectionData*                              CurrentSelection;                                         // 0x02D0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USelectionData*                              CurrentPointAt;                                           // 0x02D8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UExecuteablePreview*                         BlockPreview;                                             // 0x02E0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnSaveProgress;                                           // 0x02E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               IsGraphDirty;                                             // 0x02F8(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsLoading;                                                // 0x02F9(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0xE];                                       // 0x02FA(0x000E) MISSED OFFSET
	class UBrushData*                                  DefaultRectBrush;                                         // 0x0308(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterial*                                   PreViewMaterial;                                          // 0x0310(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  PreViewBrush;                                             // 0x0318(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  AnimateBrush;                                             // 0x0320(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    DeleteUIDynamicMaterial;                                  // 0x0328(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    DeleteRangeUIDynamicMaterial;                             // 0x0330(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    DeleteUIBgDynamicMaterial;                                // 0x0338(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  DeleteRangeUIDockingBrush;                                // 0x0340(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  DeleteUIDockingBrush;                                     // 0x0348(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBrushData*                                  DeleteUIBgBrush;                                          // 0x0350(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x20];                                      // 0x0358(0x0020) MISSED OFFSET
	class UBlockBase*                                  TouchBlockHostSlotHost;                                   // 0x0378(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0xE8];                                      // 0x0380(0x00E8) MISSED OFFSET
	struct FScriptDelegate                             OnOpenCustomPanel;                                        // 0x0468(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenCustomPopup;                                        // 0x0478(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenCustomSavePopup;                                    // 0x0488(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnCloseCustomPopup;                                       // 0x0498(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenVariablePopup;                                      // 0x04A8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenBlackboardPopup;                                    // 0x04B8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnCloseVariablePopup;                                     // 0x04C8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenVariable;                                           // 0x04D8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnUpdateUndoRedoState;                                    // 0x04E8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnShowTips;                                               // 0x04F8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnShowInitUI;                                             // 0x0508(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenVariablePanel;                                      // 0x0518(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenCreateBlackboardPanel;                              // 0x0528(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenEditBlackboardPanel;                                // 0x0538(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenCreateCustomVarPanel;                               // 0x0548(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenEditCustomVarPanel;                                 // 0x0558(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OpenDelCustomVarPanel;                                    // 0x0568(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnQuoteBlock;                                             // 0x0578(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnShowBlockSettingPop;                                    // 0x0588(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenCommentPopup;                                       // 0x0598(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnCloseCommentPopup;                                      // 0x05A8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnSetBlockLogNum;                                         // 0x05B8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnSetBlockLogTabNum;                                      // 0x05C8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnSetBlockLogText;                                        // 0x05D8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnClearBlockLog;                                          // 0x05E8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnOpenAnimationPopup;                                     // 0x05F8(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnCloseAnimationPopup;                                    // 0x0608(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             OnShowBlockVariablePopup;                                 // 0x0618(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData08[0x10];                                      // 0x0628(0x0010) MISSED OFFSET
	TArray<struct FString>                             OpendItemStrings;                                         // 0x0638(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FString                                     CurSelectTriggerType;                                     // 0x0648(0x0010) (BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData09[0x1];                                       // 0x0658(0x0001) MISSED OFFSET
	bool                                               IsOpenedCaption;                                          // 0x0659(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x76];                                      // 0x065A(0x0076) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLuaCore.BlockyGraphData");
		return pStaticClass;
	}


	void UseTemplate(class UBlockyGraph* templateGraph);
	void UpdateVariableMenu();
	TArray<struct FText> UpdateVariableItemNames();
	void UpdateCustomMenu();
	TArray<struct FText> UpdateCustomItemNames();
	void UpdateAllPresetInGraph();
	void UpdateAfterLoadBin();
	void Undo();
	void TryCloseItemList();
	void ShowTips(const struct FText& Tips);
	void ShowBlockSettingPop();
	void SetSlotString(const struct FBlockySlotString& slotStr);
	void SetGraphStrings(const struct FGraphString& graphStr);
	void SetCustomVariableString(const struct FCustomVariableString& variableStr);
	void SetCustomConfigString(const struct FCustomConfigString& configStr);
	void SetCurrentSubGraph(const struct FString& InName);
	void SetCacheData(TMap<struct FString, struct FString> Data);
	void SetBlockLogText(EBlockyLogMsgMode Mode, class UBlockBase* BlockSource, const struct FString& SlotID, const struct FString& Info);
	void SetBlockLogTabNum(int Mode, int Num);
	void SetBlockLogNum(int Mode, int Num);
	struct FString SaveGraphToJsonText();
	void SaveGraphToBinFile(const struct FString& FilePath);
	TArray<unsigned char> SaveGraphToBin();
	struct FString SaveGlobalVarToJsonText();
	TArray<unsigned char> SaveGlobalVarToBin();
	void SaveCustom();
	void Save();
	void ReturnToPreviewGraph();
	void ReturnToMainGraph();
	void ResetGraph();
	void RemoveSubGraph(const struct FString& InName);
	void RefreshFont();
	void ReEditVariable(int Index);
	void Redo();
	void QuoteVariable(int Index);
	void QuoteCustom();
	void Quote();
	void Paste();
	void OpenGuideWebUrl();
	void OnLoadFinished();
	void MarkGraphDirty();
	void LoadGraphFromJsonText(const struct FString& JsonStr);
	void LoadGraphFromBinFile(const struct FString& FilePath);
	void LoadGlobalVarFromJsonText(const struct FString& JsonStr);
	void LoadByTicker();
	void Load();
	class UBlockBase* JumpToFocusSlotByIdStrAndIdx(const struct FString& blockId, unsigned char idx);
	class UBlockBase* JumpToFocusSlotByIdStr(const struct FString& blockId, const struct FString& TargetSlotIdStr);
	class UBlockBase* JumpToFocusBlockByIdStr(const struct FString& blockId);
	bool ItemHasOpend(const struct FString& ItemStringName);
	bool IsGraphChanged();
	bool IsFirstGraph();
	bool IsBlockGuideButton();
	bool HasExecutableCode();
	void GM_LoadGraph_DS();
	void GM_GenerateAllBlocks(int CombinedBlocksNum, int GraphBlocksNum);
	TArray<struct FString> GetTriggerList();
	TArray<struct FString> GetTLogType();
	TMap<struct FString, struct FString> GetTLog();
	TArray<class UBlockBase*> GetQuoteVariableItem(class UBlockyGraph* Graph);
	TArray<class UBlockyGraph*> GetQuoteVariableGraph(int Index);
	TArray<class UPresetDesc*> GetPresetDescArray(bool LocalOnly);
	int GetNewBlocksNumWithMenu(const struct FString& menuItemName);
	bool GetIsDisableComment();
	TArray<struct FGraphString> GetGraphStrings();
	TMap<struct FString, struct FString> GetGraphMap();
	TArray<class UFunctionDesc*> GetFunctionDescArray();
	void GetDeleteBlockUIRect(float InRectWidth);
	TArray<struct FCustomVariableString> GetCustomVariableStrings();
	TArray<struct FText> GetCustomNames();
	TArray<class UCustomConfig*> GetCustomEventConfigs(bool isCloudGameEvent);
	TArray<struct FCustomConfigString> GetCustomConfigStrings();
	int GetCurrentGraphBlockyNumberByType(EBlockyCurrentGraphBlockyNumberType Type);
	class UBlockyGraph* GetCurrentGraph();
	int GetCurrentBlockyNumByMune(const struct FString& Menu, const struct FString& Category);
	TMap<struct FString, struct FString> GetCacheData();
	TArray<struct FBlockySlotString> GetBlockyStringDatasInPair();
	TArray<class UBlockBase*> GetBlocks();
	TArray<class UBlockBase*> GetAllBlockyInGraph();
	TMap<struct FString, int> GetAllBlockByKeyName();
	class UBlockBase* FocusToSlotByBlockySlotId(const struct FBlockySlotString& SlotID);
	void FocusToSlot(class UBlockBase* TargetBlock, const struct FString& TargetSlotIdStr);
	void FocusTo(class UBlockBase* TargetBlock);
	void FinishVariableEdit(bool bSaveVar, bool bReEdit);
	void FinishCustomEdit(bool bSave);
	void FinishBlockSetting(bool bSaveVar);
	class UBlockBase* FindBlockByIdStr(const struct FString& blockId);
	void EmptyListItemSeleceted();
	void Eject();
	void EditVariable();
	void EditCustumBlockGraph();
	void EditCustom();
	void DuplicateSubGraph(const struct FString& SrcName);
	void DuplicateBlock(class UBlockBase* bLock);
	void Disable();
	void DeleteVariableListItem(int Index);
	void DeleteSelected();
	void DeleteCustom();
	void DeleteBlocks();
	void DeleteBlockInGraph(class UBlockyGraph* InGraph, class UBlockBase* bLock);
	void DeleteBlockAndNextInGraph(class UBlockyGraph* InGraph, class UBlockBase* bLock);
	void DeleteBlockAndNext(class UBlockBase* bLock);
	void DeleteBlock(class UBlockBase* bLock);
	void DefineCustom();
	void Define();
	int CustomNumByType(TEnumAsByte<enum ECustomBlockType> CustomType);
	TArray<class UBlockyGraph*> CurSelectSubBlockyGraphs();
	void Copy();
	void Comment();
	void Clone();
	void ClearUndoRedoDatas();
	void ClearTextSizeCache();
	void ClearGraphDirty();
	void ClearBlockLog();
	bool CheckReports();
	void AsyncLoadGraphFromBinFile(const struct FString& FilePath, const struct FScriptDelegate& Callback);
	struct FString AddSubGraph(const struct FString& InName, const struct FString& InType);
	void AddOpendNameToArr(const struct FString& ItemStringName);
	class UBlockyGraph* AddGraph(const struct FString& InName, const struct FString& InType);
	void AddGlobalComment();
};


// Class BlockyLuaCore.BlockyLuaConfig
// 0x1580 (0x15A8 - 0x0028)
class UBlockyLuaConfig : public UObject
{
public:
	int                                                MaxBlockCount;                                            // 0x0028(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	int                                                MaxBlockCountInGraph;                                     // 0x002C(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	int                                                MaxBlockCountInViewport;                                  // 0x0030(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	int                                                MaxBlockCountInOneBlock;                                  // 0x0034(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0038(0x0050) UNKNOWN PROPERTY: SetProperty BlockyLuaCore.BlockyLuaConfig.DisabledFuncSet
	unsigned char                                      UnknownData01[0x50];                                      // 0x0088(0x0050) UNKNOWN PROPERTY: SetProperty BlockyLuaCore.BlockyLuaConfig.BlockReginsSet
	bool                                               bShowGuideButton;                                         // 0x00D8(0x0001) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x00D9(0x0007) MISSED OFFSET
	TMap<struct FString, struct FString>               ReginsGuideUrlSet;                                        // 0x00E0(0x0050) (Edit, ZeroConstructor, Config)
	float                                              GraphMinScale;                                            // 0x0130(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              GraphMaxScale;                                            // 0x0134(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              DragCheckDelta;                                           // 0x0138(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              EjectOffsetX;                                             // 0x013C(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              EjectOffsetY;                                             // 0x0140(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	float                                              PasteOffsetMaxCount;                                      // 0x0144(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	struct FVector2D                                   PasteOffset;                                              // 0x0148(0x0008) (Edit, Config, IsPlainOldData)
	struct FVector2D                                   ExecuteableSnapPositionOffset;                            // 0x0150(0x0008) (Edit, Config, IsPlainOldData)
	ESlotClickType                                     DefaultArrayTypeFilterClickType;                          // 0x0158(0x0001) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0158(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	unsigned char                                      UnknownData04[0x4];                                       // 0x015C(0x0004) MISSED OFFSET
	TArray<struct FString>                             NameInvalidChar;                                          // 0x0160(0x0010) (ZeroConstructor)
	struct FString                                     InvalidTranslateString;                                   // 0x0170(0x0010) (Edit, ZeroConstructor, Config)
	struct FString                                     InvalidTranslateMaskString;                               // 0x0180(0x0010) (Edit, ZeroConstructor, Config)
	struct FString                                     ArrayInitStringStart;                                     // 0x0190(0x0010) (Edit, ZeroConstructor, Config)
	struct FString                                     ArrayInitStringEnd;                                       // 0x01A0(0x0010) (Edit, ZeroConstructor, Config)
	unsigned char                                      ArrangeMaxTimePerFrame;                                   // 0x01B0(0x0001) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x01B1(0x0007) MISSED OFFSET
	struct FSoftObjectPath                             FontName;                                                 // 0x01B8(0x0018) (Edit, Config)
	int                                                FontSize;                                                 // 0x01D0(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x01D4(0x0004) MISSED OFFSET
	struct FSlateFontInfo                              CustomDefaultFont;                                        // 0x01D8(0x0058) (Edit, Config)
