#pragma once

// PUBG_VNG -64bit (4.2.0) SDK by BangJO [Z] DM @isar_hackJO To Buy Tool SDK

namespace SDK
{
//---------------------By BangJO---------------------------
//Enums
//---------------------By BangJO---------------------------

// Enum AI.EAISoundCollectType
enum class EAISoundCollectType : uint8_t
{
	EAISoundCollectType__AISoundCollectType_Step = 0,
	EAISoundCollectType__AISoundCollectType_Weapon = 1,
	EAISoundCollectType__AISoundCollectType_Vehicle = 2,
	EAISoundCollectType__AISoundCollectType_Horn = 3,
	EAISoundCollectType__AISoundCollectType_Grenade = 4,
	EAISoundCollectType__AISoundCollectType_MAX = 5
};


// Enum AI.EObstacleDetectionSpace
enum class EObstacleDetectionSpace : uint8_t
{
	EObstacleDetectionSpace__ObstacleDetection_Box = 0,
	EObstacleDetectionSpace__ObstacleDetection_CapsuleSweep = 1,
	EObstacleDetectionSpace__ObstacleDetection_MAX = 2
};


// Enum AI.EAICheckFlyingStatusType
enum class EAICheckFlyingStatusType : uint8_t
{
	EAICheckFlyingStatusType__FlyingStatus_HasNavigationSystem = 0,
	EAICheckFlyingStatusType__FlyingStatus_NavigationVoxelDataDone = 1,
	EAICheckFlyingStatusType__FlyingStatus_MAX = 2
};


// Enum AI.EAIOcclusionPointPoseType
enum class EAIOcclusionPointPoseType : uint8_t
{
	EAIOcclusionPointPoseType__Occlusion_PoseProne = 0,
	EAIOcclusionPointPoseType__Occlusion_PoseCrouch = 1,
	EAIOcclusionPointPoseType__Occlusion_PoseStand = 2,
	EAIOcclusionPointPoseType__Occlusion_PoseBush = 3,
	EAIOcclusionPointPoseType__Occlusion_MAX = 4
};


// Enum AI.EAICheckShootingPoseType
enum class EAICheckShootingPoseType : uint8_t
{
	EAICheckShootingPoseType__ShootingPose_Normal = 0,
	EAICheckShootingPoseType__ShootingPose_Stand = 1,
	EAICheckShootingPoseType__ShootingPose_Peek = 2,
	EAICheckShootingPoseType__ShootingPose_WaitVisibilityCheck = 3,
	EAICheckShootingPoseType__ShootingPose_MAX = 4
};


// Enum AI.EDistanceCheckType
enum class EDistanceCheckType : uint8_t
{
	FixedDistance                  = 0,
	BlackBoardKey                  = 1,
	ApplySensedRadius              = 2,
	EDistanceCheckType_MAX         = 3
};


// Enum AI.ECompareLengthType
enum class ECompareLengthType : uint8_t
{
	ELengthGreater                 = 0,
	ELengthLess                    = 1,
	ELengthEequal                  = 2,
	ECompareLengthType_MAX         = 3
};


// Enum AI.EAIDecoratorGeneralLineTraceType
enum class EAIDecoratorGeneralLineTraceType : uint8_t
{
	EAIDecoratorGeneralLineTraceType__LineTraceType_Forward = 0,
	EAIDecoratorGeneralLineTraceType__LineTraceType_MAX = 1
};


// Enum AI.EInSafetyCircleType
enum class EInSafetyCircleType : uint8_t
{
	EInSafetyCircleType__EInSafetyCircleType_None = 0,
	EInSafetyCircleType__EInSafetyCircleType_BlueCircle = 1,
	EInSafetyCircleType__EInSafetyCircleType_WhiteCircle = 2,
	EInSafetyCircleType__EInSafetyCircleType_MAX = 3
};


// Enum AI.EItemNumCheckType
enum class EItemNumCheckType : uint8_t
{
	ItemNumGreater                 = 0,
	ItemNumLess                    = 1,
	ItemNumEequal                  = 2,
	EItemNumCheckType_MAX          = 3
};


// Enum AI.EChooseEnemySearchMethod
enum class EChooseEnemySearchMethod : uint8_t
{
	EChooseEnemySearchMethod__SearchMethod_Nearest = 0,
	EChooseEnemySearchMethod__SearchMethod_MostHP = 1,
	EChooseEnemySearchMethod__SearchMethod_LeastHP = 2,
	EChooseEnemySearchMethod__SearchMethod_ByBlackboardValue = 3,
	EChooseEnemySearchMethod__SearchMethod_MAX = 4
};


// Enum AI.EChooseEnemyType
enum class EChooseEnemyType : uint8_t
{
	EChooseEnemyType__EnemyType_Player = 0,
	EChooseEnemyType__EnemyType_Animal = 1,
	EChooseEnemyType__EnemyType_Zombie = 2,
	EChooseEnemyType__EnemyType_UAV = 3,
	EChooseEnemyType__EnemyType_MAX = 4
};


// Enum AI.EAISearchTeammateType
enum class EAISearchTeammateType : uint8_t
{
	EAISearchTeammateType__Nearest = 0,
	EAISearchTeammateType__LeastHP = 1,
	EAISearchTeammateType__EAISearchTeammateType_MAX = 2
};


// Enum AI.EMobAddHPServiceType
enum class EMobAddHPServiceType : uint8_t
{
	EMobAddHPServiceType__LoseTarget = 0,
	EMobAddHPServiceType__EMobAddHPServiceType_MAX = 1
};


// Enum AI.EAISearchEnemyType
enum class EAISearchEnemyType : uint8_t
{
	EAISearchEnemyType__Nearest    = 0,
	EAISearchEnemyType__Random     = 1,
	EAISearchEnemyType__Farthest   = 2,
	EAISearchEnemyType__EAISearchEnemyType_MAX = 3
};


// Enum AI.EAISearchEnemyEntityType
enum class EAISearchEnemyEntityType : uint8_t
{
	EAISearchEnemyEntityType__PlayerOnly = 0,
	EAISearchEnemyEntityType__PlayerAndMob = 1,
	EAISearchEnemyEntityType__EAISearchEnemyEntityType_MAX = 2
};


// Enum AI.EAISearchEnemySingleRule
enum class EAISearchEnemySingleRule : uint8_t
{
	EAISearchEnemySingleRule__SingleRule_Hatred = 0,
	EAISearchEnemySingleRule__SingleRule_Random = 1,
	EAISearchEnemySingleRule__SingleRule_Nearest = 2,
	EAISearchEnemySingleRule__SingleRule_Farthest = 3,
	EAISearchEnemySingleRule__SingleRule_MostHP = 4,
	EAISearchEnemySingleRule__SingleRule_PoorHP = 5,
	EAISearchEnemySingleRule__SingleRule_BlackboardValue = 6,
	EAISearchEnemySingleRule__SingleRule_MAX = 7
};


// Enum AI.EAISenseGrenadeType
enum class EAISenseGrenadeType : uint8_t
{
	EAISenseGrenadeType__ExplosionGrenade = 0,
	EAISenseGrenadeType__BurningGrenade = 1,
	EAISenseGrenadeType__SmokingGrenade = 2,
	EAISenseGrenadeType__FlashBomb = 3,
	EAISenseGrenadeType__Grenade_MaxNum = 4,
	EAISenseGrenadeType__EAISenseGrenadeType_MAX = 5
};


// Enum AI.ETargetAngleCheck
enum class ETargetAngleCheck : uint8_t
{
	TargetAngleCheckFocus          = 0,
	TargetAngleCheckFocusFail      = 1,
	TargetAngleCheckFocusSuccess   = 2,
	ETargetAngleCheck_MAX          = 3
};


// Enum AI.EVHQueryEnemyRule
enum class EVHQueryEnemyRule : uint8_t
{
	EVHQueryEnemyRule__Nearest     = 0,
	EVHQueryEnemyRule__Random      = 1,
	EVHQueryEnemyRule__EVHQueryEnemyRule_MAX = 2
};


// Enum AI.EVHEnemyType
enum class EVHEnemyType : uint8_t
{
	EVHEnemyType__EVHEnemyType_Player = 0,
	EVHEnemyType__EVHEnemyType_Car = 1,
	EVHEnemyType__EVHEnemyType_Mob = 2,
	EVHEnemyType__EVHEnemyType_FakePlayer = 3,
	EVHEnemyType__EVHEnemyType_MAX = 4
};


// Enum AI.EAIAdvFindOcclusionPointSearchBestOcclusionMethod
enum class EAIAdvFindOcclusionPointSearchBestOcclusionMethod : uint8_t
{
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_Normal = 0,
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_NearToTarget = 1,
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_FarToTarget = 2,
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_NearToSelf = 3,
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_RandomOfSelf = 4,
	EAIAdvFindOcclusionPointSearchBestOcclusionMethod__Method_MAX = 5
};


// Enum AI.EAIAdvFindOcclusionPointPoseType
enum class EAIAdvFindOcclusionPointPoseType : uint8_t
{
	EAIAdvFindOcclusionPointPoseType__Occlusion_PoseProne = 0,
	EAIAdvFindOcclusionPointPoseType__Occlusion_PoseCrouch = 1,
	EAIAdvFindOcclusionPointPoseType__Occlusion_PoseStand = 2,
	EAIAdvFindOcclusionPointPoseType__Occlusion_PoseBush = 3,
	EAIAdvFindOcclusionPointPoseType__Occlusion_MAX = 4
};


// Enum AI.EBioVHMoveType
enum class EBioVHMoveType : uint8_t
{
	EBioVHMoveType__EMoveType_Normal = 0,
	EBioVHMoveType__EMoveType_Backward = 1,
	EBioVHMoveType__EMoveType_Directly = 2,
	EBioVHMoveType__EMoveType_MAX  = 3
};


// Enum AI.EFindFlyingHoverPointOneSideShapeOType
enum class EFindFlyingHoverPointOneSideShapeOType : uint8_t
{
	EFindFlyingHoverPointOneSideShapeOType__OT_RandomSide = 0,
	EFindFlyingHoverPointOneSideShapeOType__OT_LeftSide = 1,
	EFindFlyingHoverPointOneSideShapeOType__OT_RightSide = 2,
	EFindFlyingHoverPointOneSideShapeOType__OT_MAX = 3
};


// Enum AI.EFindFlyingHoverPointHoverType
enum class EFindFlyingHoverPointHoverType : uint8_t
{
	EFindFlyingHoverPointHoverType__HT_OneSideShapeO = 0,
	EFindFlyingHoverPointHoverType__HT_MAX = 1
};


// Enum AI.EFlyToPathfindingThread
enum class EFlyToPathfindingThread : uint8_t
{
	EFlyToPathfindingThread__Sync  = 0,
	EFlyToPathfindingThread__ASync = 1,
	EFlyToPathfindingThread__EFlyToPathfindingThread_MAX = 2
};


// Enum AI.EMobFindAttackablePositionLineTraceType
enum class EMobFindAttackablePositionLineTraceType : uint8_t
{
	EMobFindAttackablePositionLineTraceType__Normal = 0,
	EMobFindAttackablePositionLineTraceType__HalfHeightOffset = 1,
	EMobFindAttackablePositionLineTraceType__CustomHeightOffset = 2,
	EMobFindAttackablePositionLineTraceType__EMobFindAttackablePositionLineTraceType_MAX = 3
};


// Enum AI.ESearchType
enum class ESearchType : uint8_t
{
	ESearchType__CenterInSelfLocation = 0,
	ESearchType__CenterInSpecificLocation = 1,
	ESearchType__ESearchType_MAX   = 2
};


// Enum AI.EAIMoveToOcclusionFinishMovePoseType
enum class EAIMoveToOcclusionFinishMovePoseType : uint8_t
{
	EAIMoveToOcclusionFinishMovePoseType__FinishMovePoseType_Normal = 0,
	EAIMoveToOcclusionFinishMovePoseType__FinishMovePoseType_CrouchIfACrouchOcclusion = 1,
	EAIMoveToOcclusionFinishMovePoseType__FinishMovePoseType_MAX = 2
};


// Enum AI.EAIMoveToOcclusionMovingPoseType
enum class EAIMoveToOcclusionMovingPoseType : uint8_t
{
	EAIMoveToOcclusionMovingPoseType__MovingPoseType_Normal = 0,
	EAIMoveToOcclusionMovingPoseType__MovingPoseType_CrouchSprintIfAlreadyCrouched = 1,
	EAIMoveToOcclusionMovingPoseType__MovingPoseType_MAX = 2
};


// Enum AI.EAIMoveToOcclusionSearchBestOcclusionMethod
enum class EAIMoveToOcclusionSearchBestOcclusionMethod : uint8_t
{
	EAIMoveToOcclusionSearchBestOcclusionMethod__Normal = 0,
	EAIMoveToOcclusionSearchBestOcclusionMethod__NearToTarget = 1,
	EAIMoveToOcclusionSearchBestOcclusionMethod__FarToTarget = 2,
	EAIMoveToOcclusionSearchBestOcclusionMethod__NearToSelf = 3,
	EAIMoveToOcclusionSearchBestOcclusionMethod__RandomOfSelf = 4,
	EAIMoveToOcclusionSearchBestOcclusionMethod__EAIMoveToOcclusionSearchBestOcclusionMethod_MAX = 5
};


// Enum AI.EAIMoveToOcclusionPoseType
enum class EAIMoveToOcclusionPoseType : uint8_t
{
	EAIMoveToOcclusionPoseType__PoseProne = 0,
	EAIMoveToOcclusionPoseType__PoseCrouch = 1,
	EAIMoveToOcclusionPoseType__PoseStand = 2,
	EAIMoveToOcclusionPoseType__PoseBush = 3,
	EAIMoveToOcclusionPoseType__EAIMoveToOcclusionPoseType_MAX = 4
};


// Enum AI.ESeekFlyPointHorizontalAngleType
enum class ESeekFlyPointHorizontalAngleType : uint8_t
{
	ESeekFlyPointHorizontalAngleType__TargetView = 0,
	ESeekFlyPointHorizontalAngleType__TargetToSelf = 1,
	ESeekFlyPointHorizontalAngleType__BornLocationView = 2,
	ESeekFlyPointHorizontalAngleType__ESeekFlyPointHorizontalAngleType_MAX = 3
};


// Enum AI.ESeekFlyPointCenterLocType
enum class ESeekFlyPointCenterLocType : uint8_t
{
	ESeekFlyPointCenterLocType__Target = 0,
	ESeekFlyPointCenterLocType__Self = 1,
	ESeekFlyPointCenterLocType__BornLocation = 2,
	ESeekFlyPointCenterLocType__ESeekFlyPointCenterLocType_MAX = 3
};


// Enum AI.ELocateType
enum class ELocateType : uint8_t
{
	ELocateType__ELocateType_Random = 0,
	ELocateType__ELocateType_Strategy = 1,
	ELocateType__ELocateType_Escape = 2,
	ELocateType__ELocateType_MAX   = 3
};


// Enum AI.EAIVHMoveType
enum class EAIVHMoveType : uint8_t
{
	EAIVHMoveType__ELocateType_Normal = 0,
	EAIVHMoveType__ELocateType_Strategy = 1,
	EAIVHMoveType__ELocateType_Directly = 2,
	EAIVHMoveType__ELocateType_Toward = 3,
	EAIVHMoveType__ELocateType_MAX = 4
};


// Enum AI.EAITaskNodeThrowGrenadeMethod
enum class EAITaskNodeThrowGrenadeMethod : uint8_t
{
	EAITaskNodeThrowGrenadeMethod__ThrowGrenadeMethod_Normal = 0,
	EAITaskNodeThrowGrenadeMethod__ThrowGrenadeMethod_Advanced = 1,
	EAITaskNodeThrowGrenadeMethod__ThrowGrenadeMethod_MAX = 2
};


// Enum AI.ECustomDamageEventReactionType
enum class ECustomDamageEventReactionType : uint8_t
{
	ECustomDamageEventReactionType__SpawnActor = 0,
	ECustomDamageEventReactionType__ActiveParticles = 1,
	ECustomDamageEventReactionType__DetactiveParticles = 2,
	ECustomDamageEventReactionType__HideMesh = 3,
	ECustomDamageEventReactionType__HideMeshInstance = 4,
	ECustomDamageEventReactionType__HideBone = 5,
	ECustomDamageEventReactionType__ApplyPhysicalAnimationProfile = 6,
	ECustomDamageEventReactionType__SetCollisionEnabled = 7,
	ECustomDamageEventReactionType__ECustomDamageEventReactionType_MAX = 8
};


// Enum AI.ECustomDamageEventTriggerType
enum class ECustomDamageEventTriggerType : uint8_t
{
	ECustomDamageEventTriggerType__OnPassedDamageThreshold = 0,
	ECustomDamageEventTriggerType__OnAnyDamage = 1,
	ECustomDamageEventTriggerType__ECustomDamageEventTriggerType_MAX = 2
};


// Enum AI.EAIProviderType
enum class EAIProviderType : uint8_t
{
	Type_None                      = 0,
	Type_TEG                       = 1,
	Type_CCS                       = 2,
	Type_MAX                       = 3
};


// Enum AI.EMLBotType
enum class EMLBotType : uint8_t
{
	BT                             = 0,
	MLAI                           = 1,
	MLDelivery                     = 2,
	MLTeammate                     = 3,
	MLHumanoid                     = 4,
	EMLBotType_MAX                 = 5
};


// Enum AI.EMLAIJumpingPhase
enum class EMLAIJumpingPhase : uint8_t
{
	EMLAIJumpingPhase__Before      = 0,
	EMLAIJumpingPhase__FreeFalling = 1,
	EMLAIJumpingPhase__OpenParachute = 2,
	EMLAIJumpingPhase__Landing     = 3,
	EMLAIJumpingPhase__EMLAIJumpingPhase_MAX = 4
};


// Enum AI.EStatePlayerType
enum class EStatePlayerType : uint8_t
{
	EStatePlayerType__None         = 0,
	EStatePlayerType__MLAI_Normal  = 1,
	EStatePlayerType__MLAI_Deliver = 2,
	EStatePlayerType__BTAI         = 3,
	EStatePlayerType__Player       = 4,
	EStatePlayerType__MLAI_Teammate = 5,
	EStatePlayerType__CandidateBTAI = 6,
	EStatePlayerType__CandidateMLAI = 7,
	EStatePlayerType__Player_Teammate = 8,
	EStatePlayerType__MLAI_Humanoid = 9,
	EStatePlayerType__MLAI_Mercenary = 10,
	EStatePlayerType__EStatePlayerType_MAX = 11
};


// Enum AI.ENearItemType
enum class ENearItemType : uint8_t
{
	ENearItemType__Box             = 0,
	ENearItemType__Item            = 1,
	ENearItemType__AirDropBox      = 2,
	ENearItemType__TreasureChest   = 3,
	ENearItemType__Weed            = 4,
	ENearItemType__ENearItemType_MAX = 5
};


// Enum AI.EDiffListIDTag
enum class EDiffListIDTag : uint8_t
{
	EDiffListIDTag__NoDiff         = 0,
	EDiffListIDTag__General        = 1,
	EDiffListIDTag__GeneralDiff    = 2,
	EDiffListIDTag__CCSMLAI        = 3,
	EDiffListIDTag__CCSMLAIDiff    = 4,
	EDiffListIDTag__CCSInPool      = 5,
	EDiffListIDTag__CCSInPoolDiff  = 6,
	EDiffListIDTag__CCSNearbyPlayer = 7,
	EDiffListIDTag__CCSNearbyPlayerDiff = 8,
	EDiffListIDTag__CCSBTAI        = 9,
	EDiffListIDTag__CCSBTAIDiff    = 10,
	EDiffListIDTag__CCSPlayer      = 11,
	EDiffListIDTag__CCSPlayerDiff  = 12,
	EDiffListIDTag__EDiffListIDTag_MAX = 13
};


// Enum AI.ESpecialZoneType
enum class ESpecialZoneType : uint8_t
{
	ESpecialZoneType__Normal       = 0,
	ESpecialZoneType__Character    = 1,
	ESpecialZoneType__DamageableActor = 2,
	ESpecialZoneType__Vehicle      = 3,
	ESpecialZoneType__ESpecialZoneType_MAX = 4
};



//---------------------By BangJO---------------------------
//Script Structs
//---------------------By BangJO---------------------------

// ScriptStruct AI.TLogAIShootInfo
// 0x000C
struct FTLogAIShootInfo
{
	int                                                TargetDistance;                                           // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TargetType;                                               // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                WeaponId;                                                 // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.ChildDynamicItem
// 0x0020
struct FChildDynamicItem
{
	int                                                Category;                                                 // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     ChildName;                                                // 0x0008(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
};

// ScriptStruct AI.AIStateInfoBase
// 0x0018
struct FAIStateInfoBase
{
	uint64_t                                           UnChanged;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FString>                             IgnoreNames;                                              // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIStateXYZ
// 0x000C
struct FAIStateXYZ
{
	float                                              X;                                                        // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Y;                                                        // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Z;                                                        // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.SoundState
// 0x0018 (0x0030 - 0x0018)
struct FSoundState : public FAIStateInfoBase
{
	int                                                Type;                                                     // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Location;                                                 // 0x001C(0x000C)
	uint32_t                                           ID;                                                       // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.CacheSoundState
// 0x0038
struct FCacheSoundState
{
	struct FSoundState                                 SoundState;                                               // 0x0000(0x0030)
	float                                              Time;                                                     // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct AI.UniqueStateInfo
// 0x0008 (0x0020 - 0x0018)
struct FUniqueStateInfo : public FAIStateInfoBase
{
	uint64_t                                           diff_mark_id;                                             // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.AIAttribute
// 0x0008 (0x0028 - 0x0020)
struct FAIAttribute : public FUniqueStateInfo
{
	uint32_t                                           ID;                                                       // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Value;                                                    // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.AIPlayerStateBaseMod
// 0x0128 (0x0140 - 0x0018)
struct FAIPlayerStateBaseMod : public FAIStateInfoBase
{
	uint32_t                                           ID;                                                       // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	uint64_t                                           unique_id;                                                // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     player_name;                                              // 0x0028(0x0010) (ZeroConstructor)
	int                                                team_id;                                                  // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                team_index;                                               // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Position;                                                 // 0x0040(0x000C)
	struct FAIStateXYZ                                 Rotation;                                                 // 0x004C(0x000C)
	struct FAIStateXYZ                                 Speed;                                                    // 0x0058(0x000C)
	float                                              HP;                                                       // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Energy;                                                   // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              dying_hp;                                                 // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              oxygen;                                                   // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                active_weapon_slot;                                       // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                weapon_status;                                            // 0x0078(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_switching;                                             // 0x007C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x007D(0x0003) MISSED OFFSET
	int                                                alive_state;                                              // 0x0080(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                kill_count;                                               // 0x0084(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                assist_count;                                             // 0x0088(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Damages;                                                  // 0x008C(0x0004) (ZeroConstructor, IsPlainOldData)
	uint64_t                                           pawn_states;                                              // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               is_left_probe;                                            // 0x0098(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_right_probe;                                           // 0x0099(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_floating;                                              // 0x009A(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1];                                       // 0x009B(0x0001) MISSED OFFSET
	int                                                using_skill_id;                                           // 0x009C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                skill_phase_index;                                        // 0x00A0(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_pose_acting;                                           // 0x00A4(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_picking;                                               // 0x00A5(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x00A6(0x0002) MISSED OFFSET
	int                                                body_state;                                               // 0x00A8(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                location_state;                                           // 0x00AC(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               has_smoke;                                                // 0x00B0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x00B1(0x0003) MISSED OFFSET
	int                                                player_type;                                              // 0x00B4(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ai_level;                                                 // 0x00B8(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET
	TArray<struct FAIAttribute>                        Attributes;                                               // 0x00C0(0x0010) (ZeroConstructor)
	bool                                               is_lost_connection;                                       // 0x00D0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x00D1(0x0003) MISSED OFFSET
	int                                                ai_kill_count;                                            // 0x00D4(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               in_delivery_pool;                                         // 0x00D8(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               has_gone;                                                 // 0x00D9(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               in_afk;                                                   // 0x00DA(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x1];                                       // 0x00DB(0x0001) MISSED OFFSET
	int                                                emote_id;                                                 // 0x00DC(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_move_has_collision;                                    // 0x00E0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x00E1(0x0003) MISSED OFFSET
	float                                              rating_score;                                             // 0x00E4(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              real_hidden_score;                                        // 0x00E8(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                zone_id;                                                  // 0x00EC(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Gender;                                                   // 0x00F0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x4];                                       // 0x00F4(0x0004) MISSED OFFSET
	struct FString                                     OpenID;                                                   // 0x00F8(0x0010) (ZeroConstructor)
	int                                                high_hp_destroy_bullet_num;                               // 0x0108(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                low_hp_destroy_bullet_num;                                // 0x010C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                fatal_damage_destroy_bullet_num;                          // 0x0110(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_weapon_near_wall;                                      // 0x0114(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x0115(0x0003) MISSED OFFSET
	struct FAIStateXYZ                                 head_position;                                            // 0x0118(0x000C)
	struct FAIStateXYZ                                 muzzle_position;                                          // 0x0124(0x000C)
	uint32_t                                           ally_master_id;                                           // 0x0130(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                first_lang_id;                                            // 0x0134(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                received_fatal_destroy_bullet_num;                        // 0x0138(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x4];                                       // 0x013C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.CameraState
// 0x0028 (0x0040 - 0x0018)
struct FCameraState : public FAIStateInfoBase
{
	struct FAIStateXYZ                                 Position;                                                 // 0x0018(0x000C)
	struct FAIStateXYZ                                 Rotation;                                                 // 0x0024(0x000C)
	struct FAIStateXYZ                                 view_position;                                            // 0x0030(0x000C)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AIWeaponStateInfo
// 0x0030 (0x0050 - 0x0020)
struct FAIWeaponStateInfo : public FUniqueStateInfo
{
	int                                                slot_id;                                                  // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Category;                                                 // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Type;                                                     // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Bullet;                                                   // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              remain_reloading;                                         // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	TArray<int>                                        attachments;                                              // 0x0038(0x0010) (ZeroConstructor)
	int                                                bullet_in_backpak;                                        // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           weapon_avatar_id;                                         // 0x004C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.AIPlayerWeapon
// 0x0010
struct FAIPlayerWeapon
{
	TArray<struct FAIWeaponStateInfo>                  player_weapon;                                            // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIBackpackItem
// 0x0010 (0x0030 - 0x0020)
struct FAIBackpackItem : public FUniqueStateInfo
{
	int                                                Category;                                                 // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           ID;                                                       // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           Count;                                                    // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AIPlayerBackpack
// 0x0010
struct FAIPlayerBackpack
{
	TArray<struct FAIBackpackItem>                     backpack_item;                                            // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIEquipmentInfo
// 0x0010 (0x0030 - 0x0020)
struct FAIEquipmentInfo : public FUniqueStateInfo
{
	int                                                Category;                                                 // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           ID;                                                       // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Durability;                                               // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AIPlayerEquipment
// 0x0010
struct FAIPlayerEquipment
{
	TArray<struct FAIEquipmentInfo>                    equipment_item;                                           // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIDamageInfo
// 0x0018 (0x0030 - 0x0018)
struct FAIDamageInfo : public FAIStateInfoBase
{
	uint32_t                                           PlayerKey;                                                // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Damage;                                                   // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                damage_type;                                              // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                damage_weapon_type;                                       // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           damage_part;                                              // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              damage_before_cal_armor;                                  // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.AIPlayerInteractInfo
// 0x0040 (0x0058 - 0x0018)
struct FAIPlayerInteractInfo : public FAIStateInfoBase
{
	TArray<struct FAIDamageInfo>                       active_damage;                                            // 0x0018(0x0010) (ZeroConstructor)
	TArray<struct FAIDamageInfo>                       passive_damage;                                           // 0x0028(0x0010) (ZeroConstructor)
	TArray<uint32_t>                                   kill_list;                                                // 0x0038(0x0010) (ZeroConstructor)
	TArray<uint32_t>                                   knock_down_list;                                          // 0x0048(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIHeardSound
// 0x0010
struct FAIHeardSound
{
	TArray<struct FSoundState>                         heard_sound;                                              // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIDamageSources
// 0x0030 (0x0048 - 0x0018)
struct FAIDamageSources : public FAIStateInfoBase
{
	TArray<struct FAIStateXYZ>                         damage_source;                                            // 0x0018(0x0010) (ZeroConstructor)
	TArray<int>                                        damage_type;                                              // 0x0028(0x0010) (ZeroConstructor)
	TArray<int>                                        damage_weapon_type;                                       // 0x0038(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.DamageSource
// 0x0018 (0x0030 - 0x0018)
struct FDamageSource : public FAIStateInfoBase
{
	struct FAIStateXYZ                                 damage_source;                                            // 0x0018(0x000C)
	int                                                damage_type;                                              // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                damage_weapon_type;                                       // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           damage_source_id;                                         // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.DiffStateInfoBase
// 0x0000 (0x0018 - 0x0018)
struct FDiffStateInfoBase : public FAIStateInfoBase
{

};

// ScriptStruct AI.ProgressBarState
// 0x0010 (0x0028 - 0x0018)
struct FProgressBarState : public FDiffStateInfoBase
{
	int                                                Type;                                                     // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              remain_time;                                              // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           targetid;                                                 // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AISimplifyStateBaseMod
// 0x0020 (0x0038 - 0x0018)
struct FAISimplifyStateBaseMod : public FAIStateInfoBase
{
	uint32_t                                           ID;                                                       // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               has_smoke;                                                // 0x001C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1B];                                      // 0x001D(0x001B) MISSED OFFSET
};

// ScriptStruct AI.AINearbyPlayerBaseMod
// 0x0038 (0x0058 - 0x0020)
struct FAINearbyPlayerBaseMod : public FUniqueStateInfo
{
	struct FAISimplifyStateBaseMod                     State;                                                    // 0x0020(0x0038)
};

// ScriptStruct AI.ItemStateData
// 0x0030 (0x0050 - 0x0020)
struct FItemStateData : public FUniqueStateInfo
{
	int                                                Type;                                                     // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Category;                                                 // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ID;                                                       // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                UID;                                                      // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Durability;                                               // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Position;                                                 // 0x0034(0x000C)
	uint32_t                                           player_id;                                                // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	uint64_t                                           unique_id;                                                // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.AINearbyThrown
// 0x0028 (0x0048 - 0x0020)
struct FAINearbyThrown : public FUniqueStateInfo
{
	int                                                Type;                                                     // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Position;                                                 // 0x0024(0x000C)
	float                                              remain_time;                                              // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              explode_time;                                             // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_own;                                                   // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_held;                                                  // 0x0039(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x003A(0x0002) MISSED OFFSET
	uint32_t                                           actorid;                                                  // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           sourceid;                                                 // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AIPlayerHitInfo
// 0x0018 (0x0030 - 0x0018)
struct FAIPlayerHitInfo : public FAIStateInfoBase
{
	int                                                fire_count;                                               // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                hit_count;                                                // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                hit_head_count;                                           // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                hit_count_filter;                                         // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                hit_head_filter;                                          // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AIBulletHoles
// 0x0020 (0x0038 - 0x0018)
struct FAIBulletHoles : public FAIStateInfoBase
{
	TArray<struct FAIStateXYZ>                         hole_pos;                                                 // 0x0018(0x0010) (ZeroConstructor)
	TArray<struct FAIStateXYZ>                         hole_source_pos;                                          // 0x0028(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIBulletHole
// 0x0020 (0x0038 - 0x0018)
struct FAIBulletHole : public FAIStateInfoBase
{
	struct FAIStateXYZ                                 hole_pos;                                                 // 0x0018(0x000C)
	struct FAIStateXYZ                                 hole_source_pos;                                          // 0x0024(0x000C)
	uint32_t                                           hole_source_id;                                           // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AIStateConfig
// 0x0008 (0x0020 - 0x0018)
struct FAIStateConfig : public FAIStateInfoBase
{
	int                                                Level;                                                    // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Style;                                                    // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.DamageRate
// 0x0008 (0x0020 - 0x0018)
struct FDamageRate : public FAIStateInfoBase
{
	float                                              HP;                                                       // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Rate;                                                     // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.DamageRateInfo
// 0x0028 (0x0040 - 0x0018)
struct FDamageRateInfo : public FAIStateInfoBase
{
	TArray<struct FDamageRate>                         damage_rate_map;                                          // 0x0018(0x0010) (ZeroConstructor)
	TArray<struct FDamageRate>                         revive_damage_rate_map;                                   // 0x0028(0x0010) (ZeroConstructor)
	float                                              near_death_damage_rate;                                   // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.ChatMsgInfo
// 0x0028 (0x0040 - 0x0018)
struct FChatMsgInfo : public FAIStateInfoBase
{
	struct FString                                     msg_content;                                              // 0x0018(0x0010) (ZeroConstructor)
	uint32_t                                           item_id;                                                  // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           msg_id;                                                   // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 hit_position;                                             // 0x0030(0x000C)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.SignMsgInfo
// 0x0018 (0x0030 - 0x0018)
struct FSignMsgInfo : public FAIStateInfoBase
{
	struct FAIStateXYZ                                 hit_pos;                                                  // 0x0018(0x000C)
	uint32_t                                           item_id;                                                  // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           msg_type;                                                 // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.MapMarkInfo
// 0x0020 (0x0038 - 0x0018)
struct FMapMarkInfo : public FAIStateInfoBase
{
	struct FAIStateXYZ                                 mapmark_loc;                                              // 0x0018(0x000C)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	TArray<struct FAIStateXYZ>                         mapmultimark_list;                                        // 0x0028(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIAvatarInfo
// 0x0008
struct FAIAvatarInfo
{
	int                                                slot_id;                                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                item_id;                                                  // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.SingleDestroyBulletProbInfo
// 0x0010 (0x0028 - 0x0018)
struct FSingleDestroyBulletProbInfo : public FAIStateInfoBase
{
	float                                              max_destroy_time_float;                                   // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                max_destroy_num;                                          // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              destroy_cd_float;                                         // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              destroy_bullet_prob;                                      // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.AIDestroyBulletProbInfo
// 0x0080 (0x00A0 - 0x0020)
struct FAIDestroyBulletProbInfo : public FUniqueStateInfo
{
	int                                                bullet_id;                                                // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              low_hp_threshold;                                         // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FSingleDestroyBulletProbInfo                low_hp_destroy_bullet_info;                               // 0x0028(0x0028)
	struct FSingleDestroyBulletProbInfo                high_hp_destroy_bullet_info;                              // 0x0050(0x0028)
	struct FSingleDestroyBulletProbInfo                fatal_Damage_destroy_bullet_info;                         // 0x0078(0x0028)
};

// ScriptStruct AI.AIStateInfoBaseMod
// 0x0448 (0x0468 - 0x0020)
struct FAIStateInfoBaseMod : public FUniqueStateInfo
{
	struct FAIPlayerStateBaseMod                       State;                                                    // 0x0020(0x0140)
	struct FCameraState                                Camera;                                                   // 0x0160(0x0040)
	struct FAIPlayerWeapon                             Weapon;                                                   // 0x01A0(0x0010)
	struct FAIPlayerBackpack                           BackPack;                                                 // 0x01B0(0x0010)
	struct FAIPlayerEquipment                          equipment;                                                // 0x01C0(0x0010)
	uint32_t                                           Key;                                                      // 0x01D0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x01D4(0x0004) MISSED OFFSET
	struct FAIPlayerInteractInfo                       player_interact_info;                                     // 0x01D8(0x0058)
	struct FAIHeardSound                               Sound;                                                    // 0x0230(0x0010)
	struct FAIDamageSources                            damage_sources;                                           // 0x0240(0x0048)
	TArray<struct FDamageSource>                       all_damage_source;                                        // 0x0288(0x0010) (ZeroConstructor)
	struct FProgressBarState                           progress_bar;                                             // 0x0298(0x0028)
	TArray<struct FAINearbyPlayerBaseMod>              nearby_player;                                            // 0x02C0(0x0010) (ZeroConstructor)
	TArray<struct FItemStateData>                      nearby_item;                                              // 0x02D0(0x0010) (ZeroConstructor)
	TArray<struct FAINearbyThrown>                     nearby_thrown;                                            // 0x02E0(0x0010) (ZeroConstructor)
	struct FAIPlayerHitInfo                            player_hit_info;                                          // 0x02F0(0x0030)
	struct FAIBulletHoles                              bullet_holes;                                             // 0x0320(0x0038)
	TArray<struct FAIBulletHole>                       all_bullet_hole;                                          // 0x0358(0x0010) (ZeroConstructor)
	uint32_t                                           ai_style;                                                 // 0x0368(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x036C(0x0004) MISSED OFFSET
	struct FAIStateConfig                              Config;                                                   // 0x0370(0x0020)
	unsigned char                                      UnknownData02[0x28];                                      // 0x0390(0x0028) MISSED OFFSET
	TArray<uint64_t>                                   nearby_item_index;                                        // 0x03B8(0x0010) (ZeroConstructor)
	TArray<uint64_t>                                   nearby_thrown_index;                                      // 0x03C8(0x0010) (ZeroConstructor)
	struct FDamageRateInfo                             damage_rate_info;                                         // 0x03D8(0x0040)
	TArray<struct FChatMsgInfo>                        chatmsg_info_list;                                        // 0x0418(0x0010) (ZeroConstructor)
	TArray<struct FSignMsgInfo>                        signmsg_info_list;                                        // 0x0428(0x0010) (ZeroConstructor)
	TArray<struct FMapMarkInfo>                        mapmark_info_list;                                        // 0x0438(0x0010) (ZeroConstructor)
	TArray<struct FAIAvatarInfo>                       avatar_info;                                              // 0x0448(0x0010) (ZeroConstructor)
	TArray<struct FAIDestroyBulletProbInfo>            destroy_bullet_prob_info;                                 // 0x0458(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.DiffUniqueStateInfo
// 0x0008 (0x0020 - 0x0018)
struct FDiffUniqueStateInfo : public FDiffStateInfoBase
{
	uint64_t                                           diff_mark_id;                                             // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.DiffAIAttributesGeneral
// 0x0020 (0x0038 - 0x0018)
struct FDiffAIAttributesGeneral : public FDiffStateInfoBase
{
	TArray<struct FAIAttribute>                        Values;                                                   // 0x0018(0x0010) (ZeroConstructor)
	TArray<uint64_t>                                   del_item_id;                                              // 0x0028(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.DiffAIPlayerStateBaseModGeneral
// 0x0140 (0x0158 - 0x0018)
struct FDiffAIPlayerStateBaseModGeneral : public FAIStateInfoBase
{
	uint32_t                                           ID;                                                       // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	uint64_t                                           unique_id;                                                // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     player_name;                                              // 0x0028(0x0010) (ZeroConstructor)
	int                                                team_id;                                                  // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                team_index;                                               // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Position;                                                 // 0x0040(0x000C)
	struct FAIStateXYZ                                 Rotation;                                                 // 0x004C(0x000C)
	struct FAIStateXYZ                                 Speed;                                                    // 0x0058(0x000C)
	float                                              HP;                                                       // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Energy;                                                   // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              dying_hp;                                                 // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              oxygen;                                                   // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                active_weapon_slot;                                       // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                weapon_status;                                            // 0x0078(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_switching;                                             // 0x007C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x007D(0x0003) MISSED OFFSET
	int                                                alive_state;                                              // 0x0080(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                kill_count;                                               // 0x0084(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                assist_count;                                             // 0x0088(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Damages;                                                  // 0x008C(0x0004) (ZeroConstructor, IsPlainOldData)
	uint64_t                                           pawn_states;                                              // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               is_left_probe;                                            // 0x0098(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_right_probe;                                           // 0x0099(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_floating;                                              // 0x009A(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1];                                       // 0x009B(0x0001) MISSED OFFSET
	int                                                using_skill_id;                                           // 0x009C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                skill_phase_index;                                        // 0x00A0(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_pose_acting;                                           // 0x00A4(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_picking;                                               // 0x00A5(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_weapon_near_wall;                                      // 0x00A6(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x00A7(0x0001) MISSED OFFSET
