#pragma once

// PUBG_VNG -64bit (4.2.0) SDK by BangJO [Z] DM @isar_hackJO To Buy Tool SDK

namespace SDK
{
//---------------------By BangJO---------------------------
//Classes
//---------------------By BangJO---------------------------

// Class AI.AESpawner
// 0x0048 (0x0660 - 0x0618)
class AAESpawner : public ASTSpawnerBase
{
public:
	struct FScriptMulticastDelegate                    OnUnitTakeDamage;                                         // 0x0618(0x0010) (ZeroConstructor, InstancedReference)
	unsigned char                                      bEnableTeamAI : 1;                                        // 0x0628(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0629(0x0007) MISSED OFFSET
	TArray<class UClass*>                              TeamAIClasses;                                            // 0x0630(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SpawnerTeamID;                                            // 0x0640(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<enum EBotCategray>                     SpeciesCategory;                                          // 0x0644(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0645(0x0003) MISSED OFFSET
	int                                                SpawnerCampItemID;                                        // 0x0648(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GroupID;                                                  // 0x064C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UActorComponent*>                     TeamAIComponents;                                         // 0x0650(0x0010) (ExportObject, ZeroConstructor)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AESpawner");
		return pStaticClass;
	}


	void SwitchTeamAI(bool bEnable);
	void OnUnitTakeDamageEvent(float Damage, const struct FDamageEvent& DamageEvent, class AActor* Victim, class AActor* Causer);
	void OnUnitSpawned(class AActor* NewUnit, const struct FSTSpawnParam& SpawnParam, class ASTSpawnerBase* Spawner);
	void OnSpawnTimingRipe(bool IsRipe);
	void OnOwnedMobDead(class ASTExtraSimpleCharacter* DeadCharacter, class AController* Killer, class AActor* DamageCauser, const struct FHitResult& KillingHitInfo, const struct FVector& KillingHitImpulseDir, class UClass* KillingHitDamageType);
	void OnOwnedFakePlayerDead(class ASTExtraBaseCharacter* DeadCharacter, class AController* Killer, class AActor* DamageCauser, const struct FHitResult& KillingHitInfo, const struct FVector& KillingHitImpulseDir, class UClass* KillingHitDamageType);
	TEnumAsByte<enum EBotCategray> GetSpeciesCategory();
	float GetSpawnerTeamID();
	float GetSpawnerGroupID();
	int GenerateParamID(int ConfigId, int BaseParamID, const struct FSTSpawnParam& SpawnParam);
	void DeactivateSpawner();
	void BPOnUnitSpawned(class APawn* AIPawn, int ConfigId, const struct FSTSpawnParam& SpawnParam);
	void ActivateSpawner();
};


// Class AI.AESpawnSubsystem
// 0x0200 (0x03D0 - 0x01D0)
class UAESpawnSubsystem : public USTSpawnSubsystem
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01D0(0x0008) MISSED OFFSET
	unsigned char                                      bPopQueAfterCustomPreCheckFailed : 1;                     // 0x01D8(0x0001)
	unsigned char                                      UnknownData01[0x7];                                       // 0x01D9(0x0007) MISSED OFFSET
	struct FMonsterParams                              CacheMobParams;                                           // 0x01E0(0x0060)
	struct FFakePlayerParams                           CacheFPParams;                                            // 0x0240(0x0014)
	struct FAIPlayerParams                             CacheAIPParams;                                           // 0x0254(0x000C)
	struct FVehicleParams                              CacheVehicleParams;                                       // 0x0260(0x0014)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0274(0x0004) MISSED OFFSET
	struct FDecoratorParams                            CacheDecoratorParams;                                     // 0x0278(0x0018)
	TMap<TEnumAsByte<enum EBotCategray>, int>          UnitsNumberThreshold;                                     // 0x0290(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData03[0xF0];                                      // 0x02E0(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AESpawnSubsystem");
		return pStaticClass;
	}


	class AActor* SpawnUnit(const struct FSTSpawnParam& SpawnParam);
	void RegisterSpawner(class ASTSpawnerBase* Spawner);
	bool PreCheck();
	void ModifyThreshold(TEnumAsByte<enum EBotCategray> Category, int Threshold);
	int GetUnitsNumByCategory(TEnumAsByte<enum EBotCategray> Category);
	int GetUnitConfigID(class AActor* Unit);
	TArray<class ASTSpawnerBase*> GetGroupedSpawners(int InGroupID);
	void EnQueue(class ASTSpawnerBase* Spawner, struct FSTSpawnParam* SpawnParam);
	void CleanQueue();
	bool CheckCategoryLimit(class ASTSpawnerBase* Spawner, int* AvailableBalance);
};


// Class AI.AIActionExecutionComponent
// 0x0038 (0x0270 - 0x0238)
class UAIActionExecutionComponent : public ULuaActorComponent
{
public:
	class AController*                                 OwnerController;                                          // 0x0238(0x0008) (ZeroConstructor, IsPlainOldData)
	class ANewFakePlayerAIController*                  MyAIController;                                           // 0x0240(0x0008) (ZeroConstructor, IsPlainOldData)
	class ASTExtraPlayerController*                    MyPlayerController;                                       // 0x0248(0x0008) (ZeroConstructor, IsPlainOldData)
	class ASTExtraBaseCharacter*                       MyPlayerPawn;                                             // 0x0250(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMLAIControllerComponent*                    MyMLAIControllerComp;                                     // 0x0258(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0260(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIActionExecutionComponent");
		return pStaticClass;
	}


	void UseItem(int ItemId, int WeaponSlot);
	void SwapAttachmentItem(int ItemId, int SourceWeaponSlot, int TargetWeaponSlot);
	void SetGrenadeLastSelectID(int WeaponId);
	void SetFocusRotation(float InPitch, float InYaw, float InRoll);
	void SetCurShootingPose();
	void RescueTarget(class ASTExtraBaseCharacter* RescueCharacter);
	void OpenFixedRateOfDoors(float fCheckRealPlayerDistance, float fOpenDoorDistance, float fOpenDoorRate);
	void OpenDoor();
	void OnPlayerRespawn(class AUAEPlayerController* PC);
	void OnFakePlayerRespawn();
	bool IsValid();
	bool IsFreeCamera();
	class APickUpWrapperActor* GetPickActorWithID(int UID);
	class ASTExtraBaseCharacter* GetOwnerBaseCharacter();
	class UBackpackComponent* GetBackpackComponent();
	void DropItem(int ItemId, int Count);
	void DoActionQuickMark(int actorUID, int ItemId, int CheckRange);
	void DoActionMoveNew(bool IsStop, bool IsRun, float DirectionX, float DirectionY, float DirectionZ, int SwimUpRate);
	void DoActionMove(bool IsRun, float DirectionX, float DirectionY, float DirectionZ);
	void DoActionFreeCamera(bool IsEnter, float InPitch, float InYaw, float InRoll);
	void DisuseItem(int ItemId, int WeaponSlot);
	void CloseDoor();
};


// Class AI.AIBasicStateInfoComponent
// 0x0000 (0x0238 - 0x0238)
class UAIBasicStateInfoComponent : public ULuaActorComponent
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIBasicStateInfoComponent");
		return pStaticClass;
	}


	void OnItemStateChanged(const struct FVector& Location);
	struct FTLogAIShootInfo GetTLogAIShootInfo();
	class APickUpWrapperActor* GetPickActorWithID(int UID);
};


// Class AI.AIBehaviorAdapter_VehicleBase
// 0x0138 (0x0390 - 0x0258)
class UAIBehaviorAdapter_VehicleBase : public UVehicleComponent
{
public:
	float                                              LoseSightRadius;                                          // 0x0258(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              QueryEnemyRange;                                          // 0x025C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              QueryEnemyAngle;                                          // 0x0260(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinTimeLockTarget;                                        // 0x0264(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxRememberEnemySeconds;                                  // 0x0268(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PreciseHatredDecreaseSpeed;                               // 0x026C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bCorrectAfterTurnOver : 1;                                // 0x0270(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0271(0x0003) MISSED OFFSET
	float                                              CorrectAfterTurnOverCD;                                   // 0x0274(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FollowSegmentTolerance;                                   // 0x0278(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x027C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 CurveThrottleInput;                                       // 0x0280(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinAngleWhenPivotSteering;                                // 0x0288(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x028C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 CurveThrottleRateWhenTurning;                             // 0x0290(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 CurveSteeringInput;                                       // 0x0298(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseBrakeWhenTurning;                                     // 0x02A0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x02A1(0x0003) MISSED OFFSET
	float                                              MinRequiredSteeringChange;                                // 0x02A4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinLengthRateAlmostReach;                                 // 0x02A8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x02AC(0x0004) MISSED OFFSET
	class UCurveFloat*                                 CurveBrakeAlmostReach;                                    // 0x02B0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SteeringThresholdUseBrake;                                // 0x02B8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpeedThresholdUseBrake;                                   // 0x02BC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bBlockTest : 1;                                           // 0x02C0(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData05[0x3];                                       // 0x02C1(0x0003) MISSED OFFSET
	float                                              BlockTestingTime;                                         // 0x02C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              BlockSpeedThresholdKMH;                                   // 0x02C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x02CC(0x0004) MISSED OFFSET
	class UClass*                                      DeadInventoryBoxTemplate;                                 // 0x02D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DropID;                                                   // 0x02D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x02DC(0x0004) MISSED OFFSET
	struct FName                                       WrapperBoxName;                                           // 0x02E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class APlayerTombBox*                              DeadTombBox;                                              // 0x02E8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDebug;                                                   // 0x02F0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x02F1(0x0003) MISSED OFFSET
	int                                                DebugLevel;                                               // 0x02F4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DebugInterval;                                            // 0x02F8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x4];                                       // 0x02FC(0x0004) MISSED OFFSET
	struct FString                                     BehaviorServiceDebugInfo;                                 // 0x0300(0x0010) (BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData10[0x50];                                      // 0x0310(0x0050) MISSED OFFSET
	class ASTExtraVehicleBase*                         OwnerVehicle;                                             // 0x0360(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bCacheMeshOnHit : 1;                                      // 0x0368(0x0001)
	unsigned char                                      UnknownData11[0x27];                                      // 0x0369(0x0027) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIBehaviorAdapter_VehicleBase");
		return pStaticClass;
	}


	void Suicide();
	void RPC_Client_SetServiceDebugInfo(const struct FString& Info);
	void OnInit();
	void OnDeath(class AController* InstigatedBy);
	void OnAICPossessed(class AController* InController);
	float LuaCalculateHitRate(float Distance, float BaseHitRate);
	bool IsAlive();
	void HandleOnVehicleUnderAttack(class AController* EventInstigator, const struct FDamageEvent& DamageEvent, class AActor* DamageCauser, float Damage, float OriginDamage);
	void HandleOnVehicleHealthStateChanged(ESTExtraVehicleHealthState InVehicleHealthState);
	void HandleOnMeshHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BroadcastServiceDebugInfo();
	void BPReceiveDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser, TEnumAsByte<enum EDamageType> DamageEventType);
};


// Class AI.AIBehaviorAdapter_Tank
// 0x00F8 (0x0488 - 0x0390)
class UAIBehaviorAdapter_Tank : public UAIBehaviorAdapter_VehicleBase
{
public:
	class UCurveFloat*                                 AimDurationCurve;                                         // 0x0390(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   AimDurationDeviation;                                     // 0x0398(0x0008) (Edit, IsPlainOldData)
	float                                              ShootTurretCD;                                            // 0x03A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BulletExplosionRange;                                     // 0x03A4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AimingLockRange;                                          // 0x03A8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AimingLockRangeWhenFiring;                                // 0x03AC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   TurretAimRange;                                           // 0x03B0(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      bPredictEnemyMove : 1;                                    // 0x03B8(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x03B9(0x0003) MISSED OFFSET
	struct FVector2D                                   TurretShootRange;                                         // 0x03BC(0x0008) (Edit, IsPlainOldData)
	unsigned char                                      bAimingConstantLerp : 1;                                  // 0x03C4(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x3];                                       // 0x03C5(0x0003) MISSED OFFSET
	float                                              TurretAimingInterpConstantSpeed;                          // 0x03C8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TurretAimingInterpSpeed;                                  // 0x03CC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SimTurretAimingInterpConstantSpeed;                       // 0x03D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TurretAimingErrorTolerance;                               // 0x03D4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bAlsoCheckArcLength : 1;                                  // 0x03D8(0x0001) (Edit)
	unsigned char                                      UnknownData02[0x3];                                       // 0x03D9(0x0003) MISSED OFFSET
	float                                              ShootTargetLocationOffset;                                // 0x03DC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bTraceBlockShootTargetLocation : 1;                       // 0x03E0(0x0001) (Edit)
	unsigned char                                      UnknownData03[0x3];                                       // 0x03E1(0x0003) MISSED OFFSET
	int                                                MaxTraceBlockTryTimes;                                    // 0x03E4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bResetTurretAfterDestroy : 1;                             // 0x03E8(0x0001) (Edit)
	unsigned char                                      bFailedAimingWhenTurretCollided : 1;                      // 0x03E8(0x0001) (Edit)
	unsigned char                                      UnknownData04[0x7];                                       // 0x03E9(0x0007) MISSED OFFSET
	TMap<float, float>                                 BaseHitRate;                                              // 0x03F0(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              ShootMGCD;                                                // 0x0440(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ShootMGDuration;                                          // 0x0444(0x0008) (Edit, IsPlainOldData)
	float                                              ShootMGInterval;                                          // 0x044C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ShootUpDownRange;                                         // 0x0450(0x0008) (Edit, IsPlainOldData)
	struct FVector2D                                   ShootLeftRightRange;                                      // 0x0458(0x0008) (Edit, IsPlainOldData)
	struct FVector2D                                   ShootLeftRightRangeDistance;                              // 0x0460(0x0008) (Edit, IsPlainOldData)
	struct FVector2D                                   ShootTargetSpeedRange;                                    // 0x0468(0x0008) (Edit, IsPlainOldData)
	struct FVector2D                                   ShootTargetDistanceRangeDueToSpeed;                       // 0x0470(0x0008) (Edit, IsPlainOldData)
	struct FVector2D                                   MGShootRange;                                             // 0x0478(0x0008) (Edit, IsPlainOldData)
	unsigned char                                      bShouldMissOnPurpose : 1;                                 // 0x0480(0x0001)
	unsigned char                                      bCacheUsingMG : 1;                                        // 0x0480(0x0001)
	unsigned char                                      bCacheUsingTurret : 1;                                    // 0x0480(0x0001)
	unsigned char                                      UnknownData05[0x7];                                       // 0x0481(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIBehaviorAdapter_Tank");
		return pStaticClass;
	}


	bool UpdateTurretAimingTarget(const struct FVector& TargetLocation, float DeltaSeconds, bool FailedWhenCollided);
	bool ShootTurret();
	bool ShootMachineGun();
	void OnInit();
	void OnDeath(class AController* InstigatedBy);
	bool IsTurretLockTarget(const struct FVector& TargetLocation, float LockRadius);
	bool IsAlive();
	void HandleOnVehicleHealthStateChanged(ESTExtraVehicleHealthState InVehicleHealthState);
	void BroadcastTankShootWeapon(bool IsTurret);
};


// Class AI.AIPerceptionChildPickUpComponent
// 0x0050 (0x0288 - 0x0238)
class UAIPerceptionChildPickUpComponent : public ULuaActorComponent
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0238(0x0050) UNKNOWN PROPERTY: SetProperty AI.AIPerceptionChildPickUpComponent.ChildPickUpWrapperActors

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIPerceptionChildPickUpComponent");
		return pStaticClass;
	}


	void OnPickUpWrapperHideStateChange(class APickUpWrapperActor* PickUpActor, bool bHide);
};


// Class AI.AIPerceptionDynamicItemComponent
// 0x0050 (0x0288 - 0x0238)
class UAIPerceptionDynamicItemComponent : public ULuaActorComponent
{
public:
	TArray<struct FChildDynamicItem>                   ChildArray;                                               // 0x0238(0x0010) (Edit, ZeroConstructor)
	struct FScriptDelegate                             GetDynamicItemDurabilityDelegate;                         // 0x0248(0x0016) (Edit, ZeroConstructor, InstancedReference)
	bool                                               CheckVisible;                                             // 0x0258(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0259(0x0007) MISSED OFFSET
	TArray<class UStaticMeshComponent*>                CheckVisibleMeshComponents;                               // 0x0260(0x0010) (ExportObject, ZeroConstructor)
	uint32_t                                           CustomUInt32State;                                        // 0x0270(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xC];                                       // 0x0274(0x000C) MISSED OFFSET
	bool                                               IsMovable;                                                // 0x0280(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               IsCheckVisAngle;                                          // 0x0281(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               IsFireSpreadingCalCenter;                                 // 0x0282(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x5];                                       // 0x0283(0x0005) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIPerceptionDynamicItemComponent");
		return pStaticClass;
	}


	void UpdateInAICell(bool bForceUpdate);
	uint32_t GetUniqueID(class AActor* DynamicItem);
};


// Class AI.AISoundCollectionComponent
// 0x0180 (0x03B8 - 0x0238)
class UAISoundCollectionComponent : public ULuaActorComponent
{
public:
	TMap<uint32_t, struct FCacheSoundState>            CacheStepSounds;                                          // 0x0238(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FCacheSoundState>            CacheWeaponSounds;                                        // 0x0288(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FCacheSoundState>            CacheVehicleSounds;                                       // 0x02D8(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FCacheSoundState>            CacheGrenadeSounds;                                       // 0x0328(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0378(0x0018) MISSED OFFSET
	float                                              ClearStepSoundTime;                                       // 0x0390(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ClearWeaponSoundTime;                                     // 0x0394(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ClearVehicleSoundTime;                                    // 0x0398(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ClearGrenadeSoundTime;                                    // 0x039C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                StepSoundMaxNum;                                          // 0x03A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                WeaponSoundMaxNum;                                        // 0x03A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VehicleSoundMaxNum;                                       // 0x03A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GrenadeSoundMaxNum;                                       // 0x03AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AController*                                 OwnerController;                                          // 0x03B0(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AISoundCollectionComponent");
		return pStaticClass;
	}


	void OnCollectionHearSound(ESoundType SoundType, const struct FVector& InPos, class AActor* InSourceActor);
	void OnAISoundManagerHear(class AActor* InTargetActor, ESoundType SoundType, const struct FVector& InPos, class AActor* InSourceActor);
	TArray<struct FSoundState> GetCollectSoundInfo();
};


// Class AI.AIStateInfoComponentBase
// 0x1430 (0x1668 - 0x0238)
class UAIStateInfoComponentBase : public UAIBasicStateInfoComponent
{
public:
	struct FAIStateInfoBaseMod                         CacheAIStateInfoBaseMod;                                  // 0x0238(0x0468)
	struct FAIStateInfoBaseMod                         LastAIStateInfoBaseMod;                                   // 0x06A0(0x0468)
	struct FDiffAIStateInfoBaseModGeneral              CacheDiffAIStateInfoBaseModGeneral;                       // 0x0B08(0x05D8)
	struct FDiffAIStateInfoBaseMod                     CacheDiffAIStateInfoBaseMod;                              // 0x10E0(0x0428)
	bool                                               IsTouchedPlayer;                                          // 0x1508(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x1509(0x0003) MISSED OFFSET
	uint32_t                                           FrameNo;                                                  // 0x150C(0x0004) (ZeroConstructor, IsPlainOldData)
	class ASTExtraPlayerController*                    MyPlayerController;                                       // 0x1510(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                SkipFrameConfig;                                          // 0x1518(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                SkipFrameConfigSecond;                                    // 0x151C(0x0004) (ZeroConstructor, IsPlainOldData)
	class AController*                                 OwnerController;                                          // 0x1520(0x0008) (ZeroConstructor, IsPlainOldData)
	class ANewFakePlayerAIController*                  MyAIController;                                           // 0x1528(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAIActingComponent*                          AIActingComp;                                             // 0x1530(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class APawn*                                       MyOwnerPawn;                                              // 0x1538(0x0008) (ZeroConstructor, IsPlainOldData)
	class ABattleRoyaleGameModeBase*                   MyGameMode;                                               // 0x1540(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x48];                                      // 0x1548(0x0048) MISSED OFFSET
	TArray<struct FDamageSource>                       DamageSourcesInfoNew;                                     // 0x1590(0x0010) (ZeroConstructor)
	TMap<int, class APickUpWrapperActor*>              CacheAINearbyItem;                                        // 0x15A0(0x0050) (ZeroConstructor)
	TArray<class ASTExtraBaseCharacter*>               CacheNearbyEnemies;                                       // 0x15F0(0x0010) (ZeroConstructor)
	struct FCacheNearbyItemState                       CacheNearbyItemState;                                     // 0x1600(0x0020)
	class UMLAIControllerComponent*                    MyMLAIControllerComp;                                     // 0x1620(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	uint32_t                                           CacheModeMapId;                                           // 0x1628(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xC];                                       // 0x162C(0x000C) MISSED OFFSET
	class UMLAISubSystem*                              MLAISubSystem;                                            // 0x1638(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMLAIUtilsBase*                              MLAIUtils;                                                // 0x1640(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAIStateInfoDataAsset*                       AIStateInfoDataAsset;                                     // 0x1648(0x0008) (ZeroConstructor, IsPlainOldData)
	class AAIWorldVolume*                              AIWorldVolume;                                            // 0x1650(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x10];                                      // 0x1658(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoComponentBase");
		return pStaticClass;
	}


	void QueryItemStates(int MaxBoxNum, int MaxItemNum, float AirDropBoxRangeInner, float AirDropBoxRangeOuter, float DeathBoxRange, float PickUpWrapperRange, float FindBuildingMaxRange, float FindBuildingMinRange, bool InIsUseItemSpotLoc, int MaxTreasureChestNum, float TreasureChestRange, int MaxWeedNum, float WeedRange, TArray<struct FItemStateData>* ItemStateDatas);
	void PrintCacheAINearbyItem();
	void OnPlayerRespawn(class AUAEPlayerController* PC);
	void OnFakePlayerRespawn();
	void OnAIStateRequestEnd();
	bool IsValid();
	bool IsAvailableNearbyItemType(const struct FItemDefineID& DefineID);
	bool IsAvailableBackpackItemType(const struct FItemDefineID& DefineID);
	bool HasPlayerAround();
	struct FVector GetViewForwardVector(class ACharacter* InCharacter);
	TArray<struct FSoundState> GetSoundInfo();
	struct FProgressBarState GetProgressBarState();
	struct FAIPlayerInteractInfo GetPlayerInteractInfo();
	class ASTExtraBaseCharacter* GetOwnerBaseCharacter();
	void GetObstaclesState(class ASTExtraBaseCharacter* InPawn, float Range, TArray<struct FObstacleState>* ObstaclesState);
	uint32_t GetFrameNo();
	void GetDiffAIStateInfoToCacheGeneral();
	void GetDiffAIStateInfoToCache();
	TArray<struct FDamageSource> GetDamageSourcesNew();
	struct FAIDamageSources GetDamageSources();
	struct FCameraState GetCameraState(class ASTExtraBaseCharacter* InCharacter);
	void GetAIStateInfoToCache();
	void GetAIStateInfoBaseModInternal();
	void GetAIPlayerBackpackItems(TArray<struct FAIBackpackItem>* Items);
	bool GetAINearbyThrownState(class ASTExtraBaseCharacter* InCharacter, float InRange, float InCheckAngle, int MaxNum, float InSmokeRange, TArray<struct FAINearbyThrown>* Ret);
	void GetAIDestroyBulletProbInfo(TArray<struct FAIDestroyBulletProbInfo>* AIDestroyBulletProbInfoList);
	void ClearDamageSources();
};


// Class AI.AIStateInfoComponentBRBase
// 0x08E8 (0x1F50 - 0x1668)
class UAIStateInfoComponentBRBase : public UAIStateInfoComponentBase
{
public:
	struct FAIStateInfoBRBase                          CacheAIStateInfoBRBase;                                   // 0x1668(0x0208)
	struct FAIStateInfoBRBase                          LastAIStateInfoBRBase;                                    // 0x1870(0x0208)
	struct FDiffAIStateInfoBRBaseGeneral               CacheDiffAIStateInfoBRBaseGeneral;                        // 0x1A78(0x0298)
	struct FDiffAIStateInfoBRBase                      CacheDiffAIStateInfoBRBase;                               // 0x1D10(0x0220)
	unsigned char                                      UnknownData00[0x8];                                       // 0x1F30(0x0008) MISSED OFFSET
	class UMLAIUtilsBRBase*                            MLAIUtilsBR;                                              // 0x1F38(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x1F40(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoComponentBRBase");
		return pStaticClass;
	}

};


// Class AI.AIStateInfoComponentMPBase
// 0x0220 (0x1888 - 0x1668)
class UAIStateInfoComponentMPBase : public UAIStateInfoComponentBase
{
public:
	struct FAIStateInfoMPBase                          CacheAIStateInfoMPBase;                                   // 0x1668(0x00B0)
	struct FAIStateInfoMPBase                          LastAIStateInfoMPBase;                                    // 0x1718(0x00B0)
	struct FDiffAIStateInfoMPBaseGeneral               CacheDiffAIStateInfoMPBaseGeneral;                        // 0x17C8(0x00C0)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoComponentMPBase");
		return pStaticClass;
	}

};


// Class AI.AIStateInfoComponentTeamDeath
// 0x00F0 (0x1978 - 0x1888)
class UAIStateInfoComponentTeamDeath : public UAIStateInfoComponentMPBase
{
public:
	struct FAIStateInfoTeamDeath                       CacheAIStateInfoTeamDeath;                                // 0x1888(0x0050)
	struct FAIStateInfoTeamDeath                       LastAIStateInfoTeamDeath;                                 // 0x18D8(0x0050)
	struct FDiffAIStateInfoTeamDeathGeneral            CacheDiffAIStateInfoTeamDeathGeneral;                     // 0x1928(0x0050)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoComponentTeamDeath");
		return pStaticClass;
	}

};


// Class AI.AIStateInfoDataAsset
// 0x0230 (0x0260 - 0x0030)
class UAIStateInfoDataAsset : public UDataAsset
{
public:
	TMap<int, int>                                     ProgressSkillConfig;                                      // 0x0030(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<int>                                        AvailableBackpackItemTypes;                               // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<int, bool>                                    AvailableNearbyItemTypes;                                 // 0x0090(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<int, int>                                     GrenadeTypeConfig;                                        // 0x00E0(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<int, int>                                     EquipmentItemIDMappingConfig;                             // 0x0130(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              VisibleAngle;                                             // 0x0180(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     HeadOffset;                                               // 0x0184(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              NearbyEnemyRange;                                         // 0x0190(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData)
	float                                              FogWeatherRangeScale;                                     // 0x0194(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData)
	int                                                NearbyEnemyMaxNum;                                        // 0x0198(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsSearchNearItem;                                         // 0x019C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x019D(0x0003) MISSED OFFSET
	int                                                NearbyItemMaxNum;                                         // 0x01A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMaxBoxNum;                                          // 0x01A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyAirDropBoxRangeInner;                               // 0x01A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyAirDropBoxRangeOuter;                               // 0x01AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyDeathBoxRange;                                      // 0x01B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyPickUpWrapperRange;                                 // 0x01B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CacheNearbyItemRangeCoefficient;                          // 0x01B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMaxTreasureChestNum;                                // 0x01BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyTreasureChestRange;                                 // 0x01C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMaxWeedNum;                                         // 0x01C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyWeedRange;                                          // 0x01C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyFindBuildingMaxRange;                               // 0x01CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyFindBuildingMinRange;                               // 0x01D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ItemStateChangedRange;                                    // 0x01D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsItemVisiable;                                           // 0x01D8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsUseItemSpotLoc;                                         // 0x01D9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x01DA(0x0002) MISSED OFFSET
	float                                              NearbyObstacleRange;                                      // 0x01DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyThrownRange;                                        // 0x01E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbySmokeRange;                                         // 0x01E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyThrownMaxNum;                                       // 0x01E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x01EC(0x0004) MISSED OFFSET
	int                                                NearbyDoorMaxNum;                                         // 0x01F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyVehicleRange;                                       // 0x01F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData)
	int                                                NearbyVehicleMaxNum;                                      // 0x01F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyBulletHoleRange;                                    // 0x01FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyBulletHoleMaxNum;                                   // 0x0200(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyDynamicItemsRange;                                  // 0x0204(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyDynamicItemsVisibleAngle;                           // 0x0208(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyDynamicItemsMaxNum;                                 // 0x020C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyMonsterRange;                                       // 0x0210(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMonsterMaxNum;                                      // 0x0214(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyDigLandScapeActorRange;                             // 0x0218(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyDigLandScapeActorMaxNum;                            // 0x021C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreTreeAIWhenNoPlayerAround;                          // 0x0220(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0221(0x0003) MISSED OFFSET
	float                                              IgnoreTreeAIRadius;                                       // 0x0224(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               UseBodyTPPCamera;                                         // 0x0228(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0229(0x0007) MISSED OFFSET
	TArray<int>                                        IgnoredMonsterIDs;                                        // 0x0230(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<EAvatarSlotType>                            AvailableAvatarSlotTypes;                                 // 0x0240(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	uint32_t                                           nCanMLAIBuildAttributeID;                                 // 0x0250(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           SpecialLuaKeyStart;                                       // 0x0254(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           SpecialVehicleLuaKeyStart;                                // 0x0258(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           SpecialMechaVehicleLuaKeyStart;                           // 0x025C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoDataAsset");
		return pStaticClass;
	}

};


// Class AI.StateInfoCollectorBase
// 0x0028 (0x0050 - 0x0028)
class UStateInfoCollectorBase : public UObject
{
public:
	uint32_t                                           CollectType;                                              // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               HaveGloabalData;                                          // 0x002C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	class UAIStateInfoDataAsset*                       AIStateInfoDataAsset;                                     // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMLAIStateInfoManager*                       MLAIStateInfoManager;                                     // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)
	class ABattleRoyaleGameMode*                       CurGameMode;                                              // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	class AAIWorldVolume*                              AIWorldVolume;                                            // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.StateInfoCollectorBase");
		return pStaticClass;
	}

};


// Class AI.BaseMLAIStateInfoCollector
// 0x02B0 (0x0300 - 0x0050)
class UBaseMLAIStateInfoCollector : public UStateInfoCollectorBase
{
public:
	TMap<uint32_t, struct FMLAIStateInfoBaseMod>       LastAllPlayerStateInfoMap;                                // 0x0050(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FMLAIStateInfoBaseMod>       CurrentAllPlayerStateInfoMap;                             // 0x00A0(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FMLAIStateInfoBaseMod>       CacheAllPlayersInfo;                                      // 0x00F0(0x0050) (ZeroConstructor)
	struct FDiffAllMLAIInfoBaseModGeneral              CacheDiffAllPlayersInfoGeneral;                           // 0x0140(0x0108)
	struct FDiffAllMLAIInfoBaseMod                     CacheAllPlayersInfoCSS;                                   // 0x0248(0x00B8)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.BaseMLAIStateInfoCollector");
		return pStaticClass;
	}

};


// Class AI.BaseStateInfoCollector
// 0x0A00 (0x0A50 - 0x0050)
class UBaseStateInfoCollector : public UStateInfoCollectorBase
{
public:
	TMap<uint32_t, struct FAIBaseStateInfo>            LastAllPlayerStateInfoMap;                                // 0x0050(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FAIBaseStateInfo>            CurrentAllPlayerStateInfoMap;                             // 0x00A0(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FAIBaseStateInfo>            CacheAllPlayersInfo;                                      // 0x00F0(0x0050) (ZeroConstructor)
	struct FDiffAllPlayerBaseInfoGeneral               CacheDiffAllPlayersInfoGeneral;                           // 0x0140(0x0120)
	struct FDiffAllPlayerBaseInfo                      CacheAllPlayersInfoCSS;                                   // 0x0260(0x0448)
	struct FGlobalGameBaseState                        CacheGlobalGameState;                                     // 0x06A8(0x0090)
	struct FGlobalGameBaseState                        LastGlobalGameState;                                      // 0x0738(0x0090)
	struct FDiffGlobalGameBaseState                    DiffGlobalGameState;                                      // 0x07C8(0x0080)
	struct FDiffGlobalGameBaseStateGeneral             DiffGlobalGameStateGeneral;                               // 0x0848(0x00B8)
	TMap<uint32_t, uint32_t>                           DiffStateInfoKeyMap;                                      // 0x0900(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0950(0x0050) UNKNOWN PROPERTY: SetProperty AI.BaseStateInfoCollector.LastSilentMLAIMap
	unsigned char                                      UnknownData01[0x50];                                      // 0x09A0(0x0050) UNKNOWN PROPERTY: SetProperty AI.BaseStateInfoCollector.CurrentSilentMLAIMap
	unsigned char                                      UnknownData02[0x60];                                      // 0x09F0(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.BaseStateInfoCollector");
		return pStaticClass;
	}


	void RemoveBackpackItemUpdatedMap(uint32_t PlayerKey, bool AllRemove);
	void OnBackpackItemListUpdated(uint32_t PlayerKey);
	void AddBackpackItemListUpdatedDelegate(class UBackpackComponent* InBackpackComp, uint32_t InPlayerKey);
};


// Class AI.BRBaseStateInfoCollector
// 0x0C80 (0x0CD0 - 0x0050)
class UBRBaseStateInfoCollector : public UStateInfoCollectorBase
{
public:
	TMap<uint32_t, struct FAIBRBaseStateInfo>          LastAllPlayerStateInfoMap;                                // 0x0050(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FAIBRBaseStateInfo>          CurrentAllPlayerStateInfoMap;                             // 0x00A0(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FAIBRBaseStateInfo>          CacheAllPlayersInfo;                                      // 0x00F0(0x0050) (ZeroConstructor)
	struct FDiffAllPlayerBRBaseInfoGeneral             CacheDiffAllPlayersInfoGeneral;                           // 0x0140(0x0108)
	struct FDiffAllPlayerBRBaseInfo                    CacheAllPlayersInfoCSS;                                   // 0x0248(0x0520)
	struct FGlobalGameBRBaseState                      CacheGlobalGameState;                                     // 0x0768(0x0108)
	struct FGlobalGameBRBaseState                      LastGlobalGameState;                                      // 0x0870(0x0108)
	struct FDiffGlobalGameBRBaseState                  DiffGlobalGameState;                                      // 0x0978(0x0180)
	struct FDiffGlobalGameBRBaseStateGeneral           DiffGlobalGameStateGeneral;                               // 0x0AF8(0x01A0)
	unsigned char                                      UnknownData00[0x30];                                      // 0x0C98(0x0030) MISSED OFFSET
	class UCircleMgrComponent*                         CircleMgr;                                                // 0x0CC8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.BRBaseStateInfoCollector");
		return pStaticClass;
	}

};


// Class AI.BTD_CheckObstacleInCustomRange
// 0x0080 (0x0108 - 0x0088)
class UBTD_CheckObstacleInCustomRange : public UBTDecorator_BlackboardBase
{
public:
	EObstacleDetectionSpace                            ObstacleDetectionType;                                    // 0x0088(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0089(0x0007) MISSED OFFSET
	struct FBlackboardKeySelector                      BBK_OriginLoc;                                            // 0x0090(0x0028) (Edit)
	unsigned char                                      bDrawDebug : 1;                                           // 0x00B8(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00B9(0x0003) MISSED OFFSET
	int                                                DrawSegments;                                             // 0x00BC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     SpaceSize;                                                // 0x00C0(0x000C) (Edit, IsPlainOldData)
	float                                              GravityScale;                                             // 0x00CC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CustomMaxHeight;                                          // 0x00D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00D4(0x0004) MISSED OFFSET
	struct FBlackboardKeySelector                      BBK_CapsuleSweepFinalLoc;                                 // 0x00D8(0x0028) (Edit)
	float                                              CapsuleScaleFactor;                                       // 0x0100(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0104(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.BTD_CheckObstacleInCustomRange");
		return pStaticClass;
	}

};


// Class AI.BTDecorator_AttrObserver
// 0x0018 (0x0078 - 0x0060)
class UBTDecorator_AttrObserver : public UBTDecorator
{
public:
	TArray<struct FAIAttrObserver>                     AttrObserverList;                                         // 0x0060(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      bEnableObserver : 1;                                      // 0x0070(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0071(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.BTDecorator_AttrObserver");
		return pStaticClass;
	}

};


