#pragma once

// PUBG_VNG -64bit (4.2.0) SDK by BangJO [Z] DM @isar_hackJO To Buy Tool SDK

namespace SDK
{
//---------------------By BangJO---------------------------
//Enums
//---------------------By BangJO---------------------------

// Enum Addons.EEndSpecialMoveReason
enum class EEndSpecialMoveReason : uint8_t
{
	EEndSpecialMoveReason__None    = 0,
	EEndSpecialMoveReason__EndSMReason_UserOp = 1,
	EEndSpecialMoveReason__EndSMReason_Interrupted = 2,
	EEndSpecialMoveReason__EndSMReason_InvalidFloor = 3,
	EEndSpecialMoveReason__EndSMReason_InvalidMoveMode = 4,
	EEndSpecialMoveReason__EndSMReason_NoDriver = 5,
	EEndSpecialMoveReason__EndSMReason_NoFuel = 6,
	EEndSpecialMoveReason__EndSMReason_NoHealth = 7,
	EEndSpecialMoveReason__EndSMReason_ClientLoseConnection = 8,
	EEndSpecialMoveReason__EndSMReason_ServerCorrection = 9,
	EEndSpecialMoveReason__EndSMReason_ForceEnd = 10,
	EEndSpecialMoveReason__EndSMReason_InWater = 11,
	EEndSpecialMoveReason__EndSMReason_SkillEnd = 12,
	EEndSpecialMoveReason__MAX     = 13
};


// Enum Addons.ESnowMoveType
enum class ESnowMoveType : uint8_t
{
	ESnowMoveType__None            = 0,
	ESnowMoveType__Idel            = 1,
	ESnowMoveType__Move            = 2,
	ESnowMoveType__Jump            = 3,
	ESnowMoveType__ESnowMoveType_MAX = 4
};


// Enum Addons.ERewindState
enum class ERewindState : uint8_t
{
	ERewindState__RewindNone       = 0,
	ERewindState__RecordData       = 1,
	ERewindState__RewindMove       = 2,
	ERewindState__RewindEnd        = 3,
	ERewindState__ERewindState_MAX = 4
};


// Enum Addons.EBioVehicleState
enum class EBioVehicleState : uint8_t
{
	EBioVehicleState__Move         = 0,
	EBioVehicleState__Sprint       = 1,
	EBioVehicleState__Stand        = 2,
	EBioVehicleState__Crouch       = 3,
	EBioVehicleState__Prone        = 4,
	EBioVehicleState__Jump         = 5,
	EBioVehicleState__Dead         = 6,
	EBioVehicleState__Variation    = 7,
	EBioVehicleState__Born         = 8,
	EBioVehicleState__Stun         = 9,
	EBioVehicleState__StunAnim     = 10,
	EBioVehicleState__Shackle      = 11,
	EBioVehicleState____MAX        = 12,
	EBioVehicleState__EBioVehicleState_MAX = 13
};


// Enum Addons.EFlowerWingMoveState
enum class EFlowerWingMoveState : uint8_t
{
	EFlowerWingMoveState__None     = 0,
	EFlowerWingMoveState__Sprint   = 1,
	EFlowerWingMoveState__Float    = 2,
	EFlowerWingMoveState__FlutterSprint = 3,
	EFlowerWingMoveState__FlutterSprintEnd = 4,
	EFlowerWingMoveState__Flash    = 5,
	EFlowerWingMoveState__Diving   = 6,
	EFlowerWingMoveState__EFlowerWingMoveState_MAX = 7
};


// Enum Addons.EGhostBalloonMoveState
enum class EGhostBalloonMoveState : uint8_t
{
	EGhostBalloonMoveState__None   = 0,
	EGhostBalloonMoveState__Rise   = 1,
	EGhostBalloonMoveState__Float  = 2,
	EGhostBalloonMoveState__Burst  = 3,
	EGhostBalloonMoveState__EGhostBalloonMoveState_MAX = 4
};


// Enum Addons.EODMGearMoveState
enum class EODMGearMoveState : uint8_t
{
	EODMGearMoveState__None        = 0,
	EODMGearMoveState__Sprint      = 1,
	EODMGearMoveState__Rise        = 2,
	EODMGearMoveState__Spin        = 3,
	EODMGearMoveState__SpinEnd     = 4,
	EODMGearMoveState__EODMGearMoveState_MAX = 5
};


// Enum Addons.EPterosaurSwoopStage
enum class EPterosaurSwoopStage : uint8_t
{
	EPterosaurSwoopStage__ESwoopStage_None = 0,
	EPterosaurSwoopStage__ESwoopStage_Ready = 1,
	EPterosaurSwoopStage__ESwoopStage_DirectionCorrect = 2,
	EPterosaurSwoopStage__ESwoopStage_SwoopMove = 3,
	EPterosaurSwoopStage__ESwoopStage_PreCatch = 4,
	EPterosaurSwoopStage__ESwoopStage_Catch = 5,
	EPterosaurSwoopStage__ESwoopStage_Finish = 6,
	EPterosaurSwoopStage__ESwoopStage_FinishNoCatch = 7,
	EPterosaurSwoopStage__ESwoopStage_FinishNoCatchWithHit = 8,
	EPterosaurSwoopStage__ESwoopStage_MAX = 9
};


// Enum Addons.EStealthMoveState
enum class EStealthMoveState : uint8_t
{
	EStealthMoveState__None        = 0,
	EStealthMoveState__GoUnderground = 1,
	EStealthMoveState__Moving      = 2,
	EStealthMoveState__MovingBlocked = 3,
	EStealthMoveState__Exposure    = 4,
	EStealthMoveState__Falling     = 5,
	EStealthMoveState__Landing     = 6,
	EStealthMoveState__GoOut       = 7,
	EStealthMoveState__EStealthMoveState_MAX = 8
};


// Enum Addons.EMountFromDirection
enum class EMountFromDirection : uint8_t
{
	EMFD_Default                   = 0,
	EMFD_Forward                   = 1,
	EMFD_Back                      = 2,
	EMFD_Left                      = 3,
	EMFD_Right                     = 4,
	EMFD_Origin                    = 5,
	EMFD_MAX                       = 6
};


// Enum Addons.EHorseTransformType
enum class EHorseTransformType : uint8_t
{
	EHorseTransformType__HTT_None  = 0,
	EHorseTransformType__HTT_Appear = 1,
	EHorseTransformType__HTT_Disappear = 2,
	EHorseTransformType__HTT_Death = 3,
	EHorseTransformType__HTT_MAX   = 4
};


// Enum Addons.EBlanketDanceState
enum class EBlanketDanceState : uint8_t
{
	EBDS_Locomotion                = 0,
	EBDS_ReadyToDance              = 1,
	EBDS_Dancing                   = 2,
	EBDS_Idle                      = 3,
	EBDS_MAX                       = 4
};


// Enum Addons.EBlankVehicleSwitchFailedReason
enum class EBlankVehicleSwitchFailedReason : uint8_t
{
	EBlankVehicleSwitchFailedReason__ESwitchTraceInvalid = 0,
	EBlankVehicleSwitchFailedReason__ESwitchInterrupted = 1,
	EBlankVehicleSwitchFailedReason__EBlankVehicleSwitchFailedReason_MAX = 2
};


// Enum Addons.EBroomChargeState
enum class EBroomChargeState : uint8_t
{
	EBroomChargeState__BroomChargeState_None = 0,
	EBroomChargeState__BroomChargeState_Charging = 1,
	EBroomChargeState__BroomChargeState_Dashing = 2,
	EBroomChargeState__BroomChargeState_Atk = 3,
	EBroomChargeState__BroomChargeState_CoolDown = 4,
	EBroomChargeState__BroomChargeState_MAX = 5
};


// Enum Addons.EFlyBioVehicleBaseMoveMode
enum class EFlyBioVehicleBaseMoveMode : uint8_t
{
	EFlyBioVehicleBaseMoveMode__EMove_TakingOff = 0,
	EFlyBioVehicleBaseMoveMode__EMove_RegularFlying = 1,
	EFlyBioVehicleBaseMoveMode__EMove_Landing = 2,
	EFlyBioVehicleBaseMoveMode__EMove_MAX = 3
};


// Enum Addons.EEndDashErrorCode
enum class EEndDashErrorCode : uint8_t
{
	EEndDashErrorCode__EndDash_None = 0,
	EEndDashErrorCode__EndDash_TimeOver = 1,
	EEndDashErrorCode__EndDash_MoveBlocked = 2,
	EEndDashErrorCode__EndDash_ForceEnd = 3,
	EEndDashErrorCode__EndDash_ServerAdjust = 4,
	EEndDashErrorCode__EndDash_MAX = 5
};


// Enum Addons.ENitrogenAccelState
enum class ENitrogenAccelState : uint8_t
{
	ENitrogenAccelState__None      = 0,
	ENitrogenAccelState__Ready     = 1,
	ENitrogenAccelState__Bounce    = 2,
	ENitrogenAccelState__SideAccel = 3,
	ENitrogenAccelState__Accel     = 4,
	ENitrogenAccelState__CoolDown  = 5,
	ENitrogenAccelState__ENitrogenAccelState_MAX = 6
};


// Enum Addons.EMechaWeaponState
enum class EMechaWeaponState : uint8_t
{
	EMWS_None                      = 0,
	EMWS_Magnet                    = 1,
	EMWS_Missile                   = 2,
	EMWS_Speed                     = 3,
	EMWS_Boxing                    = 4,
	EMWS_Missile2                  = 5,
	EMWS_MagnetToMissile           = 6,
	EMWS_MagnetToSpeed             = 7,
	EMWS_MagnetToBoxing            = 8,
	EMWS_MissileToMagnet           = 9,
	EMWS_MissileToBoxing           = 10,
	EMWS_MissileToMissile2         = 11,
	EMWS_SpeedToMagnet             = 12,
	EMWS_BoxingToMagnet            = 13,
	EMWS_BoxingToMissile           = 14,
	EMWS_BoxingToMissile2          = 15,
	EMWS_Missile2ToBoxing          = 16,
	EMWS_Missile2ToMissile         = 17,
	EMWS_MAX                       = 18
};


// Enum Addons.EMechaState
enum class EMechaState : uint8_t
{
	EMechaState__Normal            = 0,
	EMechaState__Jump              = 1,
	EMechaState__Fire              = 2,
	EMechaState__Stumble           = 3,
	EMechaState__Aim               = 4,
	EMechaState__Dance             = 5,
	EMechaState__Landing           = 6,
	EMechaState__AirGliding        = 7,
	EMechaState__Combine           = 8,
	EMechaState__Uncombine         = 9,
	EMechaState__Catch             = 10,
	EMechaState__BeCatched         = 11,
	EMechaState__Melee             = 12,
	EMechaState__LaunchState       = 13,
	EMechaState__Exploded          = 14,
	EMechaState____MAX             = 15,
	EMechaState__EMechaState_MAX   = 16
};


// Enum Addons.ESnowBallBrokenReason
enum class ESnowBallBrokenReason : uint8_t
{
	ESnowBallBrokenReason__BrokenReason_Unknown = 0,
	ESnowBallBrokenReason__BrokenReason_ImpactObstacle = 1,
	ESnowBallBrokenReason__BrokenReason_ImpactVehicle = 2,
	ESnowBallBrokenReason__BrokenReason_ImpactCharacter = 3,
	ESnowBallBrokenReason__BrokenReason_ImpactNpc = 4,
	ESnowBallBrokenReason__BrokenReason_GroundSlope = 5,
	ESnowBallBrokenReason__BrokenReason_Falling = 6,
	ESnowBallBrokenReason__BrokenReason_Swimming = 7,
	ESnowBallBrokenReason__BrokenReason_NoDriver = 8,
	ESnowBallBrokenReason__BrokenReason_PlayerBreak = 9,
	ESnowBallBrokenReason__BrokenReason_Damaged = 10,
	ESnowBallBrokenReason__BrokenReason_FreeEnoughTime = 11,
	ESnowBallBrokenReason__BrokenReason_MAX = 12
};


// Enum Addons.EStopDriftCheck
enum class EStopDriftCheck : uint8_t
{
	EStopDriftCheck__Drift_SpeedCheck = 0,
	EStopDriftCheck__Drift_RotationCheck = 1,
	EStopDriftCheck__Drift_Interrupt = 2,
	EStopDriftCheck__Drift_None    = 3,
	EStopDriftCheck__Drift_MAX     = 4
};


// Enum Addons.ETransformerState
enum class ETransformerState : uint8_t
{
	ETransformerState__Normal      = 0,
	ETransformerState__Jump        = 1,
	ETransformerState__Dance       = 2,
	ETransformerState__Landing     = 3,
	ETransformerState__Melee       = 4,
	ETransformerState__Exploded    = 5,
	ETransformerState__HitStun     = 6,
	ETransformerState__PostCast    = 7,
	ETransformerState__Execute     = 8,
	ETransformerState__BeExecuted  = 9,
	ETransformerState__Born        = 10,
	ETransformerState____MAX       = 11,
	ETransformerState__ETransformerState_MAX = 12
};


// Enum Addons.EAmphibiousBoatInflationState
enum class EAmphibiousBoatInflationState : uint8_t
{
	EAmphibiousBoatInflationState__Deflated = 0,
	EAmphibiousBoatInflationState__Deflating = 1,
	EAmphibiousBoatInflationState__Inflated = 2,
	EAmphibiousBoatInflationState__Inflating = 3,
	EAmphibiousBoatInflationState__EAmphibiousBoatInflationState_MAX = 4
};


// Enum Addons.EAnimalMoveDir
enum class EAnimalMoveDir : uint8_t
{
	EMove_Forward                  = 0,
	EMove_Left                     = 1,
	EMove_Right                    = 2,
	EMove_Backward                 = 3,
	EMove_MAX                      = 4
};


// Enum Addons.EBlendCrossFadeOption
enum class EBlendCrossFadeOption : uint8_t
{
	EBlendCrossFadeOption__EBSBlend_None = 0,
	EBlendCrossFadeOption__EBCFO_BlendSpace = 1,
	EBlendCrossFadeOption__EBlendCrossFadeOption_MAX = 2
};


// Enum Addons.EOffsetRootBoneMode
enum class EOffsetRootBoneMode : uint8_t
{
	EOffsetRootBoneMode__Accumulate = 0,
	EOffsetRootBoneMode__Interpolate = 1,
	EOffsetRootBoneMode__Simulate  = 2,
	EOffsetRootBoneMode__Release   = 3,
	EOffsetRootBoneMode__None      = 4,
	EOffsetRootBoneMode__EOffsetRootBoneMode_MAX = 5
};


// Enum Addons.EFlyBioVehicleMoveMode
enum class EFlyBioVehicleMoveMode : uint8_t
{
	EFlyBioVehicleMoveMode__EMove_TakingOff = 0,
	EFlyBioVehicleMoveMode__EMove_RegularFlying = 1,
	EFlyBioVehicleMoveMode__EMove_MAX = 2
};


// Enum Addons.EVOFlag
enum class EVOFlag : uint8_t
{
	EVOFlag__EVOFlag_None          = 0,
	EVOFlag__EVOFlag_VelocityUpdate = 1,
	EVOFlag__EVOFlag_Stop          = 2,
	EVOFlag__EVOFlag_JumpOver      = 3,
	EVOFlag__EVOFlag_FlyOver       = 4,
	EVOFlag__EVOFlag_MAX           = 5
};


// Enum Addons.EBirdCageStatus
enum class EBirdCageStatus : uint8_t
{
	EBirdCageStatus__None          = 0,
	EBirdCageStatus__Alive         = 1,
	EBirdCageStatus__Destoryed     = 2,
	EBirdCageStatus__EBirdCageStatus_MAX = 3
};


// Enum Addons.EBlankVehicleBaseMoveMode
enum class EBlankVehicleBaseMoveMode : uint8_t
{
	EBlankVehicleBaseMoveMode__EMove_LowFlying = 0,
	EBlankVehicleBaseMoveMode__EMove_HighFlying = 1,
	EBlankVehicleBaseMoveMode__EMove_RiseToHigh = 2,
	EBlankVehicleBaseMoveMode__EMove_DropToLow = 3,
	EBlankVehicleBaseMoveMode__EMove_Diving = 4,
	EBlankVehicleBaseMoveMode__EMove_MAX = 5
};


// Enum Addons.EBlanketFlyingState
enum class EBlanketFlyingState : uint8_t
{
	EBFS_LOW                       = 0,
	EBFS_LOW_TO_HIGH               = 1,
	EBFS_HIGH                      = 2,
	EBFS_HIGH_TO_LOW               = 3,
	EBFS_DIVING                    = 4,
	EBFS_MAX                       = 5
};


// Enum Addons.ECharBoardMoveLeisureStyle
enum class ECharBoardMoveLeisureStyle : uint8_t
{
	ECharBoardMoveLeisureStyle__ERandom = 0,
	ECharBoardMoveLeisureStyle__ENarrow = 1,
	ECharBoardMoveLeisureStyle__Default = 2,
	ECharBoardMoveLeisureStyle__ECharBoardMoveLeisureStyle_MAX = 3
};


// Enum Addons.ECamelPostureState
enum class ECamelPostureState : uint8_t
{
	ECS_Idle                       = 0,
	ECS_Rest                       = 1,
	ECS_Dance                      = 2,
	ECS_Moving                     = 3,
	ECS_MAX                        = 4
};


// Enum Addons.ECollectedEventDataEventId
enum class ECollectedEventDataEventId : uint8_t
{
	ECollectedEventDataEventId__GameStatus = 0,
	ECollectedEventDataEventId__StartMatching = 1,
	ECollectedEventDataEventId__PlaneCarrying = 2,
	ECollectedEventDataEventId__PuttingDownCakeFireWorks = 3,
	ECollectedEventDataEventId__RankingScore = 4,
	ECollectedEventDataEventId__TakeDropItem = 5,
	ECollectedEventDataEventId__UsingItem = 6,
	ECollectedEventDataEventId__Falling = 7,
	ECollectedEventDataEventId__Climbing = 8,
	ECollectedEventDataEventId__InFieldOfView = 9,
	ECollectedEventDataEventId__UnderEnermyAttack = 10,
	ECollectedEventDataEventId__TakingDamage = 11,
	ECollectedEventDataEventId__ReducingSignalValue = 12,
	ECollectedEventDataEventId__CircleReducing = 13,
	ECollectedEventDataEventId__CircleChange = 14,
	ECollectedEventDataEventId__Rescue = 15,
	ECollectedEventDataEventId__DrivingVehicle = 16,
	ECollectedEventDataEventId__ReloadingBullet = 17,
	ECollectedEventDataEventId__AirDrop = 18,
	ECollectedEventDataEventId__PlayerPos = 19,
	ECollectedEventDataEventId__WeaponUsage = 20,
	ECollectedEventDataEventId__ItemPackageCreate = 21,
	ECollectedEventDataEventId__ItemAttach = 22,
	ECollectedEventDataEventId__ItemDetach = 23,
	ECollectedEventDataEventId__PlayerInfo = 24,
	ECollectedEventDataEventId__MiniMapShowInfo = 25,
	ECollectedEventDataEventId__Following = 26,
	ECollectedEventDataEventId__MiniMapPinning = 27,
	ECollectedEventDataEventId__Blocking = 28,
	ECollectedEventDataEventId__Dancing = 29,
	ECollectedEventDataEventId__PickingupTombBox = 30,
	ECollectedEventDataEventId__AirAttacking = 31,
	ECollectedEventDataEventId__CurrentWeapon = 32,
	ECollectedEventDataEventId__SceneInfo = 33,
	ECollectedEventDataEventId__TeamInfo = 34,
	ECollectedEventDataEventId__EnteringLeavingTeam = 35,
	ECollectedEventDataEventId__OnOffline = 36,
	ECollectedEventDataEventId__RankList = 37,
	ECollectedEventDataEventId__TextMessage = 38,
	ECollectedEventDataEventId__PawnState = 39,
	ECollectedEventDataEventId__OpenCloseDoor = 40,
	ECollectedEventDataEventId__MicSpeakerState = 41,
	ECollectedEventDataEventId__VehicleState = 42,
	ECollectedEventDataEventId__EnumMax = 43,
	ECollectedEventDataEventId__ECollectedEventDataEventId_MAX = 44
};


// Enum Addons.EDancingState
enum class EDancingState : uint8_t
{
	DancingState_Default           = 0,
	DancingState_PrepareMove       = 1,
	DancingState_DanceMoving       = 2,
	DancingState_EndMove           = 3,
	DancingState_Dancing           = 4,
	DancingState_Battle            = 5,
	DancingState_MAX               = 6
};


// Enum Addons.EEventDataCollectionValues_MicSpeakerState_Speaker
enum class EEventDataCollectionValues_MicSpeakerState_Speaker : uint8_t
{
	EEventDataCollectionValues_MicSpeakerState_Speaker__None = 0,
	EEventDataCollectionValues_MicSpeakerState_Speaker__Lbs = 1,
	EEventDataCollectionValues_MicSpeakerState_Speaker__Team = 2,
	EEventDataCollectionValues_MicSpeakerState_Speaker__EEventDataCollectionValues_MicSpeakerState_MAX = 3
};


// Enum Addons.EEventDataCollectionValues_MicSpeakerState_Mic
enum class EEventDataCollectionValues_MicSpeakerState_Mic : uint8_t
{
	EEventDataCollectionValues_MicSpeakerState_Mic__None = 0,
	EEventDataCollectionValues_MicSpeakerState_Mic__Lbs = 1,
	EEventDataCollectionValues_MicSpeakerState_Mic__Team = 2,
	EEventDataCollectionValues_MicSpeakerState_Mic__KeyLbs = 3,
	EEventDataCollectionValues_MicSpeakerState_Mic__KeyTeam = 4,
	EEventDataCollectionValues_MicSpeakerState_Mic__EEventDataCollectionValues_MicSpeakerState_MAX = 5
};


// Enum Addons.EEventDataCollectionValues_RankList_Type
enum class EEventDataCollectionValues_RankList_Type : uint8_t
{
	EEventDataCollectionValues_RankList_Type__None = 0,
	EEventDataCollectionValues_RankList_Type__Hot = 1,
	EEventDataCollectionValues_RankList_Type__Lucky = 2,
	EEventDataCollectionValues_RankList_Type__EEventDataCollectionValues_RankList_MAX = 3
};


// Enum Addons.EFAMActiveState
enum class EFAMActiveState : uint8_t
{
	EFAMActiveState__None          = 0,
	EFAMActiveState__Magnet        = 1,
	EFAMActiveState__EFAMActiveState_MAX = 2
};


// Enum Addons.EFAMFlyModeType
enum class EFAMFlyModeType : uint8_t
{
	EFAMFlyModeType__None          = 0,
	EFAMFlyModeType__Normal        = 1,
	EFAMFlyModeType__HighSpeed     = 2,
	EFAMFlyModeType__EFAMFlyModeType_MAX = 3
};


// Enum Addons.EFlyCloudState
enum class EFlyCloudState : uint8_t
{
	CLOUD_FLY_NONE                 = 0,
	CLOUD_FLY_START                = 1,
	CLOUD_FLY_FLOAT                = 2,
	CLOUD_FLY_MAX                  = 3
};


// Enum Addons.EFrostDragonMoveMode
enum class EFrostDragonMoveMode : uint8_t
{
	EFrostDragonMoveMode__EMove_Idle = 0,
	EFrostDragonMoveMode__EMove_TakingOff = 1,
	EFrostDragonMoveMode__EMove_RegularFlying = 2,
	EFrostDragonMoveMode__EMove_Landing = 3,
	EFrostDragonMoveMode__EMove_LandingWalking = 4,
	EFrostDragonMoveMode__EMove_MAX = 5
};


// Enum Addons.EHoverSimulateState
enum class EHoverSimulateState : uint8_t
{
	EHoverSimulateState__Idle      = 0,
	EHoverSimulateState__Simple    = 1,
	EHoverSimulateState__Complex   = 2,
	EHoverSimulateState__EHoverSimulateState_MAX = 3
};


// Enum Addons.EPoleVectorModeEnum
enum class EPoleVectorModeEnum : uint8_t
{
	PV_None                        = 0,
	PV_Position                    = 1,
	PV_Bone                        = 2,
	PV_AngleOffset                 = 3,
	PV_MAX                         = 4
};


// Enum Addons.EEffectorSpaceEnum
enum class EEffectorSpaceEnum : uint8_t
{
	ES_Additive                    = 0,
	ES_World                       = 1,
	ES_Component                   = 2,
	ES_MAX                         = 3
};


// Enum Addons.ELadderMoveType
enum class ELadderMoveType : uint8_t
{
	ELadderMove_None               = 0,
	ELadderMove_Idle               = 1,
	ELadderMove_Up                 = 2,
	ELadderMove_Down               = 3,
	ELadderMove_JumpToTop          = 4,
	ELadderMove_ExitFromBottom     = 5,
	ELadderMove_EnterFromTop       = 6,
	ELadderMove_EnterFromBottom    = 7,
	ELadderMove_MAX                = 8
};


// Enum Addons.EMoveDirection
enum class EMoveDirection : uint8_t
{
	EMD_F                          = 0,
	EMD_B                          = 1,
	EMD_L                          = 2,
	EMD_R                          = 3,
	EMD_MAX                        = 4
};


// Enum Addons.EBioLocomotionType
enum class EBioLocomotionType : uint8_t
{
	EBioLocomotionType__EBLT_Walk_F = 0,
	EBioLocomotionType__EBLT_Walk_B = 1,
	EBioLocomotionType__EBLT_Walk_L = 2,
	EBioLocomotionType__EBLT_Walk_R = 3,
	EBioLocomotionType__EBLT_Run_F = 4,
	EBioLocomotionType__EBLT_Run_B = 5,
	EBioLocomotionType__EBLT_RunLF = 6,
	EBioLocomotionType__EBLT_Run_R = 7,
	EBioLocomotionType__EBLT_MAX   = 8
};


// Enum Addons.EMechaMoveCustomMode
enum class EMechaMoveCustomMode : uint8_t
{
	EMechaMoveCustomMode__EMove_None = 0,
	EMechaMoveCustomMode__EMove_Glide = 1,
	EMechaMoveCustomMode__EMove_Landing = 2,
	EMechaMoveCustomMode__EMove_MAX = 3
};


// Enum Addons.ECombineState
enum class ECombineState : uint8_t
{
	ECS_COMBINE                    = 0,
	ECS_UNCOMBINE                  = 1,
	ECS_None                       = 2
};


// Enum Addons.EMirrorFindReplaceMethod
enum class EMirrorFindReplaceMethod : uint8_t
{
	Prefix                         = 0,
	Suffix                         = 1,
	RegularExpression              = 2,
	EMirrorFindReplaceMethod_MAX   = 3
};


// Enum Addons.ECreateSkillItemType
enum class ECreateSkillItemType : uint8_t
{
	ECreateSkillItemType__WaterCheckOnly = 0,
	ECreateSkillItemType__SlopeCheck = 1,
	ECreateSkillItemType__BuildSystemCheck = 2,
	ECreateSkillItemType__AssociateActorDistance = 3,
	ECreateSkillItemType__HeightDifferenceCheck = 4,
	ECreateSkillItemType__ECreateSkillItemType_MAX = 5
};


// Enum Addons.EOceanVehicleBaseMoveMode
enum class EOceanVehicleBaseMoveMode : uint8_t
{
	EOceanVehicleBaseMoveMode__EMove_LowFlying = 0,
	EOceanVehicleBaseMoveMode__EMove_Diving = 1,
	EOceanVehicleBaseMoveMode__EMove_MAX = 2
};


// Enum Addons.EPandaIdleMode
enum class EPandaIdleMode : uint8_t
{
	EPandaIdleMode__ENPC           = 0,
	EPandaIdleMode__EDaze          = 1,
	EPandaIdleMode__EBeVehicle     = 2,
	EPandaIdleMode__EMax           = 3,
	EPandaIdleMode__EPandaIdleMode_MAX = 4
};


// Enum Addons.EPandaFootIKStyle
enum class EPandaFootIKStyle : uint8_t
{
	EPandaFootIKStyle__EDefault    = 0,
	EPandaFootIKStyle__EAdIK       = 1,
	EPandaFootIKStyle__EPandaFootIKStyle_MAX = 2
};


// Enum Addons.EMonsterLeisureStyle
enum class EMonsterLeisureStyle : uint8_t
{
	EMonsterLeisureStyle__ESmall   = 0,
	EMonsterLeisureStyle__EBig     = 1,
	EMonsterLeisureStyle__EMonsterLeisureStyle_MAX = 2
};


// Enum Addons.EVehicleEmoteInteractType
enum class EVehicleEmoteInteractType : uint8_t
{
	EVehicleEmoteInteractType__ENPC_Interact = 0,
	EVehicleEmoteInteractType__EBeControl = 1,
	EVehicleEmoteInteractType__EMax = 2,
	EVehicleEmoteInteractType__EVehicleEmoteInteractType_MAX = 3
};


// Enum Addons.EFlyGroundType
enum class EFlyGroundType : uint8_t
{
	EFGT_Default                   = 0,
	EFGT_Water                     = 1,
	EFGT_Snow                      = 2,
	EFGT_MAX                       = 3
};


// Enum Addons.EFlyHeightType
enum class EFlyHeightType : uint8_t
{
	EFHT_Ground                    = 0,
	EFHT_LowAir                    = 1,
	EFHT_HighAir                   = 2,
	EFHT_MAX                       = 3
};


// Enum Addons.ESnowBallState
enum class ESnowBallState : uint8_t
{
	ESnowBallState__SnowBall_Unknown = 0,
	ESnowBallState__SnowBall_Attached = 1,
	ESnowBallState__SnowBall_Free  = 2,
	ESnowBallState__SnowBall_Broken = 3,
	ESnowBallState__SnowBall_MAX   = 4
};


// Enum Addons.EPterosaurMoveMode
enum class EPterosaurMoveMode : uint8_t
{
	EPterosaurMoveMode__EMove_Idle = 0,
	EPterosaurMoveMode__EMove_TakingOff = 1,
	EPterosaurMoveMode__EMove_RegularFlying = 2,
	EPterosaurMoveMode__EMove_Diving = 3,
	EPterosaurMoveMode__EMove_Landing = 4,
	EPterosaurMoveMode__EMove_SwoopDown = 5,
	EPterosaurMoveMode__EMove_MAX  = 6
};


// Enum Addons.EAttachRelativeLocation
enum class EAttachRelativeLocation : uint8_t
{
	EAttachRelativeLocation__None  = 0,
	EAttachRelativeLocation__Bottom = 1,
	EAttachRelativeLocation__Middle = 2,
	EAttachRelativeLocation__Top   = 3,
	EAttachRelativeLocation__EAttachRelativeLocation_MAX = 4
};


// Enum Addons.EHitFilterType
enum class EHitFilterType : uint8_t
{
	EHitFilterType__EFilterByGun   = 0,
	EHitFilterType__EFilterByBullet = 1,
	EHitFilterType__EHitFilterType_MAX = 2
};


// Enum Addons.EBuffRequestDirectMoveType
enum class EBuffRequestDirectMoveType : uint8_t
{
	BRDMT_Dynamic                  = 0,
	BRDMT_Fix                      = 1,
	BRDMT_Causer                   = 2,
	BRDMT_MAX                      = 3
};


// Enum Addons.EBuffDotValueType
enum class EBuffDotValueType : uint8_t
{
	EBuffDotValueType__BurningDamage = 0,
	EBuffDotValueType__ShootWeaponDamage = 1,
	EBuffDotValueType__AddHealth   = 2,
	EBuffDotValueType__AddBulletNum = 3,
	EBuffDotValueType__AddArmor    = 4,
	EBuffDotValueType__AddHelmet   = 5,
	EBuffDotValueType__PoisonFogDamage = 6,
	EBuffDotValueType__AddEnergy   = 7,
	EBuffDotValueType__AddWeaponDurability = 8,
	EBuffDotValueType__DotDamage   = 9,
	EBuffDotValueType__SkillBlackboardInt = 10,
	EBuffDotValueType__SkillBlackboardFloat = 11,
	EBuffDotValueType__Drowning    = 12,
	EBuffDotValueType__AddAttr     = 13,
	EBuffDotValueType__EBuffDotValueType_MAX = 14
};


// Enum Addons.EBuffSenseTargetState
enum class EBuffSenseTargetState : uint8_t
{
	EBuffSenseTargetState__Sensing = 0,
	EBuffSenseTargetState__HasEnemy = 1,
	EBuffSenseTargetState__WaitSense = 2,
	EBuffSenseTargetState__EBuffSenseTargetState_MAX = 3
};


// Enum Addons.ELaunchDirectionType
enum class ELaunchDirectionType : uint8_t
{
	ELaunchDirectionType__UseLaunchCenter = 0,
	ELaunchDirectionType__UseSelfRotation = 1,
	ELaunchDirectionType__UseCauserRotation = 2,
	ELaunchDirectionType__FarAwayFromCauser = 3,
	ELaunchDirectionType__ELaunchDirectionType_MAX = 4
};


// Enum Addons.EBuffMofifyDurationType
enum class EBuffMofifyDurationType : uint8_t
{
	EBuffMofifyDurationType__RefCauserDistance = 0,
	EBuffMofifyDurationType__RefMonsterType = 1,
	EBuffMofifyDurationType__RefOneAndTwo = 2,
	EBuffMofifyDurationType__EBuffMofifyDurationType_MAX = 3
};


// Enum Addons.EBuffModifyPropertyType
enum class EBuffModifyPropertyType : uint8_t
{
	EBMPT_Bool                     = 0,
	EBMPT_Int                      = 1,
	EBMPT_Float                    = 2,
	EBMPT_String                   = 3,
	EBMPT_MAX                      = 4
};


// Enum Addons.ERotateCharacterType
enum class ERotateCharacterType : uint8_t
{
	ERotateCharacterType__RotateToCauser = 0,
	ERotateCharacterType__RotateAsCauser = 1,
	ERotateCharacterType__ERotateCharacterType_MAX = 2
};


// Enum Addons.EUSTCheckCastingSkillType
enum class EUSTCheckCastingSkillType : uint8_t
{
	EUSTCheckCastingSkillType__EUSTCheckCastingSkillType_Any = 0,
	EUSTCheckCastingSkillType__EUSTCheckCastingSkillType_NotAny = 1,
	EUSTCheckCastingSkillType__EUSTCheckCastingSkillType_All = 2,
	EUSTCheckCastingSkillType__EUSTCheckCastingSkillType_NotAll = 3,
	EUSTCheckCastingSkillType__EUSTCheckCastingSkillType_MAX = 4
};


// Enum Addons.EUSTCheckCastingBuffType
enum class EUSTCheckCastingBuffType : uint8_t
{
	EUSTCheckCastingBuffType__EUSTCheckCastingBuffType_Any = 0,
	EUSTCheckCastingBuffType__EUSTCheckCastingBuffType_NotAny = 1,
	EUSTCheckCastingBuffType__EUSTCheckCastingBuffType_All = 2,
	EUSTCheckCastingBuffType__EUSTCheckCastingBuffType_NotAll = 3,
	EUSTCheckCastingBuffType__EUSTCheckCastingBuffType_MAX = 4
};


// Enum Addons.EBuffHitFaceType
enum class EBuffHitFaceType : uint8_t
{
	EBuffHitFaceType__All          = 0,
	EBuffHitFaceType__Forward      = 1,
	EBuffHitFaceType__Back         = 2,
	EBuffHitFaceType__EBuffHitFaceType_MAX = 3
};


// Enum Addons.EBuffBeHitSpaceType
enum class EBuffBeHitSpaceType : uint8_t
{
	EBuffBeHitSpaceType__All       = 0,
	EBuffBeHitSpaceType__Stand     = 1,
	EBuffBeHitSpaceType__Air       = 2,
	EBuffBeHitSpaceType__EBuffBeHitSpaceType_MAX = 3
};


// Enum Addons.EBuffKeepInStateType
enum class EBuffKeepInStateType : uint8_t
{
	EBuffKeepInStateType__MinUnion = 0,
	EBuffKeepInStateType__ContainOne = 1,
	EBuffKeepInStateType__EBuffKeepInStateType_MAX = 2
};


// Enum Addons.EBuffConditionRescueType
enum class EBuffConditionRescueType : uint8_t
{
	EBuffConditionRescueType__EBCRT_RescueOther = 0,
	EBuffConditionRescueType__EBCRT_BeRescued = 1,
	EBuffConditionRescueType__EBCRT_RescueSelf = 2,
	EBuffConditionRescueType__EBCRT_MAX = 3
};


// Enum Addons.ETitanLocomotionType
enum class ETitanLocomotionType : uint8_t
{
	ETitanLocomotionType__ETLT_Walk_F = 0,
	ETitanLocomotionType__ETLT_Walk_B = 1,
	ETitanLocomotionType__ETLT_Walk_L = 2,
	ETitanLocomotionType__ETLT_Walk_R = 3,
	ETitanLocomotionType__ETLT_Run_F = 4,
	ETitanLocomotionType__ETLT_Run_B = 5,
	ETitanLocomotionType__ETLT_RunLF = 6,
	ETitanLocomotionType__ETLT_Run_R = 7,
	ETitanLocomotionType__ETLT_MAX = 8
};


// Enum Addons.ETurnType
enum class ETurnType : uint8_t
{
	ETT_WaitDelta                  = 0,
	ETT_WaitTouchEnd               = 1,
	ETT_NoTurn                     = 2,
	ETT_MAX                        = 3
};


// Enum Addons.ETransformerCurveMoveType
enum class ETransformerCurveMoveType : uint8_t
{
	ETransformerCurveMoveType__Curve_Unknown = 0,
	ETransformerCurveMoveType__Curve_Velocity_Initial = 1,
	ETransformerCurveMoveType__Curve_Velocity_LocalFrame = 2,
	ETransformerCurveMoveType__Curve_MAX = 3
};


// Enum Addons.EAccType
enum class EAccType : uint8_t
{
	EAt_Acc                        = 0,
	EAt_Dec                        = 1,
	EAt_None                       = 2,
	EAT_MAX                        = 3
};


// Enum Addons.EBioVehicleSkillStopReason
enum class EBioVehicleSkillStopReason : uint8_t
{
	StopReason_FINISH              = 0,
	StopReason_INTERRUPT           = 1,
	StopReason_MAX                 = 2
};


// Enum Addons.ETyranState
enum class ETyranState : uint8_t
{
	ETyranState__None              = 0,
	ETyranState__Normal            = 1,
	ETyranState__BreakOut          = 2,
	ETyranState__ETyranState_MAX   = 3
};


// Enum Addons.EVehicleWeaponBoardDataType
enum class EVehicleWeaponBoardDataType : uint8_t
{
	EVehicleWeaponBoardDataType__EVehicleWeaponBoardDataType_None = 0,
	EVehicleWeaponBoardDataType__EVehicleWeaponBoardDataType_MuzzlePos = 1,
	EVehicleWeaponBoardDataType__EVehicleWeaponBoardDataType_MAX = 2
};


// Enum Addons.EDelegateBindType
enum class EDelegateBindType : uint8_t
{
	EDelegateBindType__BINDTYPE_NONE = 0,
	EDelegateBindType__BINDTYPE_DYNAMIC = 1,
	EDelegateBindType__BINDTYPE_DYNAMIC_MULTICAST = 2,
	EDelegateBindType__BINDTYPE_LUAEVENT = 3,
	EDelegateBindType__BINDTYPE_MAX = 4
};


// Enum Addons.ECarryBackDirection
enum class ECarryBackDirection : uint8_t
{
	ECarryBackDirection__ECarryBackDirection_NONE = 0,
	ECarryBackDirection__ECarryBackDirection_Front = 1,
	ECarryBackDirection__ECarryBackDirection_Back = 2,
	ECarryBackDirection__ECarryBackDirection_Left = 3,
	ECarryBackDirection__ECarryBackDirection_Right = 4,
	ECarryBackDirection__ECarryBackDirection_MAX = 5
};


// Enum Addons.ECarryBackSkillActionType
enum class ECarryBackSkillActionType : uint8_t
{
	ECarryBackSkillActionType__ECBSAT_START = 0,
	ECarryBackSkillActionType__ECBSAT_CARRYBACK = 1,
	ECarryBackSkillActionType__ECBSAT_END = 2,
	ECarryBackSkillActionType__ECBSAT_FAILED = 3,
	ECarryBackSkillActionType__ECBSAT_NONE = 4,
	ECarryBackSkillActionType__ECBSAT_MAX = 5
};


// Enum Addons.ECarryToVehicleActionState
enum class ECarryToVehicleActionState : uint8_t
{
	ECarryToVehicleActionState__ECTV_PREPARE = 0,
	ECarryToVehicleActionState__ECTV_UPDATE = 1,
	ECarryToVehicleActionState__ECTV_FINISH = 2,
	ECarryToVehicleActionState__ECTV_FAILED = 3,
	ECarryToVehicleActionState__ECTV_NONE = 4,
	ECarryToVehicleActionState__ECTV_MAX = 5
};


// Enum Addons.EBSSkillActionType
enum class EBSSkillActionType : uint8_t
{
	EBSSAT_START                   = 0,
	EBSSAT_PLACE                   = 1,
	EBSSAT_END                     = 2,
	EBSSAT_CHECK                   = 3,
	EBSSAT_PLACE_RELATIVE          = 4,
	EBSSAT_NONE                    = 5,
	EBSSAT_MAX                     = 6
};


// Enum Addons.EJumpStage
enum class EJumpStage : uint8_t
{
	EJumpStage__EJumpStage_Rising  = 0,
	EJumpStage__EJumpStage_Hovering = 1,
	EJumpStage__EJumpStage_Diving  = 2,
	EJumpStage__EJumpStage_MAX     = 3
};


// Enum Addons.EPVEProjectileInitLocationType
enum class EPVEProjectileInitLocationType : uint8_t
{
	EPVEProjectileInitLocationType__UseOwnerLocation = 0,
	EPVEProjectileInitLocationType__UseTargetLocation = 1,
	EPVEProjectileInitLocationType__UseSocketLocation = 2,
	EPVEProjectileInitLocationType__UseBlackBoard = 3,
	EPVEProjectileInitLocationType__UseVehicleLoc = 4,
	EPVEProjectileInitLocationType__EPVEProjectileInitLocationType_MAX = 5
};


// Enum Addons.ELockPPType
enum class ELockPPType : uint8_t
{
	ELPPT_FPP                      = 0,
	ELPPT_TPP                      = 1,
	ELPPT_MAX                      = 2
};


// Enum Addons.ESkillModifyPropertyType
enum class ESkillModifyPropertyType : uint8_t
{
	ESMPT_Bool                     = 0,
	ESMPT_Int                      = 1,
	ESMPT_Float                    = 2,
	ESMPT_String                   = 3,
	ESMPT_MAX                      = 4
};


// Enum Addons.AnimMontageTypeAndPosture
enum class EAnimMontageTypeAndPosture : uint8_t
{
	AnimMontageTypeAndPosture__FPS_Stand = 0,
	AnimMontageTypeAndPosture__FPS_Crouch = 1,
	AnimMontageTypeAndPosture__FPS_Prone = 2,
	AnimMontageTypeAndPosture__FPS_Vehicle = 3,
	AnimMontageTypeAndPosture__FPS_Max = 4,
	AnimMontageTypeAndPosture__TPS_Stand = 5,
	AnimMontageTypeAndPosture__TPS_Crouch = 6,
	AnimMontageTypeAndPosture__TPS_Prone = 7,
	AnimMontageTypeAndPosture__TPS_Vehicle = 8,
	AnimMontageTypeAndPosture__TPS_Max = 9,
	AnimMontageTypeAndPosture__AnimMontageTypeAndPosture_MAX = 10
};


// Enum Addons.EPutDownDirection
enum class EPutDownDirection : uint8_t
{
	EPutDownDirection__EPutDownDirection_NONE = 0,
	EPutDownDirection__EPutDownDirection_Front = 1,
	EPutDownDirection__EPutDownDirection_Back = 2,
	EPutDownDirection__EPutDownDirection_MAX = 3
};


// Enum Addons.EPutDownSkillActionType
enum class EPutDownSkillActionType : uint8_t
{
	EPutDownSkillActionType__EPDSAT_START = 0,
	EPutDownSkillActionType__EPDSAT_PUTDOWN = 1,
	EPutDownSkillActionType__EPDSAT_END = 2,
	EPutDownSkillActionType__EPDSAT_FAILED = 3,
	EPutDownSkillActionType__EPDSAT_NONE = 4,
	EPutDownSkillActionType__EPDSAT_MAX = 5
};


// Enum Addons.ESkillTouchEvent
enum class ESkillTouchEvent : uint8_t
{
	ESkillTouchEvent__ESkillTouchEvent_KEY_DOWN = 0,
	ESkillTouchEvent__ESkillTouchEvent_KEY_UP = 1,
	ESkillTouchEvent__ESkillTouchEvent_KEY_MAX = 2
};


// Enum Addons.EBeamEffectDataFromType
enum class EBeamEffectDataFromType : uint8_t
{
	EBeamEffectDataFromType__FixedPoint = 0,
	EBeamEffectDataFromType__BlackBoard = 1,
	EBeamEffectDataFromType__AttachPoint = 2,
	EBeamEffectDataFromType__EBeamEffectDataFromType_MAX = 3
};


// Enum Addons.EUAESkillCheckItemType
enum class EUAESkillCheckItemType : uint8_t
{
	EUAESkillCheckItemType__EUAESkillCheckItemType_Or = 0,
	EUAESkillCheckItemType__EUAESkillCheckItemType_And = 1,
	EUAESkillCheckItemType__EUAESkillCheckItemType_MAX = 2
};


// Enum Addons.ESkillConditionIsInHouseCheckType
enum class ESkillConditionIsInHouseCheckType : uint8_t
{
	ESkillConditionIsInHouseCheckType__In = 0,
	ESkillConditionIsInHouseCheckType__NotIn = 1,
	ESkillConditionIsInHouseCheckType__ESkillConditionIsInHouseCheckType_MAX = 2
};


// Enum Addons.ESkillConditionIsInHouseCheckTarget
enum class ESkillConditionIsInHouseCheckTarget : uint8_t
{
	ESkillConditionIsInHouseCheckTarget__Self = 0,
	ESkillConditionIsInHouseCheckTarget__SelfForward = 1,
	ESkillConditionIsInHouseCheckTarget__ESkillConditionIsInHouseCheckTarget_MAX = 2
};


// Enum Addons.EAxisType
enum class EAxisType : uint8_t
{
	EAxis_X                        = 0,
	EAxis_Y                        = 1,
	EAxis_Z                        = 2,
	EAxis_MAX                      = 3
};


// Enum Addons.ESCRotatorAngleType
enum class ESCRotatorAngleType : uint8_t
{
	ESCRotatorAngleType__ESCRotatorAngleType_Character = 0,
	ESCRotatorAngleType__ESCRotatorAngleType_Controller = 1,
	ESCRotatorAngleType__ESCRotatorAngleType_Camera = 2,
	ESCRotatorAngleType__ESCRotatorAngleType_FreeCamera = 3,
	ESCRotatorAngleType__ESCRotatorAngleType_Max = 4
};


// Enum Addons.ESettingConfigType
enum class ESettingConfigType : uint8_t
{
	SCT_Int                        = 0,
	SCT_UInt                       = 1,
	SCT_Float                      = 2,
	SCT_Bool                       = 3,
	SCT_String                     = 4,
	SCT_MAX                        = 5
};


// Enum Addons.EVineRushState
enum class EVineRushState : uint8_t
{
	EVineRushState__VRS_Normal     = 0,
	EVineRushState__VRS_Search     = 1,
	EVineRushState__VRS_Wait       = 2,
	EVineRushState__VRS_Teleport   = 3,
	EVineRushState__VRS_MAX        = 4
};


// Enum Addons.EAnimHurtingTarget
enum class EAnimHurtingTarget : uint8_t
{
	EAnimHurtingTarget__PlayerCharacter = 0,
	EAnimHurtingTarget__SimpleCharacter = 1,
	EAnimHurtingTarget__AllCharacter = 2,
	EAnimHurtingTarget__EAnimHurtingTarget_MAX = 3
};


// Enum Addons.EHurtApperanceRotateType
enum class EHurtApperanceRotateType : uint8_t
{
	EHurtApperanceRotateType__ERotateToCaster = 0,
	EHurtApperanceRotateType__EHurtApperanceRotateType_MAX = 1
};


// Enum Addons.UTSkill_SoundCue_ListenType
enum class EUTSkill_SoundCue_ListenType : uint8_t
{
	UTSkill_SoundCue_ListenType__Listen_SelfOnly = 0,
	UTSkill_SoundCue_ListenType__Listen_Teammate = 1,
	UTSkill_SoundCue_ListenType__Listen_Target = 2,
	UTSkill_SoundCue_ListenType__Listen_AllTarget = 3,
	UTSkill_SoundCue_ListenType__Listen_All = 4,
	UTSkill_SoundCue_ListenType__Listen_MAX = 5
};


// Enum Addons.EVineHookPitch
enum class EVineHookPitch : uint8_t
{
	EVineHookPitch__DefaultCheck   = 0,
	EVineHookPitch__LowCheck       = 1,
	EVineHookPitch__MidCheck       = 2,
	EVineHookPitch__HighCheck      = 3,
	EVineHookPitch__EVineHookPitch_MAX = 4
};



//---------------------By BangJO---------------------------
//Script Structs
//---------------------By BangJO---------------------------

// ScriptStruct Addons.CopyPropertyData
// 0x0010
struct FCopyPropertyData
{
	TArray<class UProperty*>                           Properties;                                               // 0x0000(0x0010) (ZeroConstructor, Transient)
};

// ScriptStruct Addons.BioVehicleAnimInstanceProxy
// 0x0070 (0x05F0 - 0x0580)
struct FBioVehicleAnimInstanceProxy : public FAnimInstanceProxy
{
	class UAnimInstance*                               SourceAnimInstance;                                       // 0x0578(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<struct FName>                               SourceInstancePropertyNames;                              // 0x0580(0x0010) (ZeroConstructor, Transient)
	TArray<class UProperty*>                           SourceInstanceProperty;                                   // 0x0590(0x0010) (ZeroConstructor, Transient)
	TMap<class UAnimInstance*, struct FCopyPropertyData> DestInstancePropertyMap;                                  // 0x05A0(0x0050) (ZeroConstructor, Transient)
};

// ScriptStruct Addons.FootStepEffect
// 0x0030
struct FFootStepEffect
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty Addons.FootStepEffect.ParticleTemplate
	int                                                EnableDeviceLevel;                                        // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct Addons.MountMontagePair
// 0x0038
struct FMountMontagePair
{
	class UAnimMontage*                                CreatureMontage;                                          // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimMontage*                                RiderMontage;                                             // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveVector*                                LocationCurve;                                            // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveVector*                                RotationCurve;                                            // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PlayRate;                                                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Duration;                                                 // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StartTime;                                                // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CameraLerpStartTime;                                      // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CameraLerpDuration;                                       // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct Addons.AmphibiousBoatThrusterRollSetup
// 0x0010
struct FAmphibiousBoatThrusterRollSetup
{
	class UCurveVector*                                CurveOmega;                                               // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              OmegaAccel;                                               // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RPMScale;                                                 // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Addons.RecordBoneData
// 0x0070
struct FRecordBoneData
{
	struct FTransform                                  LastTransform;                                            // 0x0000(0x0030) (BlueprintVisible, IsPlainOldData)
	struct FTransform                                  CurrentTransform;                                         // 0x0030(0x0030) (BlueprintVisible, IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x0060(0x000C) (BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x006C(0x0004) MISSED OFFSET
};

// ScriptStruct Addons.BakedBoneData
// 0x0010
struct FBakedBoneData
{
	TArray<struct FTransform>                          Transforms;                                               // 0x0000(0x0010) (Edit, ZeroConstructor, EditConst)
};

// ScriptStruct Addons.BakedSequenceData
// 0x0018
struct FBakedSequenceData
{
	bool                                               bValid;                                                   // 0x0000(0x0001) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FBakedBoneData>                      BoneTransforms;                                           // 0x0008(0x0010) (Edit, ZeroConstructor, EditConst)
};

// ScriptStruct Addons.AvatarMaterialGameThreadInfo
// 0x0058
struct FAvatarMaterialGameThreadInfo
{
	class UMaterial*                                   BaseMaterial;                                             // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TMap<struct FName, class UTexture*>                ParamNameToTexture2DMap;                                  // 0x0008(0x0050) (ZeroConstructor, Transient)
};

// ScriptStruct Addons.WaitSetParamTexture
// 0x0050
struct FWaitSetParamTexture
{
	TMap<struct FName, class UTexture2D*>              TexMap;                                                   // 0x0000(0x0050) (ZeroConstructor, Transient)
};

// ScriptStruct Addons.AvatarMergerAsyncTempData
// 0x0120
struct FAvatarMergerAsyncTempData
{
	TArray<class USkeletalMeshComponent*>              MeshComponentToMerge;                                     // 0x0000(0x0010) (ExportObject, ZeroConstructor, Transient)
	TMap<class UMaterialInterface*, struct FAvatarMaterialGameThreadInfo> MatInterfaceToGameThreadInfoMap;                          // 0x0010(0x0050) (ZeroConstructor, Transient)
	TMap<int, struct FWaitSetParamTexture>             WaitForUpdateAndSetParamTextureMap;                       // 0x0060(0x0050) (ZeroConstructor, Transient)
	TArray<class UTexture2D*>                          CreateForAsyncThreadTextureArray;                         // 0x00B0(0x0010) (ZeroConstructor, Transient)
	TMap<class UMaterial*, class UMaterialInstanceDynamic*> CreateForAsyncThreadMaterialMap;                          // 0x00C0(0x0050) (ZeroConstructor, Transient)
	class UMaterialInstanceDynamic*                    CreateForAsyncThreadBasicMaterial;                        // 0x0110(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0118(0x0008) MISSED OFFSET
};

// ScriptStruct Addons.BeamEmitterData
// 0x000C
struct FBeamEmitterData
{
	int                                                BeamEmitterIndex;                                         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BeamEmitterSourceIndex;                                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BeamEmitterTargetIndex;                                   // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Addons.BioVehicleMovementPostPhysicsTickFunction
// 0x0008 (0x00B8 - 0x00B0)
struct FBioVehicleMovementPostPhysicsTickFunction : public FTickFunction
{
	class UBioVehicleMovementComponent*                Target;                                                   // 0x00B0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
};

// ScriptStruct Addons.BioSimulateLODThesholds
// 0x000C
struct FBioSimulateLODThesholds
{
	float                                              ScreenSize;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LODOptimizeCosAngle;                                      // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              QueryPhysicsInternal;                                     // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Addons.CharacterNetworkSerializationPackedBits
// 0x0518
struct FCharacterNetworkSerializationPackedBits
{
	unsigned char                                      UnknownData00[0x518];                                     // 0x0000(0x0518) MISSED OFFSET
};

// ScriptStruct Addons.CharacterServerMovePackedBits
// 0x0000 (0x0518 - 0x0518)
struct FCharacterServerMovePackedBits : public FCharacterNetworkSerializationPackedBits
{

};

// ScriptStruct Addons.FlyBioVehicleFlyingConfig
// 0x0030
struct FFlyBioVehicleFlyingConfig
{
	float                                              MaxUpSpeed;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxDownSpeed;                                             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxFlySpeed;                                              // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxFlyBackSpeed;                                          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxFlyLeftRightSpeed;                                     // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxFlyingHeight;                                          // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinFlyingHeight;                                          // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlyingHeightThres;                                        // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxFlyAcceleration;                                       // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlySteeringRotationSpeed;                                 // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 FlySteeringRotationSpeedCurve;                            // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Addons.FlyBioVehicleLandingConfig
// 0x0018
struct FFlyBioVehicleLandingConfig
{
	float                                              MaxAllowedFlyingSpeed;                                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxLandingTime;                                           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LandingToGroundTime;                                      // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bForceToGroundInFixedTime;                                // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	class UCurveVector*                                LandingCurve;                                             // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Addons.FlyBioVehicleUpdateDistanceToLandConfig
// 0x000C
struct FFlyBioVehicleUpdateDistanceToLandConfig
{
	float                                              Height;                                                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Interval;                                                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseSweep;                                                // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
};

// ScriptStruct Addons.BioVHAgentMove
// 0x0020
struct FBioVHAgentMove
{
	bool                                               IsFollowingTarget;                                        // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	TWeakObjectPtr<class AActor>                       FollowTarget;                                             // 0x0004(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               IsHostingMove;                                            // 0x000C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	struct FVector                                     HostingVelocity;                                          // 0x0010(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Addons.FollowTargetMoveRecord
// 0x001C
struct FFollowTargetMoveRecord
{
	float                                              TimeStamp;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x0004(0x000C) (IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0010(0x000C) (IsPlainOldData)
};

// ScriptStruct Addons.CustomVOHelper
// 0x0068
struct FCustomVOHelper
{
	bool                                               IsObstacleDetected;                                       // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               IsPrecipiceDetected;                                      // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               IsMoveBlocked;                                            // 0x0002(0x0001) (ZeroConstructor, IsPlainOldData)
	EVOFlag                                            VOFlag;                                                   // 0x0003(0x0001) (ZeroConstructor, IsPlainOldData)
	EVOFlag                                            LastVOFlag;                                               // 0x0004(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	int                                                VO_LeftOrRight;                                           // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     VO_Velocity;                                              // 0x000C(0x000C) (IsPlainOldData)
	TArray<struct FHitResult>                          VO_Obstacles;                                             // 0x0018(0x0010) (ZeroConstructor)
	float                                              VO_Duration;                                              // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     VO_CacheVelocity;                                         // 0x002C(0x000C) (IsPlainOldData)
	struct FVector                                     VO_ObstacleCenter;                                        // 0x0038(0x000C) (IsPlainOldData)
	struct FVector                                     VO_OriginLoc;                                             // 0x0044(0x000C) (IsPlainOldData)
	int                                                VO_Step;                                                  // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     Jump_Velocity;                                            // 0x0054(0x000C) (IsPlainOldData)
	float                                              CD;                                                       // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
};

// ScriptStruct Addons.RepPrecipiceInfo
// 0x0018
struct FRepPrecipiceInfo
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (IsPlainOldData)
	struct FVector                                     Direction;                                                // 0x000C(0x000C) (IsPlainOldData)
};

// ScriptStruct Addons.SuddenStopData
// 0x0010
struct FSuddenStopData
{
	int                                                SuddenStopID;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0004(0x000C) (IsPlainOldData)
};

// ScriptStruct Addons.EffectTimeline
// 0x0078
struct FEffectTimeline
{
	float                                              Time;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData01[0x28];                                      // 0x0004(0x0028) UNKNOWN PROPERTY: SoftObjectProperty Addons.EffectTimeline.AssetParticle
	unsigned char                                      Attached : 1;                                             // 0x0030(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0031(0x0007) MISSED OFFSET
	struct FName                                       SocketName;                                               // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Loc;                                                      // 0x0040(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    Rot;                                                      // 0x004C(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Scale3D;                                                  // 0x0058(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              Duration;                                                 // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x10];                                      // 0x0068(0x0010) MISSED OFFSET
};

// ScriptStruct Addons.BioVehicleStateDisable
// 0x0002
struct FBioVehicleStateDisable
{
	EBioVehicleState                                   PawnState;                                                // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int8_t                                             Disabled;                                                 // 0x0001(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct Addons.RepBirdCage
// 0x001C
struct FRepBirdCage
{
	bool                                               bIsDestroy;                                               // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsAlert;                                                 // 0x0001(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	int                                                AlertIndex;                                               // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PlayerKey;                                                // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
