#pragma once

// PUBG_VNG -64bit (4.2.0) SDK by BangJO [Z] DM @isar_hackJO To Buy Tool SDK

namespace SDK
{
//---------------------By BangJO---------------------------
//Classes
//---------------------By BangJO---------------------------

// Class BlockyLua.Blocky3DVarWidget
// 0x0068 (0x02C8 - 0x0260)
class UBlocky3DVarWidget : public UUserWidget
{
public:
	class UBlockBase*                                  LinkedSlotHost;                                           // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0268(0x0018) MISSED OFFSET
	class UBlockyGraphData*                            HostWidget;                                               // 0x0280(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsBPInit;                                                 // 0x0288(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0289(0x0007) MISSED OFFSET
	struct FString                                     X;                                                        // 0x0290(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Y;                                                        // 0x02A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Z;                                                        // 0x02B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                StartSlotIdx;                                             // 0x02C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x02C4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.Blocky3DVarWidget");
		return pStaticClass;
	}


	void SetResult();
	void InitText(float X, float Y, float Z);
	struct FString CleanNumber(const struct FString& Input);
};


// Class BlockyLua.BlockyBlockDisplayWidget
// 0x0028 (0x0288 - 0x0260)
class UBlockyBlockDisplayWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0260(0x0010) MISSED OFFSET
	class UBlockyGraphData*                            BlockyGraphData;                                          // 0x0270(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   BlockSize;                                                // 0x0278(0x0008) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               Movable;                                                  // 0x0280(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0281(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyBlockDisplayWidget");
		return pStaticClass;
	}

};


// Class BlockyLua.BlockyBlockDisplayWidget_Custom
// 0x0028 (0x02B0 - 0x0288)
class UBlockyBlockDisplayWidget_Custom : public UBlockyBlockDisplayWidget
{
public:
	class UCustomConfig*                               Config;                                                   // 0x0288(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BlockName;                                                // 0x0290(0x0010) (ZeroConstructor)
	TArray<struct FString>                             ParamName;                                                // 0x02A0(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyBlockDisplayWidget_Custom");
		return pStaticClass;
	}


	void UpdateName(const struct FString& Name);
	void Init(TEnumAsByte<enum ECustomBlockType> Type);
};


// Class BlockyLua.BlockyBlockDisplayWidget_Preset
// 0x0000 (0x0288 - 0x0288)
class UBlockyBlockDisplayWidget_Preset : public UBlockyBlockDisplayWidget
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyBlockDisplayWidget_Preset");
		return pStaticClass;
	}


	void InitPreset(class UBlockyGraphWidget* HostGraphWidget);
};


// Class BlockyLua.BlockyBlockDisplayWidget_Variable
// 0x0010 (0x0298 - 0x0288)
class UBlockyBlockDisplayWidget_Variable : public UBlockyBlockDisplayWidget
{
public:
	class UNamedVar*                                   NamedVar;                                                 // 0x0288(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               HasSettingIcon;                                           // 0x0290(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               HasCopyIcon;                                              // 0x0291(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsEditingDisplay;                                         // 0x0292(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0293(0x0005) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyBlockDisplayWidget_Variable");
		return pStaticClass;
	}


	void Init();
	struct FVector2D CalculateDrawSize();
};


// Class BlockyLua.BlockyBlockListWidget
// 0x0048 (0x02A8 - 0x0260)
class UBlockyBlockListWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0260(0x0028) MISSED OFFSET
	class UBlockyBlockWindowWidget*                    HostWindow;                                               // 0x0288(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              HorizontalMoveCheckDelta;                                 // 0x0290(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              VerticalMoveCheckDelta;                                   // 0x0294(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsOpenComment;                                            // 0x0298(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0299(0x0007) MISSED OFFSET
	class UBlockyBlockListItemObject*                  PointAtListItem;                                          // 0x02A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyBlockListWidget");
		return pStaticClass;
	}

};


// Class BlockyLua.BlockyBlockWindowWidget
// 0x0018 (0x0278 - 0x0260)
class UBlockyBlockWindowWidget : public UUserWidget
{
public:
	class UBlockyGraphData*                            GraphWidget;                                              // 0x0260(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlockyBlockListWidget*                      WidgetToPaint;                                            // 0x0268(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0270(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyBlockWindowWidget");
		return pStaticClass;
	}


	void SetWidgetVariableToShow(class UBlockyMenuItemObject_Variable* item_Variable);
	void SetWidgetCustomToShow(class UBlockyMenuItemObject_Custom* item_Custom);
	void SetWidgetCommonToShow(class UBlockyMenuItemObject* MenuItem);
	void SetWidgetBPToShow(class UUserWidget* Widget);
};


// Class BlockyLua.BlockyBooleanWidget
// 0x0028 (0x0288 - 0x0260)
class UBlockyBooleanWidget : public UUserWidget
{
public:
	class UBlockBase*                                  LinkedSlotHost;                                           // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0268(0x0018) MISSED OFFSET
	class UBlockyGraphData*                            HostWidget;                                               // 0x0280(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyBooleanWidget");
		return pStaticClass;
	}


	void SetText(const struct FString& Value);
	void SetResult(const struct FString& displayValue, const struct FString& Value);
};


// Class BlockyLua.BlockyCategoryItemWidget
// 0x0048 (0x02A8 - 0x0260)
class UBlockyCategoryItemWidget : public UUserWidget
{
public:
	int                                                Index;                                                    // 0x0260(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0264(0x0004) MISSED OFFSET
	struct FText                                       Name;                                                     // 0x0268(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               IsScrolling;                                              // 0x0280(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0xF];                                       // 0x0281(0x000F) MISSED OFFSET
	class UBlockyCategoryWidget*                       HostWidget;                                               // 0x0290(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UScrollBox*                                  SubScrollBox;                                             // 0x0298(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x02A0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyCategoryItemWidget");
		return pStaticClass;
	}


	void SetSelected(bool IsSelected);
	void OnScroll();
	void OnClick();
	void InitWithItemObject(class UBlockyCategoryItemObject* Item);
};


// Class BlockyLua.BlockyCategoryWidget
// 0x0040 (0x02A0 - 0x0260)
class UBlockyCategoryWidget : public UUserWidget
{
public:
	class UBlockyGraphData*                            GraphWidget;                                              // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      CategoryItemWidgetType;                                   // 0x0268(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FText                                       CategoryName;                                             // 0x0270(0x0018) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0288(0x0008) MISSED OFFSET
	class UScrollBox*                                  SubScrollBox;                                             // 0x0290(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              CurrentScrollOffset;                                      // 0x0298(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x029C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyCategoryWidget");
		return pStaticClass;
	}


	struct FText GetCurrentCategoryNameWithVariable();
	class UPanelWidget* GetCategoryContainer();
};


// Class BlockyLua.BlockyColorPickerWidget
// 0x0048 (0x02A8 - 0x0260)
class UBlockyColorPickerWidget : public UUserWidget
{
public:
	class UBlockBase*                                  LinkedSlotHost;                                           // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0268(0x0018) MISSED OFFSET
	class UBlockyGraphData*                            HostWidget;                                               // 0x0280(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FLinearColor>                        RecommendedColors;                                        // 0x0288(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLinearColor>                        StoredColors;                                             // 0x0298(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyColorPickerWidget");
		return pStaticClass;
	}


	void SetResult(const struct FLinearColor& Value);
	void SetColor(const struct FLinearColor& Value);
	void LoadColors();
};


// Class BlockyLua.BlockyEditor
// 0x0200 (0x0460 - 0x0260)
class UBlockyEditor : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0260(0x0008) MISSED OFFSET
	class UBlockyGraphData*                            GraphData;                                                // 0x0268(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsSlotPreset;                                             // 0x0270(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsLastPresetCategory;                                     // 0x0271(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0272(0x0006) MISSED OFFSET
	struct FString                                     LastPresetCategory;                                       // 0x0278(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UWidget*                                     MainPanel;                                                // 0x0288(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               IsCustomVarVisable;                                       // 0x0290(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0291(0x0007) MISSED OFFSET
	class UBlockyEnumWidget*                           EnumWidget;                                               // 0x0298(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockyStringWidget*                         StringWidget;                                             // 0x02A0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockyBooleanWidget*                        BooleanWidget;                                            // 0x02A8(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockyFloatWidget*                          FloatWidget;                                              // 0x02B0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlocky3DVarWidget*                          Var3DWidget;                                              // 0x02B8(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockyIntegerWidget*                        IntegerWidget;                                            // 0x02C0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockyColorPickerWidget*                    ColorWidget;                                              // 0x02C8(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockyPresetWidget*                         PresetWidget;                                             // 0x02D0(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockySelectFromSceneWidget*                SelectFromSceneWidget;                                    // 0x02D8(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<class UBlockyMenuItemObject*>               CurrentMenuItems;                                         // 0x02E0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UBlockyMenuItemObject*                       CurrentSerchMenuItem;                                     // 0x02F0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlockyBlockListItemObject*                  ListItemSerchAtPoint;                                     // 0x02F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterial*                                   AnimateMaterial;                                          // 0x0300(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           DeleteUIDockingMaterial;                                  // 0x0308(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           DeleteRangeUIDockingMaterial;                             // 0x0310(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           DeleteUIBgDockingMaterial;                                // 0x0318(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlockyMenuWidget*                           MenuWidget;                                               // 0x0320(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockyCategoryWidget*                       CategoryWidget;                                           // 0x0328(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockyBlockWindowWidget*                    BlockWindowWidget;                                        // 0x0330(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockyLogWidget*                            BlockyLogWidget;                                          // 0x0338(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              PresetTagTitleY;                                          // 0x0340(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0344(0x0004) MISSED OFFSET
	class UBlockyMenuItemWidget*                       CurrentMenuItemWidget;                                    // 0x0348(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TMap<struct FString, class UBlockyBlockListItemObject*> TypeFilterItems;                                          // 0x0350(0x0050) (ZeroConstructor)
	TMap<struct FString, class UBlockyBlockListItemObject*> TypeFilterArrayItems;                                     // 0x03A0(0x0050) (ZeroConstructor)
	TArray<class UBlockyMenuItemObject_TypeFilter*>    TypeFilterMenus;                                          // 0x03F0(0x0010) (ZeroConstructor)
	TArray<class UBlockyCategoryItemObject*>           CurrentSlotPresetCategorys;                               // 0x0400(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData04[0x50];                                      // 0x0410(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyEditor");
		return pStaticClass;
	}


	void UpdateTriggerGroups();
	void UpdateSearchPanel();
	void UpdateSearchButtonVisible(bool IsShowSearchButton);
	bool TryBackToVariableOrCustomPanel();
	void ShowPresetAnimation(class UPresetDesc* PresetDesc);
	void SetWidgetBPToShow(class UUserWidget* Widget, bool HideCategory);
	void SetMenuWidget(class UBlockyMenuWidget* Widget);
	void SetCategoryWidget(class UBlockyCategoryWidget* Widget);
	void SetBlockLogWidget(class UBlockyLogWidget* Widget);
	void SetBlockListWidget(class UBlockyBlockWindowWidget* Widget);
	void ResetAsyncWidgetHandleMap();
	void OnUpdateUndoRedoState(bool HasUndoCommands, bool HasRedoCommands);
	void OnShowTips(const struct FText& Tips);
	void OnShowPresetPanelHandler(bool IsShow);
	void LoadWidgetAsync(const struct FString& WidgetName, const struct FString& WidgetPath, const struct FScriptDelegate& Delegate);
	class UMaterialInterface* LoadMaterialInterface(const struct FString& AnimationPath);
	void IsShowExplain(bool bFlag);
	void IsCloseComment(bool bFlag);
	float GetSaveCooldownDuration();
	struct FString GetLocaleString(const struct FString& KeyString);
	class UBlockyMenuItemObject* GetCurrentMenuItem();
	void CollectListItem(bool bCollect);
	void BP_OnShowTools(TArray<EBlockyBPToolButtonType> ButtonTypes);
	void AddChildBluckyWidget(class UUserWidget* Widget);
};


// Class BlockyLua.BlockyEnumWidget
// 0x0028 (0x0288 - 0x0260)
class UBlockyEnumWidget : public UUserWidget
{
public:
	class UBlockBase*                                  LinkedSlotHost;                                           // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0268(0x0018) MISSED OFFSET
	class UBlockyGraphData*                            HostWidget;                                               // 0x0280(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyEnumWidget");
		return pStaticClass;
	}


	void SetShowDisplayItems(TMap<struct FName, struct FText> Names);
	void SetResultWithName(const struct FName& Name);
};


// Class BlockyLua.BlockyFloatWidget
// 0x0028 (0x0288 - 0x0260)
class UBlockyFloatWidget : public UUserWidget
{
public:
	class UBlockBase*                                  LinkedSlotHost;                                           // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0268(0x0018) MISSED OFFSET
	class UBlockyGraphData*                            HostWidget;                                               // 0x0280(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyFloatWidget");
		return pStaticClass;
	}


	void SetText(const struct FString& Value);
	void SetResult(const struct FString& Value);
	struct FString CleanNumber(const struct FString& Input);
};


// Class BlockyLua.BlockyGraphWidget
// 0x00A0 (0x0300 - 0x0260)
class UBlockyGraphWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0260(0x0008) MISSED OFFSET
	class UBlockyGraphData*                            BlockyGraphData;                                          // 0x0268(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UBlockyEditor*                               HostEditor;                                               // 0x0270(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FGraphSettingMap                            GraphSettingsMap;                                         // 0x0278(0x0050) (BlueprintVisible)
	TArray<int>                                        defaultTags;                                              // 0x02C8(0x0010) (BlueprintVisible, ZeroConstructor)
	bool                                               IsOnTouch;                                                // 0x02D8(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsMoveGraphOnly;                                          // 0x02D9(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x02DA(0x0006) MISSED OFFSET
	struct FScriptDelegate                             OnAsyncLoadBinCompletedHandle;                            // 0x02E0(0x0016) (Edit, BlueprintVisible, ZeroConstructor, InstancedReference)
	class UDeleteBlockUI*                              DeleteBlockUI;                                            // 0x02F0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsShowSaveTemplate;                                       // 0x02F8(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x02F9(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyGraphWidget");
		return pStaticClass;
	}


	struct FVector2D ViewPosToCanvasPos(const struct FVector2D& Postion);
	TArray<struct FText> UpdateVariableItemNames();
	void UpdateTriggerGroups();
	TArray<struct FText> UpdateCustomItemNames();
	void UpdateBlockByTag();
	void Undo();
	bool TryBackToVariableOrCustomPanel();
	void ShowTips(const struct FText& Tips);
	void ShowPresetParamPop();
	void SetViewScale(float inScale);
	void SetViewPosition(const struct FVector2D& ViewPosition);
	void SetTagsSetting(TArray<int>* newDefaultTags, struct FGraphSettingMap* newGraphSettingsMap);
	void SetShowSaveTemplateVar(bool IsShow);
	void SetMenuWidget(class UBlockyMenuWidget* Widget);
	void SetGraphCanMove(bool isCanMove);
	void SetCurrentSubGraph(const struct FString& InName);
	void SetCategoryWidget(class UBlockyCategoryWidget* Widget);
	class UTexture2D* SetCaptureScreenShot(const struct FVector2D& screenRect);
	void SetBlockLogWidget(class UBlockyLogWidget* Widget);
	void SetBlockListWidget(class UBlockyBlockWindowWidget* Widget);
	struct FString SaveGraphToJsonText();
	TArray<unsigned char> SaveGraphToBin();
	struct FString SaveGlobalVarToJsonText();
	TArray<unsigned char> SaveGlobalVarToBin();
	void SaveCustom();
	TArray<unsigned char> SaveBlockyGraphToTemplate(class UBlockyGraph* BlockyGraph);
	void Save();
	void ReturnToPreviewGraph();
	void ReturnToMainGraph();
	void ResetMenuItems();
	void ResetJsonChangedFlag();
	void ResetGraph();
	void RemoveSubGraph(const struct FString& InName);
	void RefreshFont();
	void ReEditVariable(int Index);
	void Redo();
	void QuoteCustom();
	void Quote();
	void Paste();
	void OnCloseItemList();
	void OnAsyncLoadGraphBinCompleted();
	void LoadTemplateToBlockyGraph(bool IsCreateNewGraph, bool IsLoadPresetsInGraph, TArray<unsigned char>* TemplateAst);
	void LoadGraphFromJsonText(const struct FString& JsonStr);
	void LoadGraphFromBin(TArray<unsigned char> JsonStr);
	void LoadGlobalVarFromJsonText(const struct FString& JsonStr);
	void LoadGlobalVarFromBin(TArray<unsigned char> JsonStr);
	void Load();
	bool IsViewOverlap(const struct FVector2D& Position, const struct FVector2D& Size);
	bool IsFirstGraph();
	void GM_GenerateAllBlocks(int CombinedBlocksNum, int GraphBlocksNum, bool bNeedResetGraph);
	void GM_AddBlocks(TArray<struct FString> typeNames, int X, int Y);
	struct FVector2D GetViewSize();
	float GetViewScale();
	struct FVector2D GetViewPosition();
	bool GetJsonChangedFlag();
	void GetGraphSettingByName(const struct FString& GraphName, bool* CanCopy, bool* CanReName, bool* CanDel, bool* CanSave, TArray<int>* Tags);
	void GetDeleteBlockUIRect(float InRectWidth);
	class UBlockyGraph* GetCurrentGraph();
	void FocusTo(class UBlockBase* TargetBlock);
	void FinishVariableEdit(bool bSaveVar, bool bReEdit);
	void FinishCustomEdit(bool bSave);
	void FinishBlockSetting(bool bSave);
	void Eject();
	void EditCustumBlockGraph();
	void EditCustom();
	void Disable();
	void DeleteVariableListItem(int Index);
	void DeleteSelected();
	void DeleteCustom();
	void DefineCustom();
	void Define();
	void Copy();
	void Comment();
	void CollectListItem(bool bCollect);
	void Clone();
	void ClearUndoRedoDatas();
	void ClearTextSizeCache();
	void ClearLog();
	struct FVector2D CanvasPosToViewPos(const struct FVector2D& Postion);
	void BlockyLog_Show(EBlockyLogMsgMode Mode, class UBlockBase* BlockSource, const struct FString& SlotID, const struct FString& Info);
	void AsyncLoadGraphFromBin(TArray<unsigned char> GraphBinContent, TArray<unsigned char> GlobalVarBinContent);
	void AddSubGraph(const struct FString& InName, const struct FString& InType);
	class UBlockyGraph* AddGraph(const struct FString& InName, const struct FString& InType);
	void AddGlobalComment();
};


// Class BlockyLua.BlockyGroupItemWidget
// 0x0000 (0x0260 - 0x0260)
class UBlockyGroupItemWidget : public UUserWidget
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyGroupItemWidget");
		return pStaticClass;
	}

};


// Class BlockyLua.BlockyGroupWidget
// 0x0018 (0x0278 - 0x0260)
class UBlockyGroupWidget : public UUserWidget
{
public:
	class UButton*                                     BT_AddGroupItem;                                          // 0x0260(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0268(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyGroupWidget");
		return pStaticClass;
	}


	class UPanelWidget* GetGroupContainer();
	void AddGroupItem();
};


// Class BlockyLua.BlockyIntegerWidget
// 0x0030 (0x0290 - 0x0260)
class UBlockyIntegerWidget : public UUserWidget
{
public:
	class UBlockBase*                                  LinkedSlotHost;                                           // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0268(0x0018) MISSED OFFSET
	class UBlockyGraphData*                            HostWidget;                                               // 0x0280(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               NegativeEnable;                                           // 0x0288(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0289(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyIntegerWidget");
		return pStaticClass;
	}


	void SetText(const struct FString& Value);
	void SetResult(const struct FString& Value);
	void SetNegativeEnable(bool Enable);
};


// Class BlockyLua.BlockyLogItemWidget
// 0x0048 (0x02A8 - 0x0260)
class UBlockyLogItemWidget : public UUserWidget
{
public:
	class UBlockyGraphData*                            GraphWidget;                                              // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBlockyLogWidget*                            LogWidget;                                                // 0x0268(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockBase*                                  BlockBase;                                                // 0x0270(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     BlockSlotId;                                              // 0x0278(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0288(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyLogItemWidget");
		return pStaticClass;
	}


	void SetShowWarn(const struct FString& Warn);
	void SetShowInfo(const struct FString& Info);
	void SetShowError(const struct FString& Error);
	void SetActiveWidgetIndex(int Index);
	void OnClickBtnToBlock();
	class UTextBlock* GetTextBlockWarn();
	class UTextBlock* GetTextBlockInfo();
	class UTextBlock* GetTextBlockError();
	int GetActiveWidgetIndex();
};


// Class BlockyLua.BlockyLogWidget
// 0x0030 (0x0290 - 0x0260)
class UBlockyLogWidget : public UUserWidget
{
public:
	class UBlockyGraphData*                            GraphWidget;                                              // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      LogItemWidgetType;                                        // 0x0268(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0270(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyLogWidget");
		return pStaticClass;
	}


	void ShowLog();
	void SetBtnWarnText(const struct FString& Warn);
	void SetBtnInfoText(const struct FString& Info);
	void SetBtnErrorText(const struct FString& Error);
	void OnClickWarnShow();
	void OnClickInfoShow();
	void OnClickErrorShow();
	void OnClickAllShow();
	class UPanelWidget* GetLogContainer();
	float GetItemTextWidth();
	struct FString GetBtnWarnText();
	struct FString GetBtnInfoText();
	struct FString GetBtnErrorText();
};


// Class BlockyLua.BlockyLuaLoopScrollBase
// 0x0128 (0x0C50 - 0x0B28)
class UBlockyLuaLoopScrollBase : public UScrollBox
{
public:
	bool                                               bDelayLoad;                                               // 0x0B28(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0B29(0x0003) MISSED OFFSET
	float                                              BlockyLuaEdgePadding;                                     // 0x0B2C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnRefreshItem;                                            // 0x0B30(0x0010) (BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnItemCreated;                                            // 0x0B40(0x0010) (BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnChangeData;                                             // 0x0B50(0x0010) (BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0xD0];                                      // 0x0B60(0x00D0) MISSED OFFSET
	class UClass*                                      itemType;                                                 // 0x0C30(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0C38(0x0010) MISSED OFFSET
	class UCanvasPanel*                                CanvasPanel;                                              // 0x0C48(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyLuaLoopScrollBase");
		return pStaticClass;
	}


	void UserScrolled(float Offset);
	void SetItemType(class UClass* _ItemType);
	bool SetItemCount(int Count);
	void RemoveItem(int Index);
	bool RefreshItem(int Index);
	void RefreshAllItems();
	void Push();
	void Pop();
	void OnRefreshItem__DelegateSignature(class UWidget* Item, int Index);
	void OnItemCreated__DelegateSignature(class UWidget* Item, int Index);
	void OnChangeData__DelegateSignature(class UWidget* Item, int Index, const struct FString& Key);
	void InsertItem(int Index);
	int GetWidgetIndex(class UWidget* Item);
	int GetItemCount();
	class UWidget* GetIndexOfWidget(int Index);
	bool ChangeData(int Index, const struct FString& Key);
	void CallTick(float DeltaTime);
	void AutoSize(bool bAutoSize);
};


// Class BlockyLua.BlockyLuaLoopScrollBase_MultiItem
// 0x0170 (0x0C98 - 0x0B28)
class UBlockyLuaLoopScrollBase_MultiItem : public UScrollBox
{
public:
	bool                                               bDelayLoad;                                               // 0x0B28(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0B29(0x0003) MISSED OFFSET
	float                                              BlockyLuaEdgePadding;                                     // 0x0B2C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnRefreshItem;                                            // 0x0B30(0x0010) (BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnItemCreated;                                            // 0x0B40(0x0010) (BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnChangeData;                                             // 0x0B50(0x0010) (BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x130];                                     // 0x0B60(0x0130) MISSED OFFSET
	class UCanvasPanel*                                CanvasPanel;                                              // 0x0C90(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyLuaLoopScrollBase_MultiItem");
		return pStaticClass;
	}


	void UserScrolled(float Offset);
	void SetItemType(TArray<class UClass*> TypeArray);
	bool SetItemCount(int Count);
	void RemoveItem(int Index);
	bool RefreshItem(int Index);
	void RefreshAllItems();
	void Push(class UClass* Type);
	void Pop();
	void OnRefreshItem__DelegateSignature(class UWidget* Item, int Index);
	void OnItemCreated__DelegateSignature(class UWidget* Item, int Index);
	void OnChangeData__DelegateSignature(class UWidget* Item, int Index, const struct FString& Key);
	void InsertItem(int Index, class UClass* Type);
	int GetWidgetIndex(class UWidget* Item);
	int GetItemCount();
	class UWidget* GetIndexOfWidget(int Index);
	void ClearItems();
	bool ChangeData(int Index, const struct FString& Key);
	void CallTick(float DeltaTime);
	void AutoSize(bool bAutoSize);
};


// Class BlockyLua.BlockyLuaLoopScrollBox
// 0x0010 (0x0C60 - 0x0C50)
class UBlockyLuaLoopScrollBox : public UBlockyLuaLoopScrollBase
{
public:
	float                                              ItemSize;                                                 // 0x0C50(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Padding;                                                  // 0x0C54(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAlignMagnetic;                                           // 0x0C58(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0C59(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyLuaLoopScrollBox");
		return pStaticClass;
	}


	void ScrollToItem(int Index);
};


// Class BlockyLua.BlockyLuaLoopScrollBox_MultiItem
// 0x00A8 (0x0D40 - 0x0C98)
class UBlockyLuaLoopScrollBox_MultiItem : public UBlockyLuaLoopScrollBase_MultiItem
{
public:
	TMap<class UClass*, float>                         WidgetSizeMap;                                            // 0x0C98(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<class UClass*, float>                         WidgetPaddingMap;                                         // 0x0CE8(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bAlignMagnetic;                                           // 0x0D38(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0D39(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyLuaLoopScrollBox_MultiItem");
		return pStaticClass;
	}


	void ScrollToItem(int Index);
	void BP_UserScrolled(float Offset);
	bool BP_PreventScrollOutOfSize(bool bScroll);
	float BP_GetContentSize();
};


// Class BlockyLua.BlockyLuaLoopScrollGrid
// 0x0028 (0x0C78 - 0x0C50)
class UBlockyLuaLoopScrollGrid : public UBlockyLuaLoopScrollBase
{
public:
	struct FVector2D                                   ItemSize;                                                 // 0x0C50(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector2D                                   Padding;                                                  // 0x0C58(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	bool                                               bAlignGrid;                                               // 0x0C60(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAlignAnimation;                                          // 0x0C61(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x16];                                      // 0x0C62(0x0016) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyLuaLoopScrollGrid");
		return pStaticClass;
	}


	void ScrollToItem(int Index);
};


// Class BlockyLua.BlockyMenuItemWidget
// 0x0030 (0x0290 - 0x0260)
class UBlockyMenuItemWidget : public UUserWidget
{
public:
	int                                                Index;                                                    // 0x0260(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0264(0x0004) MISSED OFFSET
	struct FText                                       Name;                                                     // 0x0268(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	class UBlockyMenuWidget*                           HostWidget;                                               // 0x0280(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockyCategoryItemWidget*                   CurrentCategoryItemWidget;                                // 0x0288(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyMenuItemWidget");
		return pStaticClass;
	}


	void SetSelected(bool IsSelected);
	void OnClick();
	void InitWithItemObject(class UBlockyMenuItemObject* Item);
};


// Class BlockyLua.BlockyMenuWidget
// 0x0020 (0x0280 - 0x0260)
class UBlockyMenuWidget : public UUserWidget
{
public:
	class UClass*                                      MenuItemWidgetType;                                       // 0x0260(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0268(0x0010) MISSED OFFSET
	class UBlockyGraphData*                            GraphWidget;                                              // 0x0278(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyMenuWidget");
		return pStaticClass;
	}


	bool SelectMenu(class UBlockyMenuItemWidget* MenuItemWidget);
	void OnAddMenuItemWidget(class UBlockyMenuItemWidget* MenuItemWidget);
	class UPanelWidget* GetMenuContainer();
};


// Class BlockyLua.BlockyPresetItemWidget
// 0x0020 (0x0280 - 0x0260)
class UBlockyPresetItemWidget : public UUserWidget
{
public:
	class UPresetDesc*                                 Desc;                                                     // 0x0260(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UBlockyPresetWidget*                         Host;                                                     // 0x0268(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBlockySearchWidget*                         SearchHost;                                               // 0x0270(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UScrollBox*                                  SubScrollBox;                                             // 0x0278(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyPresetItemWidget");
		return pStaticClass;
	}


	void SetPresetDesc_BP(class UPresetDesc* PresetDesc);
	void SetImageShowIcon(class UImage* Image);
	struct FString GetPresetDescCode();
};


// Class BlockyLua.BlockyPresetWidget
// 0x00A0 (0x0300 - 0x0260)
class UBlockyPresetWidget : public UUserWidget
{
public:
	class UBlockBase*                                  LinkedSlotHost;                                           // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0268(0x0018) MISSED OFFSET
	class UBlockyEditor*                               HostWidget;                                               // 0x0280(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UButton*                                     Button_FilterAction;                                      // 0x0288(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FString                                     SlotTypeName;                                             // 0x0290(0x0010) (ZeroConstructor)
	TMap<int, struct FIntArrayWrapper>                 CurrentTages;                                             // 0x02A0(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             CurrentTagesStr;                                          // 0x02F0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyPresetWidget");
		return pStaticClass;
	}


	void SetResult(class UPresetDesc* Value);
	void SetPresets(TArray<class UPresetDesc*> Presets);
	void ResetMenuItem();
	struct FString OnFilterBtnClick();
	void LoopScrollBoxFilterStr(const struct FString& filter);
	void LoopScrollBoxFilterByTag(TMap<int, struct FIntArrayWrapper> Tags, TArray<struct FString> curTagsStr);
	void InitPresets();
	class UPresetDesc* GetPresetDesc();
	class UScrollBox* GetLoopScrollBox();
	bool GetIsIconWidget();
	void ClearSearchText();
};


// Class BlockyLua.BlockyRichTextBlock
// 0x0300 (0x0428 - 0x0128)
class UBlockyRichTextBlock : public UTextLayoutWidget
{
public:
	struct FText                                       Text;                                                     // 0x0128(0x0018) (Edit)
	struct FScriptDelegate                             TextDelegate;                                             // 0x0140(0x0016) (ZeroConstructor, InstancedReference)
	struct FSlateFontInfo                              Font;                                                     // 0x0150(0x0058) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FLinearColor                                Color;                                                    // 0x01A8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	TArray<class URichTextBlockDecorator*>             Decorators;                                               // 0x01B8(0x0010) (Edit, ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData00[0x260];                                     // 0x01C8(0x0260) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockyRichTextBlock");
		return pStaticClass;
	}


	void SetText(const struct FText& InText);
	struct FText GetText();
};


// Class BlockyLua.BlockySearchResultPanel
// 0x00C8 (0x0328 - 0x0260)
class UBlockySearchResultPanel : public UUserWidget
{
public:
	float                                              DrawBottomDelta;                                          // 0x0260(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              HorizontalMoveCheckDelta;                                 // 0x0264(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              VerticalMoveCheckDelta;                                   // 0x0268(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              WhileRefreshBlockSizeY;                                   // 0x026C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsDragging;                                               // 0x0270(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsHorizontalMove;                                         // 0x0271(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0272(0x0002) MISSED OFFSET
	struct FVector2D                                   TouchStartPosition;                                       // 0x0274(0x0008) (BlueprintVisible, IsPlainOldData)
	struct FVector2D                                   PointAtOffset;                                            // 0x027C(0x0008) (BlueprintVisible, IsPlainOldData)
	int                                                CurrentCategoryIndex;                                     // 0x0284(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                YOffset;                                                  // 0x0288(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TotalHeight_Blocks;                                       // 0x028C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TotalHeight_Graphs;                                       // 0x0290(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TotalHeight_GraphsTitle;                                  // 0x0294(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ViewHeight;                                               // 0x0298(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                totalHeight;                                              // 0x029C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bNeedUpdateTotalHeight_Graphs;                            // 0x02A0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x02A1(0x0007) MISSED OFFSET
	class UBlockyBlockListItemObject*                  ListItemAtPoint;                                          // 0x02A8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class UBlockyMenuItemObject_Search> FoundResults;                                             // 0x02B0(0x0008) (ZeroConstructor, IsPlainOldData)
	class USpacer*                                     BlocksContainer;                                          // 0x02B8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UBlockyLuaLoopScrollBox_MultiItem*           GraphBlocksContainer;                                     // 0x02C0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UClass*                                      GraphBlocksWidgetType;                                    // 0x02C8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      GraphItemBlockWidgetType;                                 // 0x02D0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UBlockyGraphData*                            GraphData;                                                // 0x02D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UScrollBox*                                  TabContainer;                                             // 0x02E0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bShowComment;                                             // 0x02E8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x02E9(0x0003) MISSED OFFSET
	TWeakObjectPtr<class UBlockyGraph>                 LastSelectedGraph;                                        // 0x02EC(0x0008) (ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class UBlockBase>                   LastSelectedBlock;                                        // 0x02F4(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x02FC(0x0004) MISSED OFFSET
	TArray<class UBlockyGraph*>                        CollapsedGraphs;                                          // 0x0300(0x0010) (ZeroConstructor)
	TArray<class UObject*>                             ItemObjectList;                                           // 0x0310(0x0010) (ZeroConstructor)
	ESearchResultVisibleType                           SearchResultVisibleType;                                  // 0x0320(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0321(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = nullptr;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class BlockyLua.BlockySearchResultPanel");
		return pStaticClass;
	}


	void UpdateGraphContentSize();
	void ToggleGraphResults(class UBlockyGraph* InGraph);
	void ScrollToCategory(int CategoryIndex, bool GraphCategory);
	void RefreshGraphBlocksWidgets();
	void OnGraphBlocksCreated(class UWidget* Widget, int Index);
