#pragma once

// PUBG_VNG -64bit (4.2.0) SDK by BangJO [Z] DM @isar_hackJO To Buy Tool SDK

namespace SDK
{
//---------------------By BangJO---------------------------
//Script Structs
//---------------------By BangJO---------------------------

// UserDefinedStruct BP_STRUCT_PlanPH_StoreCfg_type.BP_STRUCT_PlanPH_StoreCfg_type
// 0x00CC
struct FBP_STRUCT_PlanPH_StoreCfg_type
{
	struct FString                                     app_list_0_65F8844041E2E4BF51DC7D310DEFD8F4;              // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     close_ver_1_609A9DC0502A139918F2AB080E25E952;             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                daily_buy_limit_2_28855D401B260D595A5AE09D07E33E14;       // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	struct FString                                     default_music_3_2DF8C680694C5FA256C90A1B0F50FF43;         // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                is_new_4_72DB2E807A7CECC4046D7FC909D3EF27;                // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                is_pdp_5_7800CD004FD00842046D56E109D3ED50;                // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_count_6_4F603B0069BE9E1402E833CA0AB1BC14;            // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_des_7_1E0C3FC043A3A6E90D6DD720004AB313;              // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_title_8_0B3B794004CF108301CD64760A84DB65;            // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
	struct FString                                     items_name_9_157635C029666F212F58207B0F7D9875;            // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                label_A_ID_10_27E290404BFF0CCF3D621987020AAED4;           // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                label_B_ID_11_211F30804F6E8F8E3D60B384020A9ED4;           // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                manor_draw_id_12_6990C2C06B11B82173C9AEC005652F34;        // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                money1_price_13_237020000DCF8E404A9AED550D6748B5;         // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                money1_type_14_38164BC027EBC01364B217BF02D6CC15;          // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                money2_price_15_6278604000053D270B65EB930E6748B5;         // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                money2_type_16_2BCAAC0054B39F526611CEA502E6CC15;          // 0x0078(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                off_rate_17_4A1F9EC0167BD19D0FDAB541064D6125;             // 0x007C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     open_ver_18_32A104C07F4658154325BFEC0C498572;             // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                permanet_buy_limit_19_57E5AF8078C58E925EEBC8ED04E2C364;   // 0x0090(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PH_item_id_20_7A6041C013F9DF2B6CD7B0390B41CD14;           // 0x0094(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PH_shop_id_21_1C592480788627EC45404BF1021DDD14;           // 0x0098(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x009C(0x0004) MISSED OFFSET
	struct FString                                     sale_begin_time_22_710B13007F8943FA164C72B1062DB105;      // 0x00A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     sale_end_time_23_6D6A9F8045BC6F404EE6CE90008C8505;        // 0x00B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                shop_rank_24_51C6FE801014B65A41A621AF0EF8141B;            // 0x00C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                week_buy_limit_25_5E31438051DC4B2259E3EE97002E54D4;       // 0x00C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                off_rate_hours_27_21F782C00FEBFAA350D6FA950D140DB3;       // 0x00C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

